ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
//===-- RL78ISelLowering.cpp - RL78 DAG Lowering Implementation ---------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file implements the interfaces that RL78 uses to lower LLVM code into a
// selection DAG.
//
//===----------------------------------------------------------------------===//

#include "RL78ISelLowering.h"
#include "MCTargetDesc/RL78MCExpr.h"
#include "RL78MachineFunctionInfo.h"
#include "RL78TargetMachine.h"
#include "llvm/CodeGen/CallingConvLower.h"
#include "llvm/CodeGen/MachineJumpTableInfo.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/SelectionDAG.h"
#include "llvm/CodeGen/SelectionDAGNodes.h"
#include "llvm/IR/Type.h"
#include "llvm/IR/IntrinsicsRL78.h"
#include "llvm/Support/KnownBits.h"
#include <algorithm>
#include <cassert>
#include <cstdint>
#include <iterator>
#include <list>
#include <utility>
#include <vector>

using namespace llvm;

#include "RL78GenRegisterInfo.inc"

//===----------------------------------------------------------------------===//
// Calling Convention Implementation
//===----------------------------------------------------------------------===//

#include "RL78GenCallingConv.inc"

/// Return the type that should be used to zero or sign extend a
/// zeroext/signext integer return value.  FIXME: Some C calling conventions
/// require the return type to be promoted, but this is not true all the time,
/// e.g. i1/i8/i16 on x86/x86_64. It is also not necessary for non-C calling
/// conventions. The frontend should handle this and include all of the
/// necessary information.
EVT RL78TargetLowering::getTypeForExtReturn(LLVMContext &Context, EVT VT,
                                            ISD::NodeType ExtendKind) const {
  MVT ReturnMVT = MVT::i16;
  if ((VT == MVT::i1) || (VT == MVT::i8))
    ReturnMVT = MVT::i8;

  EVT MinVT = getRegisterType(Context, ReturnMVT);
  return VT.bitsLT(MinVT) ? MinVT : VT;
}

/// Check whether the return values
/// described by the Outs array can fit into the return registers.  If false
/// is returned, an sret-demotion is performed.
SDValue
RL78TargetLowering::LowerReturn(SDValue Chain, CallingConv::ID CallConv,
                                bool IsVarArg,
                                const SmallVectorImpl<ISD::OutputArg> &Outs,
                                const SmallVectorImpl<SDValue> &OutVals,
                                const SDLoc &DL, SelectionDAG &DAG) const {

  MachineFunction &MF = DAG.getMachineFunction();

  // CCValAssign - represent the assignment of the return value to locations.
  SmallVector<CCValAssign, 16> RVLocs;
  // CCState - Info about the registers and stack slot.
  CCState CCInfo(CallConv, IsVarArg, DAG.getMachineFunction(), RVLocs,
                 *DAG.getContext());
  if (MF.getSubtarget<RL78Subtarget>().HasCCRLCallingConvention())
    AnalyzeCCRLReturnOperands(CCInfo, Outs);
  else
    CCInfo.AnalyzeReturn(Outs, RetCC_RL78_LLVM);

  // Chain.dump();
  // Copy the result values into the output registers.
  SDValue Flag;
  SmallVector<SDValue, 4> RetOps(1, Chain);
  for (unsigned i = 0, realRVLocIdx = 0, e = RVLocs.size(); i != e;
       ++i, ++realRVLocIdx) {
    CCValAssign &VA = RVLocs[i];
    assert(VA.isRegLoc() && "Can only return in registers!");
    SDValue Arg = OutVals[realRVLocIdx];
    // Arg.dump(&DAG);

    switch (VA.getLocInfo()) {
    default:
      // Loc info must be one of Full, SExt, ZExt, or AExt.
      llvm_unreachable("Unknown loc info!");
    case CCValAssign::Full:
      break;
    case CCValAssign::Trunc:
      Arg = DAG.getNode(ISD::TRUNCATE, DL, VA.getLocVT(), Arg);
      break;
    }

    Chain = DAG.getCopyToReg(Chain, DL, VA.getLocReg(), Arg, Flag);

    // Guarantee that all emitted copies are stuck together with flags.
    Flag = Chain.getValue(1);
    RetOps.push_back(DAG.getRegister(VA.getLocReg(), VA.getLocVT()));
  }

  RetOps[0] = Chain; // Update chain.

  // If the function has a StructRet.
  if (MF.getFunction().hasStructRetAttr()) {
    RL78MachineFunctionInfo *SFI = MF.getInfo<RL78MachineFunctionInfo>();
    unsigned Reg = SFI->getSRetReturnReg();
    if (!Reg)
      llvm_unreachable("sret virtual register not created in the entry block");
    auto PtrVT = getPointerTy(DAG.getDataLayout());
    SDValue Val = DAG.getCopyFromReg(Chain, DL, Reg, PtrVT);
    Chain = DAG.getCopyToReg(Chain, DL, RL78::RP0, Val, Flag);
    Flag = Chain.getValue(1);
    RetOps.push_back(DAG.getRegister(RL78::RP0, PtrVT));
  }

  // Add the flag if we have it.
  if (Flag.getNode())
    RetOps.push_back(Flag);

  // MF.getFunction().dump();
  if (MF.getFunction().hasFnAttribute("brk_interrupt"))
    return DAG.getNode(RL78ISD::RETB, DL, MVT::Other, RetOps);
  else if (MF.getFunction().hasFnAttribute("interrupt"))
    return DAG.getNode(RL78ISD::RETI, DL, MVT::Other, RetOps);
  else
    return DAG.getNode(RL78ISD::RET, DL, MVT::Other, RetOps);
}

bool RL78TargetLowering::CanLowerReturn(
    CallingConv::ID CallConv, MachineFunction &MF, bool isVarArg,
    const SmallVectorImpl<ISD::OutputArg> &Outs, LLVMContext &Context) const {
  // TODO for CCRL callconv only.
  uint64_t size = 0;
  for (auto arg : Outs)
    size += arg.VT.getSizeInBits();

  return size <= 32;
}

/// Lower the incoming (formal) arguments,
/// described by the Ins array, into the specified DAG. The implementation
/// should fill in the InVals array with legal-type argument values, and
/// return the resulting token chain value.
SDValue RL78TargetLowering::LowerFormalArguments(
    SDValue Chain, CallingConv::ID CallConv, bool IsVarArg,
    const SmallVectorImpl<ISD::InputArg> &Ins, const SDLoc &DL,
    SelectionDAG &DAG, SmallVectorImpl<SDValue> &InVals) const {
  MachineFunction &MF = DAG.getMachineFunction();
  MachineFrameInfo &MFI = MF.getFrameInfo();

  // Assign locations to all of the incoming arguments.
  SmallVector<CCValAssign, 16> ArgLocs;
  CCState CCInfo(CallConv, IsVarArg, DAG.getMachineFunction(), ArgLocs,
                 *DAG.getContext());
  if (MF.getSubtarget<RL78Subtarget>().HasCCRLCallingConvention())
    AnalyzeCCRLFormalOperands(CCInfo, Ins);
  else
    CCInfo.AnalyzeFormalArguments(Ins, CC_RL78_LLVM);

  unsigned InIdx = 0;
  for (unsigned i = 0, e = ArgLocs.size(); i != e; ++i, ++InIdx) {
    CCValAssign &VA = ArgLocs[i];

    if (VA.isRegLoc()) {
      SDValue Arg;
      if (VA.getLocVT() == MVT::i8) {
        if (VA.getValVT() == MVT::i16) {
          // Revert the truncation of the pointer.
          unsigned VReg =
              MF.getRegInfo().createVirtualRegister(&RL78::RL78RegRegClass);
          MF.getRegInfo().addLiveIn(VA.getLocReg(), VReg);
          Arg = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i8);
          Arg = DAG.getNode(ISD::ZERO_EXTEND, DL, VA.getValVT(), Arg);
        } else {
          unsigned VReg =
              MF.getRegInfo().createVirtualRegister(&RL78::RL78RegRegClass);
          MF.getRegInfo().addLiveIn(VA.getLocReg(), VReg);
          Arg = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i8);
        }
      } else if (VA.getLocVT() == MVT::i16) {
        unsigned VReg =
            MF.getRegInfo().createVirtualRegister(&RL78::RL78RPRegsRegClass);
        MF.getRegInfo().addLiveIn(VA.getLocReg(), VReg);
        Arg = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i16);
      } else if (VA.getLocVT() == MVT::i32) {
        unsigned VReg =
            MF.getRegInfo().createVirtualRegister(&RL78::RL78RPRegsRegClass);
        MF.getRegInfo().addLiveIn(VA.getLocReg(), VReg);
        SDValue HiPart = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i16);
        Arg = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i16);
      } else {
        llvm_unreachable("Not implemented!");
      }
      InVals.push_back(Arg);
      continue;
    }
    assert(VA.isMemLoc());

