ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    int StackLocation = -4 - VA.getLocMemOffset();

    int FI = MFI.CreateFixedObject(2, StackLocation, true);
    SDValue FIN = DAG.getFrameIndex(FI, MVT::i16);
    InVals.push_back(
        DAG.getLoad(VA.getValVT(), DL, Chain, FIN, MachinePointerInfo()));
  }

  if (MF.getFunction().hasStructRetAttr()) {
    // Copy the SRet Argument to SRetReturnReg.
    RL78MachineFunctionInfo *SFI = MF.getInfo<RL78MachineFunctionInfo>();
    unsigned Reg = SFI->getSRetReturnReg();
    if (!Reg) {
      Reg = MF.getRegInfo().createVirtualRegister(&RL78::RL78RPRegsRegClass);
      SFI->setSRetReturnReg(Reg);
    }
    SDValue Copy = DAG.getCopyToReg(DAG.getEntryNode(), DL, Reg, InVals[0]);
    Chain = DAG.getNode(ISD::TokenFactor, DL, MVT::Other, Copy, Chain);
  }
  // If the function takes variable number of arguments, make a frame index for
  // the start of the first vararg value... for expansion of llvm.va_start.
  if (IsVarArg) {
    // static const MCPhysReg ArgRegs[] = { RL78::RP0, RL78::RP2, RL78::RP4 };
    // unsigned NumAllocated = CCInfo.getFirstUnallocated(ArgRegs);
    // const MCPhysReg *CurArgReg = ArgRegs + NumAllocated,
    //                *ArgRegEnd = ArgRegs + 3;
    // int StackOffset = CCInfo.getNextStackOffset() + 4;
    // unsigned StackSize = MF.getFrameInfo().getStackSize();
    RL78MachineFunctionInfo *RL78MFI = MF.getInfo<RL78MachineFunctionInfo>();
    int FI =
        MFI.CreateFixedObject(2, -4 - (int)CCInfo.getNextStackOffset(), true);
    RL78MFI->setVarArgsFrameOffset(FI);
    // std::vector<SDValue> OutChains;
    //   //MF.getFrameInfo().getStackSize();
    // for (; CurArgReg != ArgRegEnd; ++CurArgReg) {
    //  unsigned VReg =
    //  MF.getRegInfo().createVirtualRegister(&RL78::RL78RPRegsRegClass);
    //     MF.getRegInfo().addLiveIn(*CurArgReg, VReg);
    //     SDValue Arg = DAG.getCopyFromReg(Chain, DL, VReg, MVT::i16);
    //     StackOffset -= 2;
    //     int FI = MFI.CreateFixedObject(2, StackOffset, true);
    //     SDValue FIN = DAG.getFrameIndex(FI, MVT::i16);
    //     OutChains.push_back(
    //         DAG.getStore(DAG.getRoot(), DL, Arg, FIN, MachinePointerInfo()));
    //}

    ////MF.getFrameInfo().setStackSize(MF.getFrameInfo().getStackSize() +
    /// StackOffset);

    // if (!OutChains.empty()) {
    //     OutChains.push_back(Chain);
    //     Chain = DAG.getNode(ISD::TokenFactor, DL, MVT::Other, OutChains);
    //   }
  }
  // Chain.dump();
  return Chain;
}

static bool TraverseMergeValues(SDValue RootNode, SDValue &LoadAddr) {
  if (RootNode.getOpcode() == ISD::MERGE_VALUES && RootNode.getResNo() != 0)
    return false;

  unsigned int StepSize;

  if (RootNode.getValueType() == MVT::i8)
    StepSize = 1;
  else if (RootNode.getValueType() == MVT::i16)
    StepSize = 2;
  else
    return false;

  // loadAddr = BaseAddr + BaseAddrStartingOffset
  LoadAddr = RootNode;
  while (LoadAddr.getOpcode() == ISD::MERGE_VALUES)
    LoadAddr = LoadAddr.getOperand(0);
  if (LoadAddr.getOpcode() != ISD::LOAD) {
    return false;
  } else {
    LoadAddr = LoadAddr.getOperand(1);
  }

  SDValue BaseAddr = LoadAddr;
  unsigned int BaseAddrStartingOffset = 0;

  if (LoadAddr.getOpcode() == ISD::ADD) {
    BaseAddr = LoadAddr.getOperand(0);
    if (LoadAddr.getOperand(1).getOpcode() != ISD::Constant)
      return false;
    else
      BaseAddrStartingOffset = LoadAddr.getConstantOperandVal(1);
  }

  // We now have to check for memory continuity:
  // We are checking that the loads of the merged values are located
  // in memory continously, with the correct step size.
  for (size_t i = RootNode.getNumOperands() - 1; i > 0; i--) {
    SDValue CurrentLoad = RootNode.getOperand(i);
    while (CurrentLoad.getOpcode() == ISD::MERGE_VALUES)
      CurrentLoad = CurrentLoad.getOperand(i);
    if (CurrentLoad.getOpcode() != ISD::LOAD)
      return false;
    if (CurrentLoad.getOperand(1).getOpcode() != ISD::ADD)
      return false;
    if (CurrentLoad.getOperand(1).getOperand(1).getOpcode() != ISD::Constant)
      return false;
    unsigned int CurrentOffset =
        CurrentLoad.getOperand(1).getConstantOperandVal(1);
    SDValue CurrentBaseAddr = CurrentLoad.getOperand(1).getOperand(0);

    // Walk the possible ADD chains.
    // We can have ADD baseAddr, Constant or
    // ADD temp1, Constant where temp1 was an ADD baseAddr, Constant.
    while (CurrentBaseAddr != BaseAddr &&
           CurrentBaseAddr.getOpcode() == ISD::ADD) {
      if (CurrentBaseAddr.getOperand(1).getOpcode() != ISD::Constant)
        return false;
      CurrentOffset += CurrentBaseAddr.getConstantOperandVal(1);
      CurrentBaseAddr = CurrentBaseAddr.getOperand(0);
    }
    if (CurrentBaseAddr != BaseAddr ||
        CurrentOffset != (i * StepSize + BaseAddrStartingOffset))
      return false;
  }

  return true;
}

/// Lower calls into the specified
/// DAG. The outgoing arguments to the call are described by the Outs array,
/// and the values to be returned by the call are described by the Ins
/// array. The implementation should fill in the InVals array with legal-type
/// return values from the call, and return the resulting token chain value.
SDValue RL78TargetLowering::LowerCall(TargetLowering::CallLoweringInfo &CLI,
                                      SmallVectorImpl<SDValue> &InVals) const {
  SelectionDAG &DAG = CLI.DAG;
  SDLoc &dl = CLI.DL;
  SmallVectorImpl<ISD::OutputArg> &Outs = CLI.Outs;
  SmallVectorImpl<SDValue> &OutVals = CLI.OutVals;
  SmallVectorImpl<ISD::InputArg> &Ins = CLI.Ins;
  SDValue Chain = CLI.Chain;
  SDValue Callee = CLI.Callee;
  bool &isTailCall = CLI.IsTailCall;
  CallingConv::ID CallConv = CLI.CallConv;
  bool isVarArg = CLI.IsVarArg;
  MachineFunction &MF = DAG.getMachineFunction();

  // Analyze operands of the call, assigning locations to each operand.
  SmallVector<CCValAssign, 16> ArgLocs;
  CCState CCInfo(CallConv, isVarArg, DAG.getMachineFunction(), ArgLocs,
                 *DAG.getContext());
  if (MF.getSubtarget<RL78Subtarget>().HasCCRLCallingConvention())
    AnalyzeCCRLCallOperands(CCInfo, Outs);
  else
    CCInfo.AnalyzeCallOperands(Outs, CC_RL78_LLVM);

  bool hasFP = MF.getSubtarget<RL78Subtarget>().getFrameLowering()->hasFP(MF);

  // Get the size of the outgoing arguments stack space requirement.
  unsigned ArgsSize = CCInfo.getNextStackOffset();

  if (ArgsSize & 1)
    ArgsSize++;

  // Consider the saved FP as the last argument.
  if (hasFP)
    ArgsSize += 2;

  // Keep stack frames 2-byte aligned.
  // ArgsSize = (ArgsSize + 7) & ~3;
  // ArgsSize &= ~3;

  MachineFrameInfo &MFI = DAG.getMachineFunction().getFrameInfo();

