ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  SmallVector<std::pair<unsigned, SDValue>, 16> RegsToPass;
  SmallVector<SDValue, 8> MemOpChains;

  // Create local copies for byval args.
  SmallVector<SDValue, 8> ByValArgs;
  for (unsigned i = 0, e = Outs.size(); i != e; ++i) {
    ISD::ArgFlagsTy Flags = Outs[i].Flags;
    if (!Flags.isByVal())
      continue;

    SDValue Arg = OutVals[i];
    // Arg.dump(&DAG);
    unsigned Size = Flags.getByValSize();
    Align Alignment = Flags.getNonZeroByValAlign();
    // Size == 0 can be reproduced with pr23135.c from gcc c-torture.
    if (Size > 0U) {
      int FI = MFI.CreateStackObject(Size, Alignment, false);
      SDValue FIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
      SDValue SizeNode = DAG.getConstant(Size, dl, MVT::i16);
      Chain = DAG.getMemcpy(Chain, dl, FIPtr, Arg, SizeNode, Alignment,
                            false,       // isVolatile,
                            (Size <= 2), // AlwaysInline if size <= 2,
                            false,       // isTailCall
                            MachinePointerInfo(), MachinePointerInfo());
      ByValArgs.push_back(FIPtr);
    } else {
      SDValue nullVal;
      ByValArgs.push_back(nullVal);
    }
  }

  // Increments depending on the number of registers from the calling conv
  // we will increment with 1 for i8 register and with 2 for an i16 register.
  int noImplicitNotDeadRegs = 0;

  // We want to keep track if we are using ax or a and x separatelly
  // if noImplicitNotDeadRegs >=5 is safe to assume that both r0 and r1 are in
  // use We choose to save R0/R1 instead of always using RP0 (also using RP0
  // when an 8 bit value is present) because saving R0/R1 will cost 1 execution
  // cycle less 0 if none of the registers R0, R1 or RP0 are used 1 if R0 is
  // used and not R1 2 if R1 is used and not R0 3 if R0 and R1 are used 4 if RP0
  // is used.
  unsigned int usesR0andorR1 = 0;

  for (unsigned i = 0, e = ArgLocs.size(); i != e; ++i) {
    CCValAssign &VA = ArgLocs[i];
    if (VA.isRegLoc()) {
      unsigned Reg = VA.getLocReg();
      if (Reg == RL78::R0 || Reg == RL78::R1 || Reg == RL78::R2 ||
          Reg == RL78::R3 || Reg == RL78::R4 || Reg == RL78::R5) {
        noImplicitNotDeadRegs = noImplicitNotDeadRegs + 1;
        if (Reg == RL78::R0)
          usesR0andorR1 = usesR0andorR1 + 1; // 1 if R0 is used and not R1.
        if (Reg == RL78::R1)
          usesR0andorR1 = usesR0andorR1 + 2; // 2 if R1 is used and not R0.
        // usesR0andorR1 is 3 if R0 and R1 are used.
      } else if (Reg == RL78::RP0 || Reg == RL78::RP2 || Reg == RL78::RP4) {
        noImplicitNotDeadRegs = noImplicitNotDeadRegs + 2;
        if (Reg == RL78::RP0)
          usesR0andorR1 = 4; // 4 if RP0 is used.
      }
    }
  }

  // Checking if we will run out of registers in case of call_rp and no register
  // left for the call.
  bool willRunOutOfRegs = !dyn_cast<ExternalSymbolSDNode>(Callee) &&
                          !dyn_cast<GlobalAddressSDNode>(Callee) && hasFP &&
                          noImplicitNotDeadRegs >= 5;

  if (willRunOutOfRegs)
    ArgsSize += 4;

  Chain = DAG.getCALLSEQ_START(Chain, ArgsSize, 0, dl);

  bool isMemLoc = false;
  // Walk the register / memloc assignments, inserting copies / loads.
  int fpOffset = 0;
  for (unsigned i = 0, byvalArgIdx = 0, e = ArgLocs.size(); i < e; ++i) {
    CCValAssign &VA = ArgLocs[i];
    SDValue Arg = OutVals[i];
    ISD::ArgFlagsTy Flags = Outs[i].Flags;

    // Use local copy if it is a byval arg.
    if (Flags.isByVal()) {
      Arg = ByValArgs[byvalArgIdx++];
      if (!Arg) {
        continue;
      }
    }

    // Promote the value if needed.
    switch (VA.getLocInfo()) {
    default:
      // Loc info must be one of Full, SExt, ZExt, or AExt.
      llvm_unreachable("Unknown loc info!");
    case CCValAssign::Full:
      break;
    case CCValAssign::Trunc:
      Arg = DAG.getNode(ISD::TRUNCATE, dl, VA.getLocVT(), Arg);
      break;
    case CCValAssign::BCvt:
      Arg = DAG.getNode(ISD::BITCAST, dl, VA.getLocVT(), Arg);
      break;
    case CCValAssign::SExt:
      Arg = DAG.getNode(ISD::SIGN_EXTEND, dl, VA.getLocVT(), Arg);
      break;
    case CCValAssign::ZExt:
      Arg = DAG.getNode(ISD::ZERO_EXTEND, dl, VA.getLocVT(), Arg);
      break;
    case CCValAssign::AExt:
      Arg = DAG.getNode(ISD::ANY_EXTEND, dl, VA.getLocVT(), Arg);
      break;
    }

    // Arguments that can be passed on register must be kept at RegsToPass
    // vector.
    if (VA.isRegLoc()) {
      RegsToPass.push_back(std::make_pair(VA.getLocReg(), Arg));
    } else if (VA.isMemLoc()) {
      isMemLoc = true;
      unsigned int MaxStores = DAG.shouldOptForSize()
                                   ? MaxStoresPerMemcpyOptSize
                                   : MaxStoresPerMemcpy;
      SDValue LoadAddr;
      if (Arg.getNumOperands() > MaxStores &&
          TraverseMergeValues(Arg, LoadAddr)) {

        // we will use memcpy instead of individual stores for this argument
        unsigned PartNum = Arg->getNumValues();
        int Offset = VA.getLocMemOffset();
        unsigned Size = Arg.getValueSizeInBits() * PartNum / 8;
        int FI = MF.getFrameInfo().CreateFixedObject(Size, Offset, true);
        SDValue FIPtr =
            DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
        SDValue SizeNode = DAG.getConstant(Size, dl, MVT::i16);
        SDValue MemCpyChain =
            DAG.getMemcpy(Chain, dl, FIPtr, LoadAddr, SizeNode, Align(2),
                          false, // isVolatile,
                          false, // AlwaysInline
                          false, // isTailCall
                          MachinePointerInfo(), MachinePointerInfo());

        fpOffset = ArgLocs[i + PartNum - 1].getLocMemOffset() + 2;
        i += PartNum - 1;
        MemOpChains.push_back(MemCpyChain);
      } else {
        int Offset = VA.getLocMemOffset();
        fpOffset = Offset + 2;
        int FI = MF.getFrameInfo().CreateFixedObject(
            Arg.getValueSizeInBits() / 8, Offset, true);

        SDValue FIPtr =
            DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
        MemOpChains.push_back(
            DAG.getStore(Chain, dl, Arg, FIPtr, MachinePointerInfo()));
      }

