ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
      //// TODO if renesas extensions, promote near pointer to varg if it a
      /// va_arg
      // if (Flags.isPointer() && Flags.getPointerAddrSpace() == 0 &&
      //! Outs[i].IsFixed) {
      //  // Fill the stack slot with 0x000F for the promoted near pointer
      //  FI = MF.getFrameInfo().CreateFixedObject(2,  Offset + 2, true);
      //  SDValue FIPtr =
      //      DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
      //  SDValue NearSegment =
      //      DAG.getConstant(0x000F, dl, MVT::i16);
      //  MemOpChains.push_back(
      //      DAG.getStore(Chain, dl, NearSegment, FIPtr,
      //      MachinePointerInfo()));
      //}
    }
  }

  if (!dyn_cast<GlobalAddressSDNode>(Callee) || isMemLoc)
    isTailCall = false;

  SDValue SavedFPFIPtr;
  SDValue SavedFP;
  // Save the FP, will be restored by CALL_FP.
  if (hasFP) {
    int FI;
    if (willRunOutOfRegs) {
      FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset + 4, true);
    } else {
      FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset, true);
    }
    SavedFPFIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
    SavedFP = SavedFPFIPtr;
    MemOpChains.push_back(DAG.getStore(Chain, dl,
                                       DAG.getRegister(RL78::RP6, MVT::i16),
                                       SavedFPFIPtr, MachinePointerInfo()));
  }

  if (!MemOpChains.empty())
    Chain = DAG.getNode(ISD::TokenFactor, dl, MVT::Other, MemOpChains);

  // Build a sequence of copy-to-reg nodes chained together with token chain and
  // flag operands which copy the outgoing args into registers.  The InFlag in
  // necessary since all emitted instructions must be stuck together.
  SDValue InFlag;

  // We need these variables in case willRunOutOfRegs is true.
  SDValue AxReg = DAG.getRegister(RL78::RP0, MVT::i16);
  SDValue AReg = DAG.getRegister(RL78::R1, MVT::i8);
  SDValue CSReg = DAG.getRegister(RL78::CS, MVT::i8);
  SDValue HlReg = DAG.getRegister(RL78::RP6, MVT::i16);
  SDValue SavedAxFIPtr;

  if (willRunOutOfRegs) {
    if (Callee.getValueType() == MVT::i32) {
      SDValue Low = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, Callee,
                                DAG.getConstant(0, dl, MVT::i16));
      SDValue High = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, Callee,
                                 DAG.getConstant(1, dl, MVT::i16));
      SDValue Segment = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i8, High,
                                    DAG.getConstant(0, dl, MVT::i8));
      Chain = DAG.getCopyToReg(Chain, dl, AReg, Segment, InFlag);
      Chain = DAG.getCopyToReg(Chain, dl, CSReg, AReg, InFlag);
      Chain = DAG.getCopyToReg(Chain, dl, AxReg, Low, InFlag);
    } else {
      Chain = DAG.getCopyToReg(Chain, dl, AxReg, Callee, InFlag);
    }

    // Put ax on stack.
    int FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset, true);
    SavedFPFIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
    Chain = DAG.getStore(Chain, dl, AxReg, SavedFPFIPtr, MachinePointerInfo());
  }

  // We do this backwards because R1/RP0 it's more optimal.
  for (int i = RegsToPass.size() - 1; i >= 0; --i) {
    unsigned Reg = RegsToPass[i].first;
    Chain = DAG.getCopyToReg(Chain, dl, Reg, RegsToPass[i].second, InFlag);
    InFlag = Chain.getValue(1);
  }

  if (willRunOutOfRegs) {

    switch (usesR0andorR1) {
    case 3:
    case 4: {
      int FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset + 2, true);
      SavedAxFIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
      Chain =
          DAG.getStore(Chain, dl, AxReg, SavedAxFIPtr, MachinePointerInfo());
      break;
    }
    case 1: {
      int FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset + 2, true);
      SavedAxFIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
      Chain = DAG.getStore(Chain, dl, DAG.getRegister(RL78::R0, MVT::i8),
                           SavedAxFIPtr, MachinePointerInfo());
    }
    case 2: {
      int FI = MF.getFrameInfo().CreateFixedObject(2, fpOffset + 2, true);
      SavedAxFIPtr = DAG.getFrameIndex(FI, getPointerTy(DAG.getDataLayout()));
      Chain = DAG.getStore(Chain, dl, DAG.getRegister(RL78::R1, MVT::i8),
                           SavedAxFIPtr, MachinePointerInfo());
      break;
    }
    default:
      llvm_unreachable("R0 or R1 are not used.");
      break;
    }
  }

  bool IsCallt = false;
  bool IsFarFunction = false;
  // If the callee is a GlobalAddress node (quite common, every direct call is)
  // turn it into a TargetGlobalAddress node so that legalize doesn't hack it.
  // Likewise ExternalSymbol -> TargetExternalSymbol.
  if (GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(Callee)) {
    if (const Function *F = dyn_cast<Function>(G->getGlobal())) {
      IsFarFunction = F->getAddressSpace() == RL78AS::Far;
      IsCallt = F->hasFnAttribute("callt");
    }
    if (IsFarFunction)
      Callee = DAG.getTargetGlobalAddress(G->getGlobal(), SDLoc(G), MVT::i32,
                                          G->getOffset());
    else
      Callee =
          DAG.getTargetGlobalAddress(G->getGlobal(), SDLoc(G), MVT::i16,
                                     G->getOffset(), RL78MCExpr::VK_RL78_None);
  }
  // else if (ExternalSymbolSDNode *E = dyn_cast<ExternalSymbolSDNode>(Callee))
  //    Callee = DAG.getTargetExternalSymbol(E->getSymbol(), MVT::i16);

  // Callee.dump();
  // if (GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(Callee)) {
  //  G->getGlobal()->getAlignment();
  //}

  if (willRunOutOfRegs) {

    Chain = DAG.getLoad(MVT::i16, dl, Chain.getValue(0), SavedFPFIPtr,
                        MachinePointerInfo());
    InFlag = Chain.getValue(1);
    Chain = DAG.getCopyToReg(Chain, dl, HlReg, Chain.getValue(0), InFlag);
    InFlag = Chain.getValue(1);

    switch (usesR0andorR1) {
    case 3:
    case 4: {
      Chain =
          DAG.getLoad(MVT::i16, dl, Chain, SavedAxFIPtr, MachinePointerInfo());
      InFlag = Chain.getValue(1);

      Chain = DAG.getCopyToReg(Chain, dl, AxReg, Chain.getValue(0), InFlag);
      InFlag = Chain.getValue(1);
      break;
    }
    case 1: {
      Chain =
          DAG.getLoad(MVT::i8, dl, Chain, SavedAxFIPtr, MachinePointerInfo());
      InFlag = Chain.getValue(1);

      Chain = DAG.getCopyToReg(Chain, dl, DAG.getRegister(RL78::R0, MVT::i8),
                               Chain.getValue(0), InFlag);
      InFlag = Chain.getValue(1);
      break;
    }
    case 2: {
      Chain =
          DAG.getLoad(MVT::i8, dl, Chain, SavedAxFIPtr, MachinePointerInfo());
      InFlag = Chain.getValue(1);

