ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
      Chain = DAG.getCopyToReg(Chain, dl, DAG.getRegister(RL78::R1, MVT::i8),
                               Chain.getValue(0), InFlag);
      InFlag = Chain.getValue(1);
      break;
    }
    default:
      llvm_unreachable("R0 or R1 are not used.");
      break;
    }

    Callee = HlReg.getValue(0);
  }

  // Returns a chain & a flag for retval copy to use.
  SDVTList NodeTys = DAG.getVTList(MVT::Other, MVT::Glue);
  SmallVector<SDValue, 8> Ops;
  Ops.push_back(Chain);
  Ops.push_back(Callee);
  if (hasFP)
    Ops.push_back(SavedFP);

  for (unsigned i = 0, e = RegsToPass.size(); i != e; ++i)
    Ops.push_back(DAG.getRegister(RegsToPass[i].first,
                                  RegsToPass[i].second.getValueType()));

  const uint32_t *Mask =
      MF.getSubtarget<RL78Subtarget>().getRegisterInfo()->getCallPreservedMask(
          MF, CallConv);
  Ops.push_back(DAG.getRegisterMask(Mask));

  if (InFlag.getNode())
    Ops.push_back(InFlag);

  if (IsCallt)
    Chain = DAG.getNode(RL78ISD::CALLT, dl, NodeTys, Ops);
  // After the call the FP is invalid and the reg alloc can insert a load from
  // stack, see: SingleSource\BenchMarks\BenchMarkGame\spectral-norm.c.
  else if (hasFP)
    Chain = DAG.getNode(RL78ISD::CALL_FP, dl, NodeTys, Ops);
  else if (isTailCall)
    Chain = DAG.getNode(RL78ISD::TAIL_CALL, dl, NodeTys, Ops);
  else
    Chain = DAG.getNode(RL78ISD::CALL, dl, NodeTys, Ops);
  InFlag = Chain.getValue(1);

  Chain = DAG.getCALLSEQ_END(Chain, DAG.getIntPtrConstant(ArgsSize, dl, true),
                             DAG.getIntPtrConstant(0, dl, true), InFlag, dl);
  InFlag = Chain.getValue(1);

  // Assign locations to each value returned by this call.
  SmallVector<CCValAssign, 16> RVLocs;
  CCState RVInfo(CallConv, isVarArg, DAG.getMachineFunction(), RVLocs,
                 *DAG.getContext());

  if (MF.getSubtarget<RL78Subtarget>().HasCCRLCallingConvention()) {
    AnalyzeCCRLReturnOperands(RVInfo, Ins);
  } else {
    RVInfo.AnalyzeCallResult(Ins, RetCC_RL78_LLVM);
  }

  if (!isTailCall) {
    // Copy all of the result registers out of their specified physreg.
    for (unsigned i = 0, e = RVLocs.size(); i != e; ++i) {
      Chain = DAG.getCopyFromReg(Chain, dl, RVLocs[i].getLocReg(),
                                 RVLocs[i].getLocVT(), InFlag)
                  .getValue(1);
      SDValue returnVal = Chain.getValue(0);
      switch (RVLocs[i].getLocInfo()) {
      default:
        llvm_unreachable("Unknown loc info!");
      case CCValAssign::Full:
        InFlag = Chain.getValue(2);
        InVals.push_back(returnVal);
        break;
      case CCValAssign::Trunc:
        SDVTList NodeTys = DAG.getVTList(RVLocs[i].getValVT(), MVT::Other);
        SDValue extended =
            DAG.getNode(ISD::ANY_EXTEND, dl, NodeTys, returnVal, InFlag);
        returnVal = extended.getValue(0);
        InFlag = extended.getValue(1);
        InVals.push_back(returnVal);
        break;
      }
    }
  }

  // DAG.dump();
  return Chain;
}

// Group arguments that were split by LLVM to legal types,
// since according to the CC-RL ABI, variables can't be
// split between registers and the stack when passing them.
template <typename T>
static void GroupArgumentParts(std::vector<std::vector<T>> &args,
                               const SmallVectorImpl<T> &Outs) {
  size_t partCount = Outs.size();
  if (partCount == 0)
    return;

  size_t argCount = 0;
  unsigned int currentOrigArgIndex = Outs[0].OrigArgIndex;
  args.push_back({Outs[0]});

  for (size_t i = 1; i < partCount; i++) {
    if (Outs[i].OrigArgIndex >= currentOrigArgIndex + 1) {
      args.push_back({});
      currentOrigArgIndex = Outs[i].OrigArgIndex;
      argCount++;
    }
    args[argCount].push_back(Outs[i]);
  }
}

static bool allocate3(unsigned R1, unsigned R2, unsigned R3, unsigned ValNo,
                      MVT ValVT, MVT LocVT, CCValAssign::LocInfo LocInfo,
                      CCState &State) {
  bool canAllocate = !State.isAllocated(R1) && !State.isAllocated(R2) &&
                     !State.isAllocated(R3);
  if (canAllocate) {
    State.AllocateReg(R1);
    State.AllocateReg(R2);
    State.AllocateReg(R3);
    State.addLoc(CCValAssign::getReg(ValNo, ValVT, R3, LocVT, LocInfo));
    State.addLoc(CCValAssign::getReg(ValNo + 1, ValVT, R2, LocVT, LocInfo));
    State.addLoc(CCValAssign::getReg(ValNo + 2, ValVT, R1, LocVT, LocInfo));
  }
  return canAllocate;
}

static bool allocateAddr20(unsigned R, unsigned RP, unsigned ValNo, MVT ValVT,
                           CCState &State) {
  bool canAllocate = !State.isAllocated(R) && !State.isAllocated(RP);

  if (canAllocate) {
    State.AllocateReg(R);
    State.AllocateReg(RP);
    State.addLoc(
        CCValAssign::getReg(ValNo + 1, ValVT, RP, ValVT, CCValAssign::Full));
    State.addLoc(
        CCValAssign::getReg(ValNo, ValVT, R, MVT::i8, CCValAssign::Trunc));
  }
  return canAllocate;
}

static const std::vector<MCPhysReg> I8RegList = {RL78::R1, RL78::R0, RL78::R2,
                                                 RL78::R3, RL78::R4, RL78::R5};

static const std::vector<MCPhysReg> I16RegList = {RL78::RP0, RL78::RP2,
                                                  RL78::RP4};

static void AllocateFarPointer(unsigned ValNo, MVT ValVT, CCState &State,
                               unsigned int partCount, bool isReturn = false,
                               bool isVarArg = false) {
  assert(ValVT == MVT::i16 && partCount == 2);

  // Allocate to A-DE, X-DE, C-DE, B-DE, X-BC.

  if (!isVarArg && allocateAddr20(RL78::R1, RL78::RP4, ValNo, ValVT, State))
    return;

  if (isReturn)
    llvm_unreachable("Unable to return far pointer, A-DE already allocated!");

  if (!isVarArg && allocateAddr20(RL78::R0, RL78::RP4, ValNo, ValVT, State))
    return;
  if (!isVarArg && allocateAddr20(RL78::R2, RL78::RP4, ValNo, ValVT, State))
    return;
  if (!isVarArg && allocateAddr20(RL78::R3, RL78::RP4, ValNo, ValVT, State))
    return;
  if (!isVarArg && allocateAddr20(RL78::R0, RL78::RP2, ValNo, ValVT, State))
    return;

  // If we didn't manage to allocate so far, put it on the stack.
  for (size_t i = 0; i < partCount; i++) {
    unsigned size = 2;
    unsigned align = 2;
    unsigned Offset = State.AllocateStack(size, Align(align));
    State.addLoc(CCValAssign::getMem(ValNo + i, ValVT, Offset, ValVT,
                                     CCValAssign::Full));
  }
}

static void AllocateMultiPartArgument(unsigned ValNo, MVT ValVT, MVT LocVT,
                                      CCValAssign::LocInfo LocInfo,
                                      ISD::ArgFlagsTy ArgFlags, CCState &State,
                                      unsigned int partCount,
                                      bool isVarArg = false) {

  // Handle far pointers.
  if (ArgFlags.isPointer() && ArgFlags.getPointerAddrSpace() == RL78AS::Far) {
    AllocateFarPointer(ValNo, ValVT, State, partCount, false, isVarArg);
    return;
  }

  //// TODO if renesas extensions, promote near pointer to varg if it a va_arg
  //// promote near pointer when using varg
  // if (ArgFlags.isPointer() && ArgFlags.getPointerAddrSpace() == 0 &&
  // isVarArg) {
  //  unsigned Offset = State.AllocateStack(2, 2);
  //  State.addLoc(CCValAssign::getMem(ValNo, ValVT, Offset, LocVT, LocInfo));
  //  Offset = State.AllocateStack(2, 2); // reserve space for 0x000F
  //  return;
  //}

  // R0-X, R1=A, R2=C, R3=B, R4=E, R5=D
  if (LocVT == MVT::i8 && !isVarArg) {
    unsigned Reg = RL78::NoRegister;
    if ((partCount == 1) && (Reg = State.AllocateReg(I8RegList))) {
      // Allocate to A, X, C, B, E, D.
      State.addLoc(CCValAssign::getReg(ValNo, ValVT, Reg, LocVT, LocInfo));
      return;
    }
    if (partCount == 2) {
      // Allocate to AX, BC, DE.
      if (!State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::R0, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::R1, LocVT, LocInfo));
        return;
      }
      if (!State.isAllocated(RL78::RP2)) {
        State.AllocateReg(RL78::RP2);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::R2, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::R3, LocVT, LocInfo));
        return;
      }
      if (!State.isAllocated(RL78::RP4)) {
        State.AllocateReg(RL78::RP4);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::R4, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::R5, LocVT, LocInfo));
        return;
      }
    }
    if (partCount == 3) {
      // Allocate to C-AX, X-BC, E-BC, X-DE, B-DE.
      if (allocate3(RL78::R2, RL78::R1, RL78::R0, ValNo, ValVT, LocVT, LocInfo,
                    State))
        return;
      if (allocate3(RL78::R0, RL78::R3, RL78::R2, ValNo, ValVT, LocVT, LocInfo,
                    State))
        return;
      if (allocate3(RL78::R4, RL78::R3, RL78::R2, ValNo, ValVT, LocVT, LocInfo,
                    State))
        return;
      if (allocate3(RL78::R0, RL78::R5, RL78::R4, ValNo, ValVT, LocVT, LocInfo,
                    State))
        return;
      if (allocate3(RL78::R3, RL78::R5, RL78::R4, ValNo, ValVT, LocVT, LocInfo,
                    State))
        return;
    }

    if (partCount == 4) {
      // Allocate BC-AX, DE-BC.
      if (!State.isAllocated(RL78::RP2) && !State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP2);
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::R0, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::R1, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 2, ValVT, RL78::R2, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 3, ValVT, RL78::R3, LocVT, LocInfo));
        return;
      }
      if (!State.isAllocated(RL78::RP4) && !State.isAllocated(RL78::RP2)) {
        State.AllocateReg(RL78::RP4);
        State.AllocateReg(RL78::RP2);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::R2, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::R3, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 2, ValVT, RL78::R4, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 3, ValVT, RL78::R5, LocVT, LocInfo));
        return;
      }
    }
  }

  if (LocVT == MVT::i16 && !isVarArg) {

    unsigned Reg = RL78::NoRegister;
    if ((partCount == 1) && (Reg = State.AllocateReg(I16RegList))) {
      // Allocate to AX, BC, DE.
      State.addLoc(CCValAssign::getReg(ValNo, ValVT, Reg, LocVT, LocInfo));
      return;
    }
    if (partCount == 2) {
      // Allocate BC-AX, DE-BC.
      if (!State.isAllocated(RL78::RP2) && !State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP2);
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::RP0, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::RP2, LocVT, LocInfo));
        return;
      }
      if (!State.isAllocated(RL78::RP4) && !State.isAllocated(RL78::RP2)) {
        State.AllocateReg(RL78::RP4);
        State.AllocateReg(RL78::RP2);
        State.addLoc(
            CCValAssign::getReg(ValNo, ValVT, RL78::RP2, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(ValNo + 1, ValVT, RL78::RP4, LocVT, LocInfo));
        return;
      }
    }
  }

  // If we didn't manage to allocate so far, put it on the stack.
  for (size_t i = 0; i < partCount; i++) {
    unsigned size = LocVT == MVT::i8 ? 1 : 2;
    unsigned align = partCount == 1 ? 2 : size;
    unsigned Offset = State.AllocateStack(size, Align(align));
    State.addLoc(CCValAssign::getMem(ValNo + i, ValVT, Offset, LocVT, LocInfo));
  }
}

