ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
static void AllocateMultiPartReturn(MVT ValVT, MVT LocVT,
                                    CCValAssign::LocInfo LocInfo,
                                    ISD::ArgFlagsTy ArgFlags, CCState &State,
                                    unsigned int partCount) {

  // Handle far pointers.
  if (ArgFlags.isPointer() && ArgFlags.getPointerAddrSpace() == RL78AS::Far) {
    AllocateFarPointer(0, ValVT, State, partCount, true);
    return;
  }

  // Here the valno order doesn't matter that much, the addloc order is used
  // when building up the return chain.
  if (LocVT == MVT::i8) {
    unsigned Reg = RL78::NoRegister;
    if ((partCount == 1) && (Reg = State.AllocateReg(RL78::R1))) {
      // Allocate to A.
      State.addLoc(CCValAssign::getReg(0, ValVT, Reg, LocVT, LocInfo));
      return;
    }
    if (partCount == 2) {
      // Allocate to AX.
      if (!State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(1, ValVT, RL78::R1, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(0, ValVT, RL78::R0, LocVT, LocInfo));
        return;
      }
    }
    if (partCount == 3) {
      // Allocate to C-AX.
      if (allocate3(RL78::R2, RL78::R1, RL78::R0, 0, ValVT, LocVT, LocInfo,
                    State))
        return;
    }

    if (partCount == 4) {
      // Allocate BC-AX.
      if (!State.isAllocated(RL78::RP2) && !State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP2);
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(0, ValVT, RL78::R0, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(1, ValVT, RL78::R1, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(2, ValVT, RL78::R2, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(3, ValVT, RL78::R3, LocVT, LocInfo));
        return;
      }
    }
  }

  if (LocVT == MVT::i16) {

    unsigned Reg = RL78::NoRegister;
    if ((partCount == 1) && (Reg = State.AllocateReg(RL78::RP0))) {
      // Allocate to AX.
      State.addLoc(CCValAssign::getReg(0, ValVT, Reg, LocVT, LocInfo));
      return;
    }
    if (partCount == 2) {
      // Allocate BC-AX.
      if (!State.isAllocated(RL78::RP2) && !State.isAllocated(RL78::RP0)) {
        State.AllocateReg(RL78::RP2);
        State.AllocateReg(RL78::RP0);
        State.addLoc(
            CCValAssign::getReg(0, ValVT, RL78::RP0, LocVT, LocInfo));
        State.addLoc(
            CCValAssign::getReg(1, ValVT, RL78::RP2, LocVT, LocInfo));
        return;
      }
    }
  }

  llvm_unreachable("Unable to return type of this size!");
}

void RL78TargetLowering::AnalyzeCCRLCallOperands(
    CCState &State, const SmallVectorImpl<ISD::OutputArg> &Outs) const {
  std::vector<std::vector<ISD::OutputArg>> args;
  GroupArgumentParts(args, Outs);

  size_t opCounter = 0;
  for (size_t i = 0, e = args.size(); i != e; i++) {
    MVT ArgVT = args[i][0].VT;
    ISD::ArgFlagsTy ArgFlags = args[i][0].Flags;
    bool isVarArg = !args[i][0].IsFixed;
    AllocateMultiPartArgument(opCounter, ArgVT, ArgVT, CCValAssign::Full,
                              ArgFlags, State, args[i].size(), isVarArg);
    opCounter += args[i].size();
  }
}

void RL78TargetLowering::AnalyzeCCRLFormalOperands(
    CCState &State, const SmallVectorImpl<llvm::ISD::InputArg> &Ins) const {
  std::vector<std::vector<ISD::InputArg>> args;
  GroupArgumentParts(args, Ins);

  size_t opCounter = 0;
  for (size_t i = 0, e = args.size(); i != e; i++) {
    MVT ArgVT = args[i][0].VT;
    ISD::ArgFlagsTy ArgFlags = args[i][0].Flags;
    AllocateMultiPartArgument(opCounter, ArgVT, ArgVT, CCValAssign::Full,
                              ArgFlags, State, args[i].size());
    opCounter += args[i].size();
  }
}

template <typename T>
void RL78TargetLowering::AnalyzeCCRLReturnOperands(
    CCState &State, const SmallVectorImpl<T> &Ins) const {
  std::vector<T> ret;
  size_t partCount = Ins.size();
  if (partCount == 0)
    return;

  for (size_t i = 0; i < partCount; ++i)
    ret.push_back(Ins[i]);

  MVT ArgVT = ret[0].VT;
  ISD::ArgFlagsTy ArgFlags = ret[0].Flags;
  AllocateMultiPartReturn(ArgVT, ArgVT, CCValAssign::Full,
                          ArgFlags, State, ret.size());
}

// FIXME? Maybe this could be a TableGen attribute on some registers and
// this table could be generated automatically from RegInfo.
Register
RL78TargetLowering::getRegisterByName(const char *RegName, LLT VT,
                                      const MachineFunction &MF) const {
  Register Reg = StringSwitch<unsigned>(RegName)
                     .Case("R0", RL78::R0)
                     .Case("R1", RL78::R1)
                     .Case("R2", RL78::R2)
                     .Case("R3", RL78::R3)
                     .Case("R4", RL78::R4)
                     .Case("R5", RL78::R5)
                     .Case("R6", RL78::R6)
                     .Case("R7", RL78::R7)
                     .Default(0);

  if (Reg)
    return Reg;

  report_fatal_error("Invalid register name global variable");
}

//===----------------------------------------------------------------------===//
// TargetLowering Implementation
//===----------------------------------------------------------------------===//

/// IntCondCCodeToICC - Convert a DAG integer condition code to a RL78 ICC
/// condition.
static RL78CC::CondCodes IntCondCCodeToICC(ISD::CondCode CC) {
  switch (CC) {
  default:
    llvm_unreachable("Unknown integer condition code!");
  case ISD::SETEQ:
    return RL78CC::RL78CC_Z;
  case ISD::SETNE:
    return RL78CC::RL78CC_NZ;
  case ISD::SETLT:
    return RL78CC::RL78CC_C;
  case ISD::SETGT:
    return RL78CC::RL78CC_H;
  case ISD::SETLE:
    return RL78CC::RL78CC_NH;
  case ISD::SETGE:
    return RL78CC::RL78CC_NC;
  case ISD::SETULT:
    return RL78CC::RL78CC_C;
  case ISD::SETUGT:
    return RL78CC::RL78CC_H;
  case ISD::SETULE:
    return RL78CC::RL78CC_NH;
  case ISD::SETUGE:
    return RL78CC::RL78CC_NC;
  }
}

static RL78CC::CondCodes AdjustICCForOperandSwitch(RL78CC::CondCodes ICC) {
  switch (ICC) {
  default:
    llvm_unreachable("Unknown integer condition code!");
  case RL78CC::RL78CC_Z:
    return RL78CC::RL78CC_Z;
  case RL78CC::RL78CC_NZ:
    return RL78CC::RL78CC_NZ;
  case RL78CC::RL78CC_C:
    return RL78CC::RL78CC_H;
  case RL78CC::RL78CC_H:
    return RL78CC::RL78CC_C;
  case RL78CC::RL78CC_NH:
    return RL78CC::RL78CC_NC;
  case RL78CC::RL78CC_NC:
    return RL78CC::RL78CC_NH;
  }
}

static unsigned IntCondCCodeSign(ISD::CondCode CC) {
  switch (CC) {
  default:
    llvm_unreachable("Unknown integer condition code!");
  case ISD::SETEQ:
  case ISD::SETNE:
  case ISD::SETULT:
  case ISD::SETULE:
  case ISD::SETUGT:
  case ISD::SETUGE:
    return 0;
  case ISD::SETLT:
  case ISD::SETGT:
  case ISD::SETLE:
  case ISD::SETGE:
    return 1;
  }
}

// Condition result if LHS == RHS.
static bool CondResultLHSeqRHS(ISD::CondCode CC) {
  switch (CC) {
  default:
    llvm_unreachable("Unknown integer condition code!");
  case ISD::SETEQ:
  case ISD::SETULE:
  case ISD::SETUGE:
  case ISD::SETLE:
  case ISD::SETGE:
    return true;
  case ISD::SETNE:
  case ISD::SETULT:
  case ISD::SETUGT:
  case ISD::SETLT:
  case ISD::SETGT:
    return false;
  }
}

