ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
RL78TargetLowering::RL78TargetLowering(const TargetMachine &TM,
                                       const RL78Subtarget &STI)
    : TargetLowering(TM), Subtarget(&STI) {
  MVT PtrVT = MVT::getIntegerVT(8 * TM.getPointerSize(0));

  setBooleanContents(UndefinedBooleanContent);

  // Set up the register classes.
  addRegisterClass(MVT::i8, &RL78::RL78RegRegClass);
  addRegisterClass(MVT::i16, &RL78::RL78RPRegsRegClass);

  // __far support.
  setOperationAction(ISD::BUILD_PAIR, MVT::i32, Custom);
  setOperationAction(ISD::ADDRSPACECAST, MVT::i16, Custom);
  setOperationAction(ISD::ADDRSPACECAST, MVT::i32, Custom);
  // setOperationAction(ISD::FrameIndex, MVT::i32, Custom);
  // setOperationAction(ISD::EXTRACT_ELEMENT, MVT::i32, Custom);

  // Expand var-args ops.
  setOperationAction(ISD::VASTART, MVT::Other, Custom);
  setOperationAction(ISD::VAARG, MVT::Other, Custom);
  // setOperationAction(ISD::VAARG, MVT::Other, Expand);
  // FIXME: ckeck if we can do better with a custom implementation.
  setOperationAction(ISD::VAEND, MVT::Other, Expand);
  setOperationAction(ISD::VACOPY, MVT::Other, Expand);

  setOperationAction(ISD::BSWAP, MVT::i32, Custom);
  setOperationAction(ISD::BSWAP, MVT::i64, Custom);

  for (MVT VT : MVT::integer_valuetypes()) {
    setOperationAction(ISD::CTPOP, VT, Expand);
    setOperationAction(ISD::CTLZ, VT, Expand);
    setOperationAction(ISD::CTTZ, VT, Expand);
  }

  // We want to custom lower some of our intrinsics.
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::i32, Custom);
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::i64, Custom);
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::Other, Custom);
  setOperationAction(ISD::INTRINSIC_VOID, MVT::Other, Custom);
  setOperationAction(ISD::INTRINSIC_W_CHAIN, MVT::Other, Custom);

  // FIXME: ckeck if we can do better with a custom implementation.
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i1, Expand);
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i8, Expand);
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i16, Expand);
  // Unaligned address is not lowered optimally (it uses shit and or).
  setOperationAction(ISD::LOAD, MVT::i16, Custom);
  setOperationAction(ISD::LOAD, MVT::i32, Custom);
  setOperationAction(ISD::STORE, MVT::i16, Custom);
  setOperationAction(ISD::STORE, MVT::i32, Custom);
  // FIXME: ckeck if we can do better with a custom implementation.
  for (MVT VT : MVT::integer_valuetypes()) {
    setLoadExtAction(ISD::EXTLOAD, VT, MVT::i1, Promote);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i1, Promote);
    setLoadExtAction(ISD::ZEXTLOAD, VT, MVT::i1, Promote);
    setLoadExtAction(ISD::EXTLOAD, VT, MVT::i8, Expand);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i8, Expand);
    setLoadExtAction(ISD::ZEXTLOAD, VT, MVT::i8, Expand);
    setLoadExtAction(ISD::EXTLOAD, VT, MVT::i16, Expand);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i16, Expand);
    setLoadExtAction(ISD::ZEXTLOAD, VT, MVT::i16, Expand);
  }

  setTruncStoreAction(MVT::i16, MVT::i8, Expand);

  // To ensure optimal generation of 32 bit add/sub (llmv will use setcc/select
  // instead.
  setOperationAction(ISD::ADDC, MVT::i16, Legal);
  setOperationAction(ISD::ADDE, MVT::i16, Legal);
  setOperationAction(ISD::SUBC, MVT::i16, Legal);
  setOperationAction(ISD::SUBE, MVT::i16, Legal);

  setOperationAction(ISD::SELECT, MVT::i32, Custom);

  // FIXME: set ABS to custom and emit libcall.

  // Expand to UMUL_LOHI.
  setOperationAction(ISD::MULHU, MVT::i8, Expand);
  setOperationAction(ISD::MULHU, MVT::i16, Expand);

  // Expand to SMUL_LOHI (which is expanded in turn as well).
  setOperationAction(ISD::MULHS, MVT::i8, Expand);
  setOperationAction(ISD::MULHS, MVT::i16, Expand);
  setOperationAction(ISD::SMUL_LOHI, MVT::i8, Expand);
  setOperationAction(ISD::SMULO, MVT::i16, Custom);
  setOperationAction(ISD::UMULO, MVT::i16, Custom);
  // We expand BRCOND to BR_CC becuase
  // in some cases we can expand it to  BT/BF/BTCRL.
  setOperationAction(ISD::BRCOND, MVT::Other, Expand);
  setOperationAction(ISD::BR_CC, MVT::i8, Custom);
  setOperationAction(ISD::BR_CC, MVT::i16, Custom);
  //
  setOperationAction(ISD::SELECT_CC, MVT::i8, Custom);
  setOperationAction(ISD::SELECT_CC, MVT::i16, Custom);

  // TODO: custom implementation and i32, i64 ...
  setOperationAction(ISD::SELECT, MVT::i8, Expand);
  setOperationAction(ISD::SELECT, MVT::i16, Expand);
  setOperationAction(ISD::SETCC, MVT::i8, Expand);
  setOperationAction(ISD::SETCC, MVT::i16, Expand);
  // setOperationAction(ISD::SETCC, MVT::i32, Custom);
  // setOperationAction(ISD::SETCC, MVT::i64, Custom);
  // FIXME: ckeck if we can do better with a custom implementation.
  setOperationAction(ISD::BR_JT, MVT::Other, Expand);

  // Custom legalize GlobalAddress.
  setOperationAction(ISD::GlobalAddress, PtrVT, Custom);
  setOperationAction(ISD::GlobalAddress, MVT::i32, Custom);
  setOperationAction(ISD::TargetGlobalAddress, MVT::i32, Custom);
  setOperationAction(ISD::GlobalTLSAddress, PtrVT, Custom);
  setOperationAction(ISD::ConstantPool, PtrVT, Custom);
  setOperationAction(ISD::BlockAddress, PtrVT, Custom);
  setOperationAction(ISD::ExternalSymbol, PtrVT, Custom);
  setOperationAction(ISD::ExternalSymbol, MVT::i32, Custom);
  setOperationAction(ISD::JumpTable, PtrVT, Custom);

  // Custom lower mul (except i8).
  setOperationAction(ISD::MUL, MVT::i16, Custom);
  setOperationAction(ISD::MUL, MVT::i32, Custom);
  // Promote to i16.
  setOperationAction(ISD::UREM, MVT::i8, Promote);
  //
  if (Subtarget->isRL78S3CoreType()) {
    // Expand to UDIVREM.
    setOperationAction(ISD::UDIV, MVT::i16, Expand);
    setOperationAction(ISD::UREM, MVT::i16, Expand);
    // UMUL_LOHI for i8 see UMUL_LOHI_16_r_r.
    setOperationAction(ISD::UMUL_LOHI, MVT::i16, Legal);
    setOperationAction(ISD::SMUL_LOHI, MVT::i16, Legal);

    setOperationAction(ISD::UDIVREM, MVT::i16, Legal);
    // Set to legal so DivRemPairs leaves it alone.
    setOperationAction(ISD::UDIVREM, MVT::i32, Legal);
    // Promote to i16.
    setOperationAction(ISD::UDIV, MVT::i8, Promote);
    setOperationAction(ISD::SDIV, MVT::i8, Promote);

