ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    setTargetDAGCombine(ISD::MUL);
    // So we can handle combining into divwu.
    setTargetDAGCombine(ISD::UDIV);
    setTargetDAGCombine(ISD::UREM);
    // To match MACH/MACHU.
    setTargetDAGCombine(ISD::ADD);
  } else {
    //
    setOperationAction(ISD::UDIV, MVT::i16, LibCall);
    setOperationAction(ISD::UREM, MVT::i16, LibCall);
    setOperationAction(ISD::UMUL_LOHI, MVT::i16, Expand);
    setOperationAction(ISD::SMUL_LOHI, MVT::i16, Expand);
    // Custom LowerCDIV COM_ucdiv and COM_scdiv.
    setOperationAction(ISD::UDIV, MVT::i8, Custom);
    setOperationAction(ISD::SDIV, MVT::i8, Custom);
  }

  setTargetDAGCombine(ISD::TRUNCATE);

  // No signed DIV/MOD available on RL78 do a libcall.
  setOperationAction(ISD::SREM, MVT::i8, Promote);
  setOperationAction(ISD::SDIV, MVT::i16, LibCall);
  setOperationAction(ISD::SREM, MVT::i16, LibCall);
  setOperationAction(ISD::SDIVREM, MVT::i16, Expand);

  // Custom lower floating point rounding ops.
  setOperationAction(ISD::LRINT, MVT::i32, Custom);
  setOperationAction(ISD::LROUND, MVT::i32, Custom);

  setOperationAction(ISD::AND, MVT::i16, Custom);
  setOperationAction(ISD::OR, MVT::i16, Custom);
  setOperationAction(ISD::XOR, MVT::i16, Custom);

  // Custom lower shifts.
  setOperationAction(ISD::SHL, MVT::i8, Custom);
  setOperationAction(ISD::SHL, MVT::i16, Custom);
  setOperationAction(ISD::SRA, MVT::i8, Custom);
  setOperationAction(ISD::SRA, MVT::i16, Custom);
  setOperationAction(ISD::SRL, MVT::i8, Custom);
  setOperationAction(ISD::SRL, MVT::i16, Custom);

  setOperationAction(ISD::SHL_PARTS, MVT::i16, Expand);
  setOperationAction(ISD::SHL_PARTS, MVT::i32, Expand);
  setOperationAction(ISD::SRA_PARTS, MVT::i16, Expand);
  setOperationAction(ISD::SRA_PARTS, MVT::i32, Expand);
  setOperationAction(ISD::SRL_PARTS, MVT::i16, Expand);
  setOperationAction(ISD::SRL_PARTS, MVT::i32, Expand);
  // Custom lower rotate operations.
  setOperationAction(ISD::ROTL, MVT::i8, Custom);
  setOperationAction(ISD::ROTL, MVT::i16, Custom);
  setOperationAction(ISD::ROTR, MVT::i8, Custom);
  setOperationAction(ISD::ROTR, MVT::i16, Custom);

  setOperationAction(ISD::STACKSAVE, MVT::Other, Expand);
  setOperationAction(ISD::STACKRESTORE, MVT::Other, Expand);
  setOperationAction(ISD::DYNAMIC_STACKALLOC, MVT::i16, Expand);

  setTargetDAGCombine(ISD::BRCOND);

  setStackPointerRegisterToSaveRestore(RL78::SPreg);

  setSchedulingPreference(llvm::Sched::ILP);

  setMinFunctionAlignment(Align(1));

  computeRegisterProperties(Subtarget->getRegisterInfo());

  setLibcallName(RTLIB::ADD_F32, "_COM_fadd");            // was __addsf3
  setLibcallName(RTLIB::ADD_F64, "_COM_dadd");            // was __adddf3
  setLibcallName(RTLIB::SUB_F32, "_COM_fsub");            // was __subsf3
  setLibcallName(RTLIB::SUB_F64, "_COM_dsub");            // was __subdf3
  setLibcallName(RTLIB::MUL_I16, "_COM_imul");            // was __mulhi3
  setLibcallName(RTLIB::MUL_I32, "_COM_lmul");            // was __mulsi3
  setLibcallName(RTLIB::MUL_I64, "_COM_llmul");           // was __muldi3
  setLibcallName(RTLIB::MUL_F32, "_COM_fmul");            // was __mulsf3
  setLibcallName(RTLIB::MUL_F64, "_COM_dmul");            // was __muldf3
  setLibcallName(RTLIB::SDIV_I8, "_COM_scdiv");           // was __divqi3
  setLibcallName(RTLIB::UDIV_I8, "_COM_ucdiv");           // was __udivqi3
  setLibcallName(RTLIB::SDIV_I16, "_COM_sidiv");          // was __divhi3
  setLibcallName(RTLIB::UDIV_I16, "_COM_uidiv");          // was __udivhi3
  setLibcallName(RTLIB::SDIV_I32, "_COM_sldiv");          // was __divsi3
  setLibcallName(RTLIB::UDIV_I32, "_COM_uldiv");          // was __udivsi3
  setLibcallName(RTLIB::SDIV_I64, "_COM_slldiv");         // was __divdi3
  setLibcallName(RTLIB::UDIV_I64, "_COM_ulldiv");         // was __udivdi3
  setLibcallName(RTLIB::DIV_F32, "_COM_fdiv");            // was __divsf3
  setLibcallName(RTLIB::DIV_F64, "_COM_ddiv");            // was __divdf3
  setLibcallName(RTLIB::SREM_I8, "_COM_screm");           // was __modqi3
  setLibcallName(RTLIB::UREM_I8, "_COM_ucrem");           // was __umodqi3
  setLibcallName(RTLIB::SREM_I16, "_COM_sirem");          // was __modhi3
  setLibcallName(RTLIB::UREM_I16, "_COM_uirem");          // was __umodhi3
  setLibcallName(RTLIB::SREM_I32, "_COM_slrem");          // was __modsi3
  setLibcallName(RTLIB::UREM_I32, "_COM_ulrem");          // was __umodsi3
  setLibcallName(RTLIB::SREM_I64, "_COM_sllrem");         // was __moddi3
  setLibcallName(RTLIB::UREM_I64, "_COM_ullrem");         // was __umoddi3
  setLibcallName(RTLIB::SINTTOFP_I32_F32, "_COM_sltof");  // was __floatsisf
  setLibcallName(RTLIB::SINTTOFP_I32_F64, "_COM_sltod");  // was __floatsidf
  setLibcallName(RTLIB::UINTTOFP_I32_F32, "_COM_ultof");  // was __floatunsisf
  setLibcallName(RTLIB::UINTTOFP_I32_F64, "_COM_ultod");  // was __floatunsidf
  setLibcallName(RTLIB::SINTTOFP_I64_F32, "_COM_slltof"); // was __floatdisf
  setLibcallName(RTLIB::SINTTOFP_I64_F64, "_COM_slltod"); // was __floatdidf
  setLibcallName(RTLIB::UINTTOFP_I64_F32, "_COM_ulltof"); // was __floatundisf
  setLibcallName(RTLIB::UINTTOFP_I64_F64, "_COM_ulltod"); // was __floatundidf
  setLibcallName(RTLIB::FPTOSINT_F32_I32, "_COM_ftosl");  // was __fixsfsi
  setLibcallName(RTLIB::FPTOUINT_F32_I32, "_COM_ftoul");  // was __fixunssfsi
  setLibcallName(RTLIB::FPTOSINT_F32_I64, "_COM_ftosll"); // was __fixsfdi
  setLibcallName(RTLIB::FPTOUINT_F32_I64, "_COM_ftoull"); // was __fixunssfdi
  setLibcallName(RTLIB::FPTOSINT_F64_I32, "_COM_dtosl");  // was __fixdfsi
  setLibcallName(RTLIB::FPTOUINT_F64_I32, "_COM_dtoul");  // was __fixunsdfsi
  setLibcallName(RTLIB::FPTOSINT_F64_I64, "_COM_dtosll"); // was __fixdfdi
  setLibcallName(RTLIB::FPTOUINT_F64_I64, "_COM_dtoull"); // was __fixunsdfdi
  setLibcallName(RTLIB::FPEXT_F32_F64, "_COM_ftod");      // was __extendsfdf2
  setLibcallName(RTLIB::FPROUND_F64_F32, "_COM_dtof");    // was __truncdfsf2
  setLibcallName(RTLIB::SRA_I32, "_COM_lsar");            // was __ashrsi3
  setLibcallName(RTLIB::SRL_I32, "_COM_lshr");            // was __lshrsi3
  setLibcallName(RTLIB::SHL_I32, "_COM_lshl");            // was __ashlsi3
  setLibcallName(RTLIB::SRA_I64, "_COM_llsar");           // was __ashrdi3
  setLibcallName(RTLIB::SRL_I64, "_COM_llshr");           // was __lshrdi3
  setLibcallName(RTLIB::SHL_I64, "_COM_llshl");           // was __ashldi3
}

bool RL78TargetLowering::useSoftFloat() const { return true; }

unsigned RL78TargetLowering::getJumpTableEncoding() const {
  return MachineJumpTableInfo::EK_BlockAddress;
}

bool RL78TargetLowering::getTgtMemIntrinsic(IntrinsicInfo &Info,
                                            const CallInst &I,
                                            MachineFunction &MF,
                                            unsigned Intrinsic) const {

  switch (Intrinsic) {
  case Intrinsic::rl78_mului:
  case Intrinsic::rl78_mulsi:
  case Intrinsic::rl78_mulul:
  case Intrinsic::rl78_mulsl:
  case Intrinsic::rl78_divui:
  case Intrinsic::rl78_divul:
  case Intrinsic::rl78_remui:
  case Intrinsic::rl78_remul:
  case Intrinsic::rl78_macui:
  case Intrinsic::rl78_macsi:
    return false;
  case Intrinsic::rl78_mov1:
  case Intrinsic::rl78_and1:
  case Intrinsic::rl78_or1:
  case Intrinsic::rl78_xor1:
  case Intrinsic::rl78_set1:
  case Intrinsic::rl78_clr1:
  case Intrinsic::rl78_not1: {

    const Module &M = *I.getParent()->getParent()->getParent();
    Type *PtrTy = I.getArgOperand(0)->getType();
    Info.opc = ISD::INTRINSIC_W_CHAIN;
    Info.memVT = MVT::getVT(PtrTy);
    Info.ptrVal = I.getArgOperand(0);
    Info.offset = 0;
    Info.align = Align(M.getDataLayout().getTypeAllocSizeInBits(PtrTy) / 16);
    Info.flags = MachineMemOperand::MOLoad | MachineMemOperand::MOStore;
    return true;
  }
  }
  return false;
}

