ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
const char *RL78TargetLowering::getTargetNodeName(unsigned Opcode) const {
  switch ((RL78ISD::NodeType)Opcode) {
  case RL78ISD::FIRST_NUMBER:
    break;
  case RL78ISD::SEL_RB:
    return "RL78ISD::SEL_RB";
  case RL78ISD::CMP:
    return "RL78ISD::CMP";
  case RL78ISD::LOWCMP:
    return "RL78ISD::LOWCMP";
  case RL78ISD::CALL:
    return "RL78ISD::CALL";
  case RL78ISD::CALL_FP:
    return "RL78ISD::CALL_FP";
  case RL78ISD::TAIL_CALL:
    return "RL78ISD::TAIL_CALL";
  case RL78ISD::RET:
    return "RL78ISD::RET";
  case RL78ISD::RETI:
    return "RL78ISD::RETI";
  case RL78ISD::RETB:
    return "RL78ISD::RETB";
  case RL78ISD::BRCC:
    return "RL78ISD::BRCC";
  case RL78ISD::SELECTCC:
    return "RL78ISD::SELECTCC";
  case RL78ISD::BTBF:
    return "RL78ISD::BTBF";
  case RL78ISD::SET1:
    return "RL78ISD::SET1";
  case RL78ISD::CLR1:
    return "RL78ISD::CLR1";
  case RL78ISD::DIVWU:
    return "RL78ISD::DIVWU";
  case RL78ISD::LOW8:
    return "RL78ISD::LOW8";
  case RL78ISD::LOW16:
    return "RL78ISD::LOW16";
  case RL78ISD::HI16:
    return "RL78ISD::HI16";
  case RL78ISD::CALLT:
    return "RL78ISD::CALLT";
  case RL78ISD::MOV1TOCY:
    return "RL78ISD::MOV1TOCY";
  case RL78ISD::MOV1FROMCY:
    return "RL78ISD::MOV1FROMCY";
  case RL78ISD::LOAD1TOCY:
    return "RL78ISD::LOAD1TOCY";
  case RL78ISD::STORE1FROMCY:
    return "RL78ISD::STORE1FROMCY";
  case RL78ISD::AND1CY:
    return "RL78ISD::AND1CY";
  case RL78ISD::OR1CY:
    return "RL78ISD::OR1CY";
  case RL78ISD::XOR1CY:
    return "RL78ISD::XOR1CY";
  case RL78ISD::NOT1CY:
    return "RL78ISD::NOT1CY";
  case RL78ISD::XCHW:
    return "RL78ISD::XCHW";
  case RL78ISD::ANDMEM:
    return "RL78ISD::ANDMEM";
  case RL78ISD::ORMEM:
    return "RL78ISD::ORMEM";
  case RL78ISD::XORMEM:
    return "RL78ISD::XORMEM";
  case RL78ISD::MACH:
    return "RL78ISD::MACH";
  case RL78ISD::MACHU:
    return "RL78ISD::MACHU";
  }
  return nullptr;
}

EVT RL78TargetLowering::getSetCCResultType(const DataLayout &, LLVMContext &,
                                           EVT VT) const {
  // TODO: is this OK?
  if (!VT.isVector())
    return MVT::i16;
  return VT.changeVectorElementTypeToInteger();
}

/// isMaskedValueZeroForTargetNode - Return true if 'Op & Mask' is known to
/// be zero. Op is expected to be a target specific node. Used by DAG
/// combiner.
void RL78TargetLowering::computeKnownBitsForTargetNode(
    const SDValue Op, KnownBits &Known, const APInt &DemandedElts,
    const SelectionDAG &DAG, unsigned Depth) const {
  KnownBits Known2;
  Known.resetAll();

  // switch (Op.getOpcode()) {
  // default:
  //  break;
  //  // case SPISD::SELECT_ICC:
  //  // case SPISD::SELECT_XCC:
  //  // case SPISD::SELECT_FCC:
  //  //  DAG.computeKnownBits(Op.getOperand(1), Known, Depth+1);
  //  //  DAG.computeKnownBits(Op.getOperand(0), Known2, Depth+1);

  //  //  // Only known if known in both the LHS and RHS.
  //  //  Known.One &= Known2.One;
  //  //  Known.Zero &= Known2.Zero;
  //  break;
  //}
}

// Convert to a target node and set target flags.
SDValue RL78TargetLowering::withTargetFlags(SDValue Op, unsigned TF,
                                            SelectionDAG &DAG) const {
  if (const GlobalAddressSDNode *GA = dyn_cast<GlobalAddressSDNode>(Op))
    return DAG.getTargetGlobalAddress(GA->getGlobal(), SDLoc(GA), MVT::i16,
                                      GA->getOffset(), TF);

  if (const ConstantPoolSDNode *CP = dyn_cast<ConstantPoolSDNode>(Op))
    return DAG.getTargetConstantPool(CP->getConstVal(), CP->getValueType(0),
                                     CP->getAlign(), CP->getOffset(), TF);

  if (const BlockAddressSDNode *BA = dyn_cast<BlockAddressSDNode>(Op))
    return DAG.getTargetBlockAddress(BA->getBlockAddress(), Op.getValueType(),
                                     0, TF);

  if (const ExternalSymbolSDNode *ES = dyn_cast<ExternalSymbolSDNode>(Op))
    return DAG.getTargetExternalSymbol(ES->getSymbol(), ES->getValueType(0),
                                       TF);

  llvm_unreachable("Unhandled address SDNode");
}

// Build SDNodes for producing an address from a GlobalAddress, ConstantPool,
// or ExternalSymbol SDNode.
SDValue RL78TargetLowering::makeAddress(SDValue Op, SelectionDAG &DAG) const {
  SDLoc DL(Op);
  // Op.dump();
  EVT VT = getPointerTy(DAG.getDataLayout());
  const GlobalValue *GV = cast<GlobalAddressSDNode>(Op)->getGlobal();
  int64_t Offset = cast<GlobalAddressSDNode>(Op)->getOffset();

  const auto *V = dyn_cast<GlobalVariable>(GV);
  if (V) {
    // unsigned AS = V->getAddressSpace();

    // See if we have a pragma address with the saddr range
    bool PragmaAddressInSaddrRange = false;
    if (V->hasSection()) {
      StringRef SectionName = V->getSection();
      size_t nameOffset =
          SectionName.startswith(".bss_AT")
              ? std::string(".bss_AT").size()
              : SectionName.startswith(".bssf_AT")
                    ? std::string(".bssf_AT").size()
                    : SectionName.startswith(".const_AT")
                          ? std::string(".const_AT").size()
                          : SectionName.startswith(".constf_AT")
                                ? std::string(".constf_AT").size()
                                : 0;
      uint64_t Address;
      PragmaAddressInSaddrRange =
          to_integer(SectionName.substr(nameOffset), Address, 16) &&
          (0xFFE20 <= Address && Address <= 0xFFF1F);
    }

    if (V->hasAttribute("saddr") || PragmaAddressInSaddrRange) {
      // Since we don't know if the address will be used for 8 or 16 bit
      // operations we can't decide if we should use VK_RL78_SAD or
      // VK_RL78_SADW. We correct this in RL78MCExpr::getFixupForKind
      SDValue Result = DAG.getTargetGlobalAddress(GV, DL, VT, Offset,
                                                  RL78MCExpr::VK_RL78_SADW);
      return DAG.getNode(RL78ISD::LOW8, DL, VT, Result);
    }
  }
  else {
    //FIXME: temp fix for correct plt selection until we get rid of the plt.
    SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(Op), VT, Offset,
                                                RL78MCExpr::VK_RL78_FUNCTION);
    return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);
  }

  SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(Op), VT, Offset,
                                              RL78MCExpr::VK_RL78_LOWW);
  return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);

  // This is one of the absolute code models.
  switch (getTargetMachine().getCodeModel()) {
  default:
    llvm_unreachable("Unsupported absolute code model");
  case CodeModel::Small:
    // SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(Op), VT, Offset);
    // return DAG.getNode(RL78ISD::LOW16, DL, VT, withTargetFlags(Op,
    // RL78MCExpr::VK_RL78_LOW16, DAG));
    return DAG.getTargetGlobalAddress(GV, SDLoc(Op), VT, Offset);
    // case CodeModel::Medium: {
    //}
    // case CodeModel::Large: {
    //}
  }
}

SDValue RL78TargetLowering::LowerExternalSymbol(SDValue Op,
                                                SelectionDAG &DAG) const {
  ExternalSymbolSDNode *S = cast<ExternalSymbolSDNode>(Op);
  EVT VT = getPointerTy(DAG.getDataLayout());
  SDValue Result =
      DAG.getTargetExternalSymbol(S->getSymbol(), Op.getValueType());
  return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);
}

