ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
SDValue RL78TargetLowering::LowerGlobalAddress(SDValue Op,
                                               SelectionDAG &DAG) const {
  return makeAddress(Op, DAG);
}

SDValue RL78TargetLowering::LowerConstantPool(SDValue Op,
                                              SelectionDAG &DAG) const {
  ConstantPoolSDNode *CP = cast<ConstantPoolSDNode>(Op);
  EVT VT = Op.getValueType();
  SDValue Result = DAG.getTargetConstantPool(
      CP->getConstVal(), VT, Align(CP->getAlign().value()), CP->getOffset());
  return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);
}

SDValue RL78TargetLowering::LowerBlockAddress(SDValue Op,
                                              SelectionDAG &DAG) const {
  const BlockAddress *BA = cast<BlockAddressSDNode>(Op)->getBlockAddress();
  int64_t Offset = cast<BlockAddressSDNode>(Op)->getOffset();
  EVT VT = getPointerTy(DAG.getDataLayout());
  SDValue Result = DAG.getTargetBlockAddress(BA, VT, Offset);
  return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);
}

SDValue RL78TargetLowering::LowerJumpTable(SDValue Op,
                                           SelectionDAG &DAG) const {
  const JumpTableSDNode *JT = cast<JumpTableSDNode>(Op);
  EVT VT = getPointerTy(DAG.getDataLayout());
  //
  SDValue Result = DAG.getTargetJumpTable(JT->getIndex(), VT);
  return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), VT, Result);
}

static SDValue SwitchCMPOperands(SDLoc DL, unsigned cc, SDValue CCSign,
                                 SDValue &LHS, SDValue &RHS, SelectionDAG &DAG,
                                 SDValue &TargetCC) {
  SDValue Cmp;
  // Heuristic to aid the matcher's cmp a, mem pattern matching
  // If we would have cmp mem, a, switch lhs/rhs and flip the condition
  if (LHS.getOpcode() == ISD::LOAD && RHS.getOpcode() == ISD::CopyFromReg) {
    TargetCC = DAG.getConstant(AdjustICCForOperandSwitch((RL78CC::CondCodes)cc),
                               DL, MVT::i8);
    Cmp = DAG.getNode(RL78ISD::CMP, DL, MVT::Glue, RHS, LHS, CCSign);
  } else {
    Cmp = DAG.getNode(RL78ISD::CMP, DL, MVT::Glue, LHS, RHS, CCSign);
  }
  return Cmp;
}

static SDValue LowerBR_CC(SDValue Op, SelectionDAG &DAG) {
  SDValue Chain = Op.getOperand(0);
  ISD::CondCode CC = cast<CondCodeSDNode>(Op.getOperand(1))->get();
  SDValue LHS = Op.getOperand(2);
  SDValue RHS = Op.getOperand(3);
  SDValue Dest = Op.getOperand(4);
  SDLoc dl(Op);
  unsigned cc = IntCondCCodeToICC(CC);
  SDValue TargetCC = DAG.getConstant(cc, dl, MVT::i8);
  unsigned cmpSign = IntCondCCodeSign(CC);
  SDValue CCSign = DAG.getConstant(cmpSign, dl, MVT::i8);

  // If " == 0" or " != 0".
  if (((CC == ISD::SETEQ) || (CC == ISD::SETNE)) && isa<ConstantSDNode>(RHS) &&
      (cast<ConstantSDNode>(RHS)->getZExtValue() == 0)) {
    // If AND with power of 2.
    if ((LHS.getOpcode() == ISD::AND) &&
        isa<ConstantSDNode>(LHS.getOperand(1)) &&
        isPowerOf2_64(LHS.getConstantOperandVal(1))) {
      // Checking that a bit and equals to 0 tranlates to BF Not BT so
      // we need to reverse the condition.
      cc = (cc == RL78CC::RL78CC_Z) ? RL78CC::RL78CC_NZ : RL78CC::RL78CC_Z;
      if (LHS.getValueType() == MVT::i8) {
        TargetCC = DAG.getConstant(cc, dl, MVT::i8);
        SDValue constVal = DAG.getConstant(
            Log2_64(LHS.getConstantOperandVal(1)), dl, LHS.getValueType());
        return DAG.getNode(RL78ISD::BTBF, dl, MVT::Other, Chain, Dest, TargetCC,
                           LHS.getOperand(0), constVal);
      } else if (LHS.getValueType() == MVT::i16) {
        TargetCC = DAG.getConstant(cc, dl, MVT::i8);
        EVT HalfVT = LHS.getOperand(0)->getValueType(0).getHalfSizedIntegerVT(
            *DAG.getContext());
        // Byte offset (0 or 1).
        unsigned offset = (LHS.getConstantOperandVal(1) >= 0x100) ? 1 : 0;
        SDValue index = DAG.getConstant(offset, dl, HalfVT);
        // FIXME: this can generate shrw ax, 8 bf r0.0 instead of bf r1.0,
        // improve it.
        SDValue op0Half = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, HalfVT,
                                      LHS.getOperand(0), index);
        SDValue constVal = DAG.getConstant(
            Log2_64(LHS.getConstantOperandVal(1) >> (offset * 8)), dl, HalfVT);
        return DAG.getNode(RL78ISD::BTBF, dl, MVT::Other, Chain, Dest, TargetCC,
                           op0Half, constVal);
      }
    }
  }
  // If signed comparison with 0.
  // FIXME: we ca use BT/BF.
  // if (cmpSign && isa<ConstantSDNode>(RHS) &&
  // (cast<ConstantSDNode>(RHS)->getZExtValue() == 0)) {
  //    SDValue constVal = DAG.getConstant(1 <<
  //    LHS->getValueType(0).getSizeInBits() - 1, dl, LHS.getValueType());
  //    ...
  //}
  // Comparisons with imm values can be done more efficiently for imm = { 0, 1}
  // (see LowerSignedCMPWImm) op < 2 can be replaced with op <= 1. op < 1 can be
  // replaced with op <= 0 (OBS. llvm already does this for unsigned
  // comparison). OBS. if we remove LowerSignedCMPWImm this has no effect.
  if ((CC == ISD::SETLT) && (LHS.getValueType() == MVT::i16) &&
      isa<ConstantSDNode>(RHS) &&
      ((cast<ConstantSDNode>(RHS)->getZExtValue() == 1) ||
       (cast<ConstantSDNode>(RHS)->getZExtValue() == 2))) {
    //
    RHS = DAG.getConstant(cast<ConstantSDNode>(RHS)->getZExtValue() - 1, dl,
                          LHS.getValueType());
    // Change CC from '<' to '<='
    cc = IntCondCCodeToICC(ISD::SETLE);
    TargetCC = DAG.getConstant(cc, dl, MVT::i8);
  }
  // if LHS == RHS we don't need a conditional instruction, also we don't have
  // CMP(W) instrutions on RL78 which accept the same register for both
  // operands; so we really need to check for this here as a safety net.
  // FIXME: this should be eliminated much eariler (recheck in newer LLVM) Saw
  // this with gcc.c-torture\execute\920428-1.c and
  // gcc.c-torture\execute\921112-1.c on -O3.
  if (LHS == RHS) {
    if ((CC == ISD::SETLE) || (CC == ISD::SETGE) || (CC == ISD::SETEQ))
      return DAG.getNode(ISD::BR, dl, MVT::Other, Chain, Dest);
  }
  // Create the CMP node.
  SDValue Cmp = SwitchCMPOperands(dl, cc, CCSign, LHS, RHS, DAG, TargetCC);
  // DAG.dump();
  //
  return DAG.getNode(RL78ISD::BRCC, dl, MVT::Other, Chain, Dest, TargetCC, Cmp);
}

static SDValue LowerSELECT_CC(SDValue Op, SelectionDAG &DAG) {
  SDValue LHS = Op.getOperand(0);
  SDValue RHS = Op.getOperand(1);
  SDValue TVal = Op.getOperand(2);
  SDValue FVal = Op.getOperand(3);
  ISD::CondCode CC = cast<CondCodeSDNode>(Op.getOperand(4))->get();
  SDLoc dl(Op);
  unsigned cc = IntCondCCodeToICC(CC);
  SDValue TargetCC = DAG.getConstant(cc, dl, MVT::i8);
  unsigned cmpSign = IntCondCCodeSign(CC);
  SDValue CCSign = DAG.getConstant(cmpSign, dl, MVT::i8);
  // Create the CMP node.
  SDValue Cmp = SwitchCMPOperands(dl, cc, CCSign, LHS, RHS, DAG, TargetCC);
  // DAG.dump();
  //
  return DAG.getNode(RL78ISD::SELECTCC, dl, Op.getValueType(), TVal, FVal,
                     TargetCC, Cmp);
}

static SDValue LowerVASTART(SDValue Op, SelectionDAG &DAG,
                            const RL78TargetLowering &TLI) {
  MachineFunction &MF = DAG.getMachineFunction();
  RL78MachineFunctionInfo *FuncInfo = MF.getInfo<RL78MachineFunctionInfo>();
  auto PtrVT = TLI.getPointerTy(DAG.getDataLayout());

  // Need frame address to find the address of VarArgsFrameIndex.
  // MF.getFrameInfo().setFrameAddressIsTaken(true);

