ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  // vastart just stores the address of the VarArgsFrameIndex slot into the
  // memory location argument.
  SDLoc DL(Op);
  const Value *SV = cast<SrcValueSDNode>(Op.getOperand(2))->getValue();
  SDValue FI = DAG.getFrameIndex(FuncInfo->getVarArgsFrameOffset(), PtrVT);

  return DAG.getStore(Op.getOperand(0), DL, FI, Op.getOperand(1),
                      MachinePointerInfo(SV), 0);
}

static SDValue LowerVAARG(SDValue Op, SelectionDAG &DAG) {
  SDNode *Node = Op.getNode();
  EVT VT = Node->getValueType(0);
  SDValue InChain = Node->getOperand(0);
  SDValue VAListPtr = Node->getOperand(1);
  EVT PtrVT = VAListPtr.getValueType();
  const Value *SV = cast<SrcValueSDNode>(Node->getOperand(2))->getValue();
  SDLoc DL(Node);
  SDValue VAList =
      DAG.getLoad(PtrVT, DL, InChain, VAListPtr, MachinePointerInfo(SV));
  // Decrement the pointer, VAList, to the next vaarg.
  unsigned ArgSizeInBytes =
      DAG.getDataLayout().getTypeAllocSize(VT.getTypeForEVT(*DAG.getContext()));
  SDValue NextPtr = DAG.getNode(
      ISD::ADD, DL, VAList.getValueType(), VAList,
      DAG.getConstant(alignTo(ArgSizeInBytes, 2), DL, VAList.getValueType()));
  // Store the incremented VAList to the legalized pointer.
  InChain = DAG.getStore(VAList.getValue(1), DL, NextPtr, VAListPtr,
                         MachinePointerInfo(SV));
  // Load the actual argument out of the pointer VAList.
  // We can't count on greater alignment than the word size.
  return DAG.getLoad(VT, DL, InChain, VAList, MachinePointerInfo(),
                     std::min(PtrVT.getSizeInBits(), VT.getSizeInBits()) / 8);
}

static SDValue getFRAMEADDR(uint64_t depth, SDValue Op, SelectionDAG &DAG,
                            const RL78Subtarget *Subtarget) {
  MachineFrameInfo &MFI = DAG.getMachineFunction().getFrameInfo();

  MFI.setFrameAddressIsTaken(true);

  EVT VT = Op.getValueType();
  SDLoc dl(Op);
  unsigned FrameReg =
      Subtarget->getRegisterInfo()->getFrameRegister(DAG.getMachineFunction());

  if (depth == 0)
    return DAG.getCopyFromReg(DAG.getEntryNode(), dl, FrameReg, VT);
  return SDValue();
}

static SDValue LowerFRAMEADDR(SDValue Op, SelectionDAG &DAG,
                              const RL78Subtarget *Subtarget) {
  unsigned level = Op.getConstantOperandVal(0);
  if (level > 0) {
    DAG.getContext()->emitError("__builtin_frame_address is supported only for "
                                "current function (level = 0)");
    return SDValue();
  }
  return getFRAMEADDR(0, Op, DAG, Subtarget);
}

// This can be called with __builtin_return_address, currently we made a change
// in Intrinsics.td to fix the following assert from Instructions.td: for
// (unsigned i = 0; i != Args.size(); ++i) assert((i >= FTy->getNumParams() ||
//    FTy->getParamType(i) == Args[i]->getType()) &&
//    "Calling a function with a bad signature!");
static SDValue LowerRETURNADDR(SDValue Op, SelectionDAG &DAG,
                               const RL78TargetLowering &TLI,
                               const RL78Subtarget *Subtarget) {
  MachineFunction &MF = DAG.getMachineFunction();
  MachineFrameInfo &MFI = MF.getFrameInfo();
  MFI.setReturnAddressIsTaken(true);

  if (TLI.verifyReturnAddressArgumentIsConstant(Op, DAG))
    return SDValue();

  unsigned level = Op.getConstantOperandVal(0);
  if (level > 0) {
    DAG.getContext()->emitError("__builtin_return_address is supported only "
                                "for current function (level = 0)");
    return SDValue();
  }
  SDLoc dl(Op);

  // Need frame address to find return address of the caller.
  SDValue FrameAddr = getFRAMEADDR(0, Op, DAG, Subtarget);
  int FI = MFI.CreateFixedObject(2, -2, true);
  SDValue FIN = DAG.getFrameIndex(FI, MVT::i16);

  return DAG.getLoad(Op.getValueType(), dl, DAG.getEntryNode(), FIN,
                     MachinePointerInfo());
}

SDValue RL78TargetLowering::LowerLibCall(SDValue Op, SelectionDAG &DAG,
                                         const char *libFunctionName,
                                         bool IsSigned,
                                         unsigned OperandIndex) const {
  if (Op.getNumOperands() == 1)
    return LowerLibCall(Op, DAG, libFunctionName, IsSigned, {Op.getOperand(0)});
  else
    return LowerLibCall(
        Op, DAG, libFunctionName, IsSigned,
        {Op.getOperand(OperandIndex), Op.getOperand(OperandIndex + 1)});
}

SDValue RL78TargetLowering::LowerLibCall(SDValue Op, SelectionDAG &DAG,
                                         const char *libFunctionName,
                                         bool IsSigned,
                                         ArrayRef<SDValue> Ops) const {
  SDLoc dl(Op);
  Type *opType = Op.getValueType().getTypeForEVT(*DAG.getContext());
  TargetLowering::ArgListTy Args;

  for (unsigned i = 0, e = Ops.size(); i != e; ++i) {
    TargetLowering::ArgListEntry Entry;
    Entry.Ty = Ops[i].getValueType().getTypeForEVT(*DAG.getContext());
    Entry.IsSExt = IsSigned;
    Entry.IsZExt = !IsSigned;
    Entry.Node = Ops[i];
    Args.push_back(Entry);
  }
  SDValue Chain = DAG.getNode(ISD::TokenFactor, dl, MVT::Other);
  TargetLowering::CallLoweringInfo CLI(DAG);
  CLI.setDebugLoc(dl).setChain(Chain).setLibCallee(
      CallingConv::C, opType,
      DAG.getExternalSymbol(
          libFunctionName,
          getPointerTy(DAG.getDataLayout(),
                       DAG.getDataLayout().getProgramAddressSpace())),
      std::move(Args));

  std::pair<SDValue, SDValue> CallResult = LowerCallTo(CLI);
  // CallResult.first.dump();
  // CallResult.second.dump();
  // Is unary operation?
  if (Op.getNumOperands() == 1) {
    return CallResult.first;
  } else {
    SDValue Ops[] = {CallResult.first, CallResult.second};
    return DAG.getMergeValues(Ops, dl);
  }
}

SDValue RL78TargetLowering::LowerMULO(SDValue Op, SelectionDAG &DAG) const {
  // TODO: Copied from the default TargetLowering::expandMULO implementation,
  // with a minor change. We needed to do this because the default expand passed
  // the arguments to the libcall without setting their OrigArgIndex correctly,
  // to signal that they were split up because type legalization (i32 -> 2xi16).
  // We expect them to be passed to lowerCall having OrigArgIndex = {1, 1, 2,
  // 2}, but they are passed as {1, 2, 3, 4}. We need to know that they once
  // belonged together, since the CC-RL calling convention wants arguments
  // passed through registers or through stack, but never split up between
  // register and stack.

  SDValue Result, Overflow;
  SDLoc dl(Op);
  EVT VT = Op.getNode()->getValueType(0);
  EVT SetCCVT = getSetCCResultType(DAG.getDataLayout(), *DAG.getContext(), VT);
  SDValue LHS = Op.getOperand(0);
  SDValue RHS = Op.getOperand(1);
  bool isSigned = Op.getOpcode() == ISD::SMULO;

  // For power-of-two multiplications we can use a simpler shift expansion.
  if (ConstantSDNode *RHSC = isConstOrConstSplat(RHS)) {
    const APInt &C = RHSC->getAPIntValue();
    // mulo(X, 1 << S) -> { X << S, (X << S) >> S != X }.
    if (C.isPowerOf2()) {
      // smulo(x, signed_min) is same as umulo(x, signed_min).
      bool UseArithShift = isSigned && !C.isMinSignedValue();
      EVT ShiftAmtTy = getShiftAmountTy(VT, DAG.getDataLayout());
      SDValue ShiftAmt = DAG.getConstant(C.logBase2(), dl, ShiftAmtTy);
      Result = DAG.getNode(ISD::SHL, dl, VT, LHS, ShiftAmt);
      Overflow = DAG.getSetCC(dl, SetCCVT,
                              DAG.getNode(UseArithShift ? ISD::SRA : ISD::SRL,
                                          dl, VT, Result, ShiftAmt),
                              LHS, ISD::SETNE);
      return DAG.getNode(ISD::MERGE_VALUES, dl, DAG.getVTList(VT, VT), Result,
                         Overflow);
    }
  }

