ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  EVT WideVT =
      EVT::getIntegerVT(*DAG.getContext(), VT.getScalarSizeInBits() * 2);
  if (VT.isVector())
    WideVT =
        EVT::getVectorVT(*DAG.getContext(), WideVT, VT.getVectorNumElements());

  SDValue BottomHalf;
  SDValue TopHalf;
  static const unsigned Ops[2][3] = {
      {ISD::MULHU, ISD::UMUL_LOHI, ISD::ZERO_EXTEND},
      {ISD::MULHS, ISD::SMUL_LOHI, ISD::SIGN_EXTEND}};
  if (isOperationLegalOrCustom(Ops[isSigned][0], VT)) {
    BottomHalf = DAG.getNode(ISD::MUL, dl, VT, LHS, RHS);
    TopHalf = DAG.getNode(Ops[isSigned][0], dl, VT, LHS, RHS);
  } else if (isOperationLegalOrCustom(Ops[isSigned][1], VT)) {
    BottomHalf =
        DAG.getNode(Ops[isSigned][1], dl, DAG.getVTList(VT, VT), LHS, RHS);
    TopHalf = BottomHalf.getValue(1);
  } else if (isTypeLegal(WideVT)) {
    LHS = DAG.getNode(Ops[isSigned][2], dl, WideVT, LHS);
    RHS = DAG.getNode(Ops[isSigned][2], dl, WideVT, RHS);
    SDValue Mul = DAG.getNode(ISD::MUL, dl, WideVT, LHS, RHS);
    BottomHalf = DAG.getNode(ISD::TRUNCATE, dl, VT, Mul);
    SDValue ShiftAmt =
        DAG.getConstant(VT.getScalarSizeInBits(), dl,
                        getShiftAmountTy(WideVT, DAG.getDataLayout()));
    TopHalf = DAG.getNode(ISD::TRUNCATE, dl, VT,
                          DAG.getNode(ISD::SRL, dl, WideVT, Mul, ShiftAmt));
  } else {

    // We can fall back to a libcall with an illegal type for the MUL if we
    // have a libcall big enough.
    // Also, we can fall back to a division in some cases, but that's a big
    // performance hit in the general case.
    RTLIB::Libcall LC = RTLIB::UNKNOWN_LIBCALL;
    if (WideVT == MVT::i16)
      LC = RTLIB::MUL_I16;
    else if (WideVT == MVT::i32)
      LC = RTLIB::MUL_I32;
    else if (WideVT == MVT::i64)
      LC = RTLIB::MUL_I64;
    else if (WideVT == MVT::i128)
      LC = RTLIB::MUL_I128;
    assert(LC != RTLIB::UNKNOWN_LIBCALL && "Cannot expand this operation!");

    SDValue HiLHS;
    SDValue HiRHS;
    if (isSigned) {
      // The high part is obtained by SRA'ing all but one of the bits of low
      // part.
      unsigned LoSize = VT.getSizeInBits();
      HiLHS = DAG.getNode(
          ISD::SRA, dl, VT, LHS,
          DAG.getConstant(LoSize - 1, dl, getPointerTy(DAG.getDataLayout())));
      HiRHS = DAG.getNode(
          ISD::SRA, dl, VT, RHS,
          DAG.getConstant(LoSize - 1, dl, getPointerTy(DAG.getDataLayout())));
    } else {
      HiLHS = DAG.getConstant(0, dl, VT);
      HiRHS = DAG.getConstant(0, dl, VT);
    }

    // Here we're passing the 2 arguments explicitly as 4 arguments that are
    // pre-lowered to the correct types. This all depends upon WideVT not
    // being a legal type for the architecture and thus has to be split to
    // two arguments.
    SDValue Ret;
    TargetLowering::MakeLibCallOptions CallOptions;
    CallOptions.setSExt(isSigned);
    CallOptions.setIsPostTypeLegalization(true);

    // TODO: main difference between the default expand and our custom one:
    // Here we use build_pair instead of passing them as:
    // SDValue Args[] = { LHS, HiLHS, RHS, HiRHS };
    // This way the type legalizer kicks in again and correctly sets the
    // OrigArgIndex for the high/low parts.
    SDValue WideLHS = DAG.getNode(ISD::BUILD_PAIR, dl, WideVT, LHS, HiLHS);
    SDValue WideRHS = DAG.getNode(ISD::BUILD_PAIR, dl, WideVT, RHS, HiRHS);

    SDValue Args[] = {WideLHS, WideRHS};
    Ret = makeLibCall(DAG, LC, WideVT, Args, CallOptions, dl).first;
    assert(Ret.getOpcode() == ISD::MERGE_VALUES &&
           "Ret value is a collection of constituent nodes holding result.");
    BottomHalf = Ret.getOperand(0);
    TopHalf = Ret.getOperand(1);
  }

  Result = BottomHalf;
  if (isSigned) {
    SDValue ShiftAmt = DAG.getConstant(
        VT.getScalarSizeInBits() - 1, dl,
        getShiftAmountTy(BottomHalf.getValueType(), DAG.getDataLayout()));
    SDValue Sign = DAG.getNode(ISD::SRA, dl, VT, BottomHalf, ShiftAmt);
    Overflow = DAG.getSetCC(dl, SetCCVT, TopHalf, Sign, ISD::SETNE);
  } else
    Overflow = DAG.getSetCC(dl, SetCCVT, TopHalf, DAG.getConstant(0, dl, VT),
                            ISD::SETNE);

  // Truncate the result if SetCC returns a larger type than needed.
  EVT RType = Op.getNode()->getValueType(1);
  if (RType.getSizeInBits() < Overflow.getValueSizeInBits())
    Overflow = DAG.getNode(ISD::TRUNCATE, dl, RType, Overflow);

  assert(RType.getSizeInBits() == Overflow.getValueSizeInBits() &&
         "Unexpected result type for S/UMULO legalization");
  return DAG.getNode(ISD::MERGE_VALUES, dl, DAG.getVTList(VT, VT), Result,
                     Overflow);
}

SDValue RL78TargetLowering::LowerMul(SDValue Op, SelectionDAG &DAG) const {
  bool isS3Core = Subtarget->isRL78S3CoreType();
  // Op.dump();
  // DAG.dump();
  assert(Op.getValueType() == MVT::i16);
  // In case of zero extend we can use MULU, MULU_zext_16_r_r.
  if ((Op.getOperand(0).getOpcode() == ISD::ZERO_EXTEND) &&
      (Op.getOperand(1).getOpcode() == ISD::ZERO_EXTEND))
    return Op;

  if (isS3Core) {
    // if S3 core we can use MULHU (or MULH), MUL16_r_r.
    return Op;
  } else {
    if (!DAG.getMachineFunction().getFunction().hasOptSize())
      return Op;
    else
      return LowerLibCall(Op, DAG, getLibcallName(RTLIB::MUL_I16), true);
  }
}

SDValue RL78TargetLowering::LowerCDIV(SDValue Op, SelectionDAG &DAG,
                                      unsigned int opcode) const {
  RTLIB::Libcall LC = opcode == ISD::UDIV ? RTLIB::UDIV_I8 : RTLIB::SDIV_I8;
  return LowerLibCall(Op, DAG, getLibcallName(LC), true);
}

SDValue RL78TargetLowering::LowerAndOrXor(SDValue Op, SelectionDAG &DAG,
                                          unsigned int opcode) const {
  // Op.dump();
  if (ConstantSDNode *CN = dyn_cast<ConstantSDNode>(Op.getOperand(1))) {
    return Op;
  }
  SDLoc dl(Op);
  SDNode *N = Op.getNode();
  const SDValue &logicalOp = N->getOperand(0);
  EVT VT = Op->getValueType(0);
  if (logicalOp->getOpcode() == ISD::LOAD && VT == MVT::i16) {
    LoadSDNode *LD = cast<LoadSDNode>(logicalOp);
    if (!LD->isVolatile()) {
      SDValue and_2 =
          DAG.getNode(opcode, dl, VT, Op.getOperand(0), Op.getOperand(1));
      return and_2;
    }
  }
  return Op;
}

SDValue RL78TargetLowering::LowerShift(SDValue Op, SelectionDAG &DAG) const {
  SDLoc dl(Op);
  // Op.dump();
  // Op.getOperand(1).dump();
  // If shift amount is constant we can do this using one instruction.
  if (ConstantSDNode *CN = dyn_cast<ConstantSDNode>(Op.getOperand(1))) {
    return Op;
  }
  RTLIB::Libcall LC;
  bool is8Bit = Op.getSimpleValueType() == MVT::i8;
  switch (Op.getOpcode()) {
  case ISD::SHL:
    LC = is8Bit ? RTLIB::SHL_I8 : RTLIB::SHL_I16;
    break;
  case ISD::SRL:
    LC = is8Bit ? RTLIB::SRL_I8 : RTLIB::SRL_I16;
    break;
  case ISD::SRA:
    LC = is8Bit ? RTLIB::SRA_I8 : RTLIB::SRA_I16;
    break;
  default:
    llvm_unreachable("Invalid shift opcode!");
  }
  if (!DAG.getMachineFunction().getFunction().hasOptSize())
    return Op;
  else
    return LowerLibCall(Op, DAG, getLibcallName(LC), false);
}

// We don't have a RTLIB Libcall name for this so we provide our own version.
const char *GetRotLibCallName(unsigned int Opcode, EVT valueType) {
  if (Opcode == ISD::ROTL) {
    if (valueType == MVT::i8)
      return "__rotlqi3";
    else if (valueType == MVT::i16)
      return "__rotlhi3";
  } else if (Opcode == ISD::ROTR) {
    if (valueType == MVT::i8)
      return "__rotrqi3";
    else if (valueType == MVT::i16)
      return "__rotrhi3";
  }
  //
  llvm_unreachable("Invalid Rotate instruction!");
}

SDValue RL78TargetLowering::LowerRotate(SDValue Op, SelectionDAG &DAG) const {
  SDLoc dl(Op);
  // Op.dump();
  // DAG.dump();
  // if rotate amount is constant we can do this using a few instructions.
  if (ConstantSDNode *CN = dyn_cast<ConstantSDNode>(Op.getOperand(1))) {
    // For i8 we do this for all 8 possible values 0 through 7.
    // For i16 we do this only in 3 cases when the amount in 1, 8 or 15.
    // OBS. 8 is a special case handled with BSWAP so no need to do it here.
    if ((Op.getValueType() == MVT::i8) || (CN->getZExtValue() == 1) ||
        (CN->getZExtValue() == 15))
      return Op;
  }
  // else emit a library call.
  if (!DAG.getMachineFunction().getFunction().hasOptSize())
    return Op;
  else
    return LowerLibCall(
        Op, DAG, GetRotLibCallName(Op.getOpcode(), Op.getValueType()), false);
}

static SDValue LowerIntrinsicAddrOp(SDValue addrOp, SDLoc &DL,
                                    SelectionDAG &DAG) {
  SDNode *MN;
  if (GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(addrOp)) {
    const GlobalValue *GV = G->getGlobal();
    if (!isa<GlobalVariable>(GV) ||
        !dyn_cast<GlobalVariable>(GV)->hasAttribute("saddr")) {
      int64_t Offset = G->getOffset();
      MN = DAG.getMachineNode(
          RL78::MOVW_rp_imm, DL, addrOp.getValueType(),
          DAG.getTargetGlobalAddress(GV, DL, MVT::i16, Offset));
      addrOp = SDValue(MN, 0);
    }
  } else if (FrameIndexSDNode *FIN = dyn_cast<FrameIndexSDNode>(addrOp)) {
    int FI = cast<FrameIndexSDNode>(FIN)->getIndex();
    EVT VT = FIN->getValueType(0);
    SDValue TFI = DAG.getTargetFrameIndex(FI, VT);
    SDValue Imm = DAG.getTargetConstant(0, DL, MVT::i16);
    MN = DAG.getMachineNode(RL78::MOVW_rp_stack_slot, DL, VT, TFI, Imm);
    addrOp = SDValue(MN, 0);
  }
  return addrOp;
}

