ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
static SDValue LowerBitOpIntrinsic(unsigned int Opcode, SDValue Op,
                                   SelectionDAG &DAG) {
  SDLoc DL(Op);
  SDValue addrOp = Op.getOperand(2);
  addrOp = LowerIntrinsicAddrOp(addrOp, DL, DAG);

  SDValue movToCY =
      DAG.getNode(RL78ISD::MOV1TOCY, DL, MVT::Other, Op.getOperand(0),
                  Op.getOperand(4), Op.getOperand(5));
  SDValue opCY =
      DAG.getNode(Opcode, DL, MVT::Other, movToCY, Op.getOperand(3), addrOp);

  SDValue movFromCY = DAG.getNode(RL78ISD::STORE1FROMCY, DL, MVT::Other, opCY,
                                  Op.getOperand(3), addrOp);
  return movFromCY;
}

SDValue RL78TargetLowering::LowerIntrinsicWithChain(SDValue Op,
                                                    SelectionDAG &DAG) const {
  SDLoc DL(Op);
  // Op.dump();
  unsigned IntNo = cast<ConstantSDNode>(Op.getOperand(1))->getZExtValue();
  switch (IntNo) {
  case Intrinsic::rl78_getpswisp: {

    SDValue getPSW = DAG.getNode(
        ISD::INTRINSIC_W_CHAIN, DL,
        DAG.getVTList(Op.getValueType(), Op.getOperand(0).getValueType()),
        Op.getOperand(0),
        DAG.getTargetConstant(Intrinsic::rl78_getpsw, DL, MVT::i16));

    SDValue shr1 = DAG.getNode(ISD::SRL, DL, MVT::i8, getPSW,
                               DAG.getConstant(1, DL, MVT::i8));

    SDValue And3 = DAG.getNode(ISD::AND, DL, MVT::i8, shr1,
                               DAG.getConstant(3, DL, MVT::i8));

    return DAG.getNode(
        ISD::MERGE_VALUES, DL,
        DAG.getVTList(Op.getValueType(), Op.getOperand(0).getValueType()), And3,
        Op.getOperand(0));
  }
  case Intrinsic::rl78_pswie: {

    SDValue GetPSW = DAG.getNode(
        ISD::INTRINSIC_W_CHAIN, DL,
        DAG.getVTList(Op.getValueType(), Op.getOperand(0).getValueType()),
        Op.getOperand(0),
        DAG.getTargetConstant(Intrinsic::rl78_getpsw, DL, MVT::i16));

    SDValue SRL = DAG.getNode(ISD::SRL, DL, MVT::i8, GetPSW,
                              DAG.getConstant(7, DL, Op.getValueType()));

    return DAG.getNode(
        ISD::MERGE_VALUES, DL,
        DAG.getVTList(Op.getValueType(), Op.getOperand(0).getValueType()), SRL,
        Op.getOperand(0));
  }
  case Intrinsic::rl78_mov1: {
    SDValue addrOp = Op.getOperand(2);
    addrOp = LowerIntrinsicAddrOp(addrOp, DL, DAG);
    SDValue movToCY =
        DAG.getNode(RL78ISD::MOV1TOCY, DL, MVT::Other, Op.getOperand(0),
                    Op.getOperand(4), Op.getOperand(5));
    SDValue store1FromCY = DAG.getNode(RL78ISD::STORE1FROMCY, DL, MVT::Other,
                                       movToCY, Op.getOperand(3), addrOp);
    return store1FromCY;
  }
  case Intrinsic::rl78_and1:
    return LowerBitOpIntrinsic(RL78ISD::AND1CY, Op, DAG);
  case Intrinsic::rl78_or1:
    return LowerBitOpIntrinsic(RL78ISD::OR1CY, Op, DAG);
  case Intrinsic::rl78_xor1:
    return LowerBitOpIntrinsic(RL78ISD::XOR1CY, Op, DAG);
  case Intrinsic::rl78_set1:
  case Intrinsic::rl78_clr1: {
    // Op.dump();
    // Op.getOperand(0).dump();
    // Op.getOperand(2).dump();
    SDValue bitOp = Op.getOperand(3);
    if (!isa<ConstantSDNode>(Op.getOperand(3))) {
      if (IntNo == Intrinsic::rl78_set1)
        DAG.getContext()->emitError("set1 2nd argument must be constant");
      else
        DAG.getContext()->emitError("clr1 2nd argument must be constant");
      // Chose bit 0 so we can still select the instruction so we don't end up
      // with a much uglier "Cannot select" fatal error.
      bitOp = DAG.getConstant(0, DL, MVT::i8);
    }
    SDValue addrOp = Op.getOperand(2);
    if (FrameIndexSDNode *FIN = dyn_cast<FrameIndexSDNode>(Op.getOperand(2))) {
      int FI = cast<FrameIndexSDNode>(FIN)->getIndex();
      EVT VT = FIN->getValueType(0);
      SDValue TFI = DAG.getTargetFrameIndex(FI, VT);
      SDValue Imm = DAG.getTargetConstant(0, DL, MVT::i16);
      SDNode *MN =
          DAG.getMachineNode(RL78::MOVW_rp_stack_slot, DL, VT, TFI, Imm);
      addrOp = SDValue(MN, 0);
    }
    return DAG.getNode((IntNo == Intrinsic::rl78_set1) ? RL78ISD::SET1
                                                       : RL78ISD::CLR1,
                       DL, MVT::i8, Op.getOperand(0), bitOp, addrOp);
  }
  case Intrinsic::rl78_not1: {
    SDValue addrOp = Op.getOperand(2);
    if (GlobalAddressSDNode *G =
            dyn_cast<GlobalAddressSDNode>(Op.getOperand(2))) {
      const GlobalValue *GV = G->getGlobal();
      int64_t Offset = G->getOffset();

      if (isa<GlobalVariable>(GV) &&
          dyn_cast<GlobalVariable>(GV)->hasAttribute("saddr")) {
        // we can use xor saddr, #byte
        SDValue Mask = DAG.getTargetConstant(1 << Op.getConstantOperandVal(3),
                                             DL, MVT::i8);
        return SDValue(DAG.getMachineNode(
                           RL78::XOR_saddr_imm, DL, MVT::Other,
                           DAG.getTargetGlobalAddress(GV, DL, MVT::i16, Offset),
                           Mask, Op.getOperand(0)),
                       0);
      }

      SDNode *MN = DAG.getMachineNode(
          RL78::MOVW_rp_imm, DL, Op.getOperand(2).getValueType(),
          DAG.getTargetGlobalAddress(GV, DL, MVT::i16, Offset));
      addrOp = SDValue(MN, 0);
    } else if (FrameIndexSDNode *FIN =
                   dyn_cast<FrameIndexSDNode>(Op.getOperand(2))) {
      int FI = cast<FrameIndexSDNode>(FIN)->getIndex();
      EVT VT = FIN->getValueType(0);
      SDValue TFI = DAG.getTargetFrameIndex(FI, VT);
      SDValue Imm = DAG.getTargetConstant(0, DL, MVT::i16);
      SDNode *MN =
          DAG.getMachineNode(RL78::MOVW_rp_stack_slot, DL, VT, TFI, Imm);
      addrOp = SDValue(MN, 0);
    } else if (ConstantSDNode *CN =
                   dyn_cast<ConstantSDNode>(Op.getOperand(2))) {
      uint64_t imm = CN->getZExtValue() & 0xFFFF;
      if (imm < 0xFF00) {
        SDNode *MN = DAG.getMachineNode(
            RL78::MOVW_rp_imm, DL, Op.getOperand(2).getValueType(),
                                        DAG.getTargetConstant(imm, DL, MVT::i16));
        addrOp = SDValue(MN, 0);
      }
    }
    SDValue loadToCY = DAG.getNode(RL78ISD::LOAD1TOCY, DL, MVT::Other,
                                   Op.getOperand(0), Op.getOperand(3), addrOp);
    SDValue notCY = DAG.getNode(RL78ISD::NOT1CY, DL, MVT::Other, loadToCY);
    SDValue store1FromCY = DAG.getNode(RL78ISD::STORE1FROMCY, DL, MVT::Other,
                                       notCY, Op.getOperand(3), addrOp);
    return store1FromCY;
  }
  }
  return SDValue();
}

static bool isConstantZero(SDValue operand) {
  ConstantSDNode *divisor = dyn_cast<ConstantSDNode>(operand);
  return divisor != nullptr && divisor->getZExtValue() == 0;
}

SDValue
RL78TargetLowering::LowerIntrinsicWithoutChain(SDValue Op,
                                               SelectionDAG &DAG) const {
  SDLoc DL(Op);
  // Op.dump();
  unsigned IntNo = cast<ConstantSDNode>(Op.getOperand(0))->getZExtValue();
  switch (IntNo) {
  case Intrinsic::rl78_rolb: {
    if (!DAG.getMachineFunction().getFunction().hasOptSize())
      return DAG.getNode(ISD::ROTL, DL, MVT::i8, Op.getOperand(1),
                         Op.getOperand(2));
    else
      return LowerLibCall(Op, DAG, GetRotLibCallName(ISD::ROTL, MVT::i8), false,
                          1);
  }
  case Intrinsic::rl78_rorb: {
    if (!DAG.getMachineFunction().getFunction().hasOptSize())
      return DAG.getNode(ISD::ROTR, DL, MVT::i8, Op.getOperand(1),
                         Op.getOperand(2));
    else
      return LowerLibCall(Op, DAG, GetRotLibCallName(ISD::ROTR, MVT::i8), false,
                          1);
  }
  case Intrinsic::rl78_rolw: {
    if (!DAG.getMachineFunction().getFunction().hasOptSize())
      return DAG.getNode(ISD::ROTL, DL, MVT::i16, Op.getOperand(1),
                         Op.getOperand(2));
    else
      return LowerLibCall(Op, DAG, GetRotLibCallName(ISD::ROTL, MVT::i16),
                          false, 1);
  }
  case Intrinsic::rl78_rorw: {
    if (!DAG.getMachineFunction().getFunction().hasOptSize())
      return DAG.getNode(ISD::ROTR, DL, MVT::i16, Op.getOperand(1),
                         Op.getOperand(2));
    else
      return LowerLibCall(Op, DAG, GetRotLibCallName(ISD::ROTR, MVT::i16),
                          false, 1);
  }
  case Intrinsic::rl78_mulu: {
    // Op.getOperand(0).dump();
    SDValue Op0Zext =
        DAG.getNode(ISD::ZERO_EXTEND, DL, MVT::i16, Op.getOperand(1));
    SDValue Op1Zext =
        DAG.getNode(ISD::ZERO_EXTEND, DL, MVT::i16, Op.getOperand(2));
    return DAG.getNode(ISD::MUL, DL, MVT::i16, Op0Zext, Op1Zext);
  }
  case Intrinsic::rl78_divui: {
    if (isConstantZero(Op.getOperand(2))) {
      // CC-RL: When divisor y is 0, 0xFFFF is returned.
      return DAG.getConstant(0xFFFF, DL, MVT::i16);
    }
    if (Subtarget->isRL78S3CoreType()) {
      SDValue ZExt =
          DAG.getNode(ISD::ZERO_EXTEND, DL, MVT::i16, Op.getOperand(2));
      return DAG.getNode(ISD::UDIV, DL, MVT::i16, Op->getOperand(1), ZExt);
    } else {
      return LowerLibCall(Op, DAG, "_COM_divui", false,
                          {Op.getOperand(1), Op.getOperand(2)});
    }
  }
  case Intrinsic::rl78_remui: {
    if (isConstantZero(Op.getOperand(2))) {
      // CC-RL: When divisor y is 0, the lower-order 8 bits of dividend x are
      // returned.
      return DAG.getNode(ISD::EXTRACT_ELEMENT, DL, MVT::i8, Op.getOperand(1),
                         DAG.getConstant(0, DL, MVT::i8));
    }
    if (Subtarget->isRL78S3CoreType()) {
      SDValue ZExt =
          DAG.getNode(ISD::ZERO_EXTEND, DL, MVT::i16, Op.getOperand(2));
      SDValue URem =
          DAG.getNode(ISD::UREM, DL, MVT::i16, Op->getOperand(1), ZExt);
      return DAG.getNode(ISD::TRUNCATE, DL, MVT::i8, URem);
    } else {
      return LowerLibCall(Op, DAG, "_COM_remui", false,
                          {Op.getOperand(1), Op.getOperand(2)});
    }
  }
  case Intrinsic::rl78_remul: {
    if (isConstantZero(Op.getOperand(2))) {
      // CC-RL: When divisor y is 0, the lower-order 16 bits of dividend x are
      // returned.
      return DAG.getNode(ISD::EXTRACT_ELEMENT, DL, MVT::i16, Op.getOperand(1),
                         DAG.getConstant(0, DL, MVT::i16));
    }
    // TODO: optimize for S3 and S1/S2 compiler-rt.
    return LowerLibCall(Op, DAG, "_COM_remul", false,
                        {Op.getOperand(1), Op.getOperand(2)});
  }
  }
  return SDValue();
}

