ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
SDValue RL78TargetLowering::LowerIntrinsicVoid(SDValue Op,
                                               SelectionDAG &DAG) const {
  SDLoc DL(Op);
  // Op.dump();
  unsigned IntNo = cast<ConstantSDNode>(Op.getOperand(1))->getZExtValue();
  switch (IntNo) {
  case Intrinsic::rl78_setpswisp: {

    SDValue and3 = DAG.getNode(ISD::AND, DL, MVT::i8, Op.getOperand(2),
                               DAG.getConstant(3, DL, MVT::i8));

    SDValue shl1 = DAG.getNode(ISD::SHL, DL, MVT::i8, and3,
                               DAG.getConstant(1, DL, MVT::i8));

    SDValue getPSW = DAG.getNode(
        ISD::INTRINSIC_W_CHAIN, DL,
        DAG.getVTList(MVT::i8, Op.getOperand(0).getValueType()),
        Op.getOperand(0),
        DAG.getTargetConstant(Intrinsic::rl78_getpsw, DL, MVT::i16));

    SDValue getPSWand = DAG.getNode(ISD::AND, DL, MVT::i8, getPSW,
                                    DAG.getConstant(249, DL, MVT::i8));
    SDValue orPSW = DAG.getNode(ISD::OR, DL, MVT::i8, shl1, getPSWand);
    SDValue setPSW =
        DAG.getNode(ISD::INTRINSIC_VOID, DL, MVT::Other, Op.getOperand(0),
                    DAG.getTargetConstant(Intrinsic::rl78_setpsw, DL,
                                          getPointerTy(DAG.getDataLayout())),
                    orPSW);

    return setPSW;
  }
  }
  return SDValue();
}

SDValue RL78TargetLowering::LowerLOAD(SDValue Op, SelectionDAG &DAG) const {
  LoadSDNode *LD = cast<LoadSDNode>(Op);
  EVT MemVT = LD->getMemoryVT();
  SDValue Chain = LD->getChain();
  SDValue Ptr = LD->getBasePtr();
  Align Alignment = Align(LD->getAlignment());
  unsigned value = Alignment.value();
  SDLoc dl(Op);
  // If this is an unaligned load and the target doesn't support it,
  // expand it.
  if (!allowsMemoryAccess(*DAG.getContext(), DAG.getDataLayout(), MemVT,
                          LD->getAddressSpace(), Alignment)) {
    unsigned IncrementSize = (MemVT.getSizeInBits() >> 1) / 8;

    // Load the value in two parts (little endian).
    SDValue Lo =
        DAG.getLoad(MVT::i8, dl, Chain, Ptr, LD->getPointerInfo(), Alignment,
                    LD->getMemOperand()->getFlags(), LD->getAAInfo());
    SDValue HiPtr = DAG.getObjectPtrOffset(dl, Ptr, TypeSize::Fixed(IncrementSize));
    SDValue Hi = DAG.getLoad(MVT::i8, dl, Chain, HiPtr,
                             LD->getPointerInfo().getWithOffset(IncrementSize),
                             MinAlign(value, IncrementSize),
                             LD->getMemOperand()->getFlags(), LD->getAAInfo());

    SDValue SubRegHi = DAG.getTargetConstant(RL78::sub_hi, dl, MVT::i8);
    SDValue SubRegLow = DAG.getTargetConstant(RL78::sub_lo, dl, MVT::i8);

    SDValue In16 =
        DAG.getTargetConstant(RL78::RL78RPRegsRegClassID, dl, MVT::i16);
    SDValue Regs[5] = {In16, Hi, SubRegHi, Lo, SubRegLow};
    SDNode *node =
        DAG.getMachineNode(TargetOpcode::REG_SEQUENCE, dl, MVT::i16, Regs);

    SDValue OutChains[2] = {SDValue(Hi.getNode(), 1), SDValue(Lo.getNode(), 1)};
    SDValue OutChain = DAG.getNode(ISD::TokenFactor, dl, MVT::Other, OutChains);
    SDValue Ops[2] = {SDValue(node, 0), OutChain};
    SDValue lowered = DAG.getMergeValues(Ops, dl);
    return lowered;
  }
  return Op;
}

SDValue RL78TargetLowering::LowerSTORE(SDValue Op, SelectionDAG &DAG) const {
  StoreSDNode *ST = cast<StoreSDNode>(Op);
  EVT MemVT = ST->getMemoryVT();
  SDValue Chain = ST->getChain();
  SDValue Ptr = ST->getBasePtr();
  SDLoc dl(Op);
  bool Fast;
  if (!allowsMemoryAccess(*DAG.getContext(), DAG.getDataLayout(), MemVT,
                          *ST->getMemOperand(), &Fast)) {
    SDValue SubRegHi = DAG.getTargetConstant(RL78::sub_hi, dl, MVT::i8);
    SDValue SubRegLow = DAG.getTargetConstant(RL78::sub_lo, dl, MVT::i8);

    SDNode *Hi = DAG.getMachineNode(TargetOpcode::EXTRACT_SUBREG, dl, MVT::i8,
                                    ST->getValue(), SubRegHi);
    SDNode *Lo = DAG.getMachineNode(TargetOpcode::EXTRACT_SUBREG, dl, MVT::i8,
                                    ST->getValue(), SubRegLow);

    unsigned IncrementSize = (MemVT.getSizeInBits() >> 1) / 8;
    SDValue Store1 =
        DAG.getTruncStore(Chain, dl, SDValue(Lo, 0), Ptr, ST->getPointerInfo(),
                          MVT::i8, ST->getAlign(), ST->getMemOperand()->getFlags());
    Ptr = DAG.getObjectPtrOffset(dl, Ptr, TypeSize::Fixed(IncrementSize));
    SDValue Store2 =
        DAG.getTruncStore(Chain, dl, SDValue(Hi, 0), Ptr,
                          ST->getPointerInfo().getWithOffset(IncrementSize),
                          MVT::i8, MinAlign(ST->getAlignment(), IncrementSize),
                          ST->getMemOperand()->getFlags(), ST->getAAInfo());

    SDValue lowered =
        DAG.getNode(ISD::TokenFactor, dl, MVT::Other, Store1, Store2);
    return lowered;
  }
  return Op;
}

SDValue RL78TargetLowering::LowerSETCC(SDValue Op, SelectionDAG &DAG) const {
  if (Op.getOperand(0).getValueType() == MVT::i64) {
  }
  llvm_unreachable("Should not custom lower this SETCC!");
}

static SDValue LowerLOW16(SDValue Op, SelectionDAG &DAG) {
  // Op.dump();
  // Op.getOperand(0).dump();
  // VK_RL78_LOW16

  // SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(Op), VT, Offset);
  return Op;
}

SDValue RL78TargetLowering::PerformBRCONDCombine(SDNode *N, DAGCombinerInfo &DCI) const {
  // TODO: revisit this in GCC-1920
  if (N->getOpcode() == ISD::BRCOND &&
      N->getOperand(1)->getOpcode() == ISD::SETCC &&
      N->getOperand(1)->getOperand(0).getValueType() == MVT::i32) {
    // Combine:
    // i1 = setcc t5, Imm, CC
    // ch = brcond t0, t8,
    // to:
    // CMP HIGHW(t5), HIGW(Imm)
    // SKNZ
    // CMP LOWW(t5), LOWW(Imm)
    // ch = brcond t0, t8,

    SDLoc dl(N);
    SDValue SetCC = N->getOperand(1);
    SDValue Chain = N->getOperand(0);
    SDValue Dest = N->getOperand(2);

    SDValue LoIndex = DCI.DAG.getConstant(0, dl, MVT::i16);
    SDValue HiIndex = DCI.DAG.getConstant(1, dl, MVT::i16);

    SDValue LowLHS = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                     SetCC->getOperand(0), LoIndex);
    SDValue HighLHS = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                      SetCC->getOperand(0), HiIndex);
    SDValue LowRHS = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                     SetCC->getOperand(1), LoIndex);
    SDValue HighRHS = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                      SetCC->getOperand(1), HiIndex);
    ISD::CondCode CC =
        cast<CondCodeSDNode>(N->getOperand(1)->getOperand(2))->get();

    SDValue HighCompare =  DCI.DAG.getConstant(IntCondCCodeSign(CC), dl, MVT::i8);
    SDValue Cmp = DCI.DAG.getNode(RL78ISD::CMP, dl, MVT::Glue, HighLHS, HighRHS,
                                  HighCompare);
    SDValue LowCmp = DCI.DAG.getNode(RL78ISD::LOWCMP, dl, MVT::Glue, LowLHS,
                                     LowRHS, Cmp);

    SDValue TargetCC = DCI.DAG.getConstant(IntCondCCodeToICC(CC), dl, MVT::i8);
    return DCI.DAG.getNode(RL78ISD::BRCC, dl, MVT::Other, Chain, Dest, TargetCC,
                           LowCmp);
  }

  return SDValue();
}

static SDValue AsMULHCandidate(SDValue op, ISD::NodeType opcode,
                               SelectionDAG &DAG, SDLoc dl) {
  assert(opcode == ISD::ZERO_EXTEND || opcode == ISD::SIGN_EXTEND);
  if (op->getOpcode() == ISD::Constant) {
    if (opcode == ISD::ZERO_EXTEND &&
        cast<ConstantSDNode>(op)->getZExtValue() <= UINT16_MAX)
      return DAG.getConstant(cast<ConstantSDNode>(op)->getZExtValue(), dl,
                             MVT::i16);

