ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    if (opcode == ISD::SIGN_EXTEND &&
        cast<ConstantSDNode>(op)->getSExtValue() >= INT16_MIN &&
        cast<ConstantSDNode>(op)->getSExtValue() <= INT16_MAX)
      return DAG.getConstant(cast<ConstantSDNode>(op)->getSExtValue(), dl,
                             MVT::i16);
  }
  if (op->getOpcode() == opcode &&
      op.getOperand(0).getValueType() == MVT::i16) {
    return op.getOperand(0);
  }
  return SDValue();
}

SDValue RL78TargetLowering::PerformMULCombine(SDNode *N,
                                              DAGCombinerInfo &DCI) const {
  SDLoc dl(N);
  ISD::NodeType op = ISD::DELETED_NODE;
  SDValue RHS, LHS;

  if (N->getOpcode() == ISD::MUL && N->getValueType(0) == MVT::i32) {
    RHS = AsMULHCandidate(N->getOperand(0), ISD::SIGN_EXTEND, DCI.DAG, dl);
    LHS = AsMULHCandidate(N->getOperand(1), ISD::SIGN_EXTEND, DCI.DAG, dl);
    if (RHS && LHS)
      op = ISD::SMUL_LOHI;
    else {
      RHS = AsMULHCandidate(N->getOperand(0), ISD::ZERO_EXTEND, DCI.DAG, dl);
      LHS = AsMULHCandidate(N->getOperand(1), ISD::ZERO_EXTEND, DCI.DAG, dl);
      if (RHS && LHS)
        op = ISD::UMUL_LOHI;
    }
  }
  if (op != ISD::DELETED_NODE) {

    SDValue LoHi = DCI.DAG.getNode(
        op, dl, DCI.DAG.getVTList(MVT::i16, MVT::i16), RHS, LHS);
    return DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32, LoHi.getValue(0),
                           LoHi.getValue(1));
  } else {
    return SDValue();
  }
}

SDValue
RL78TargetLowering::PerformUDIVREMCombine(SDNode *N, DAGCombinerInfo &DCI,
                                          ISD::NodeType otherNodeType) const {
  SDValue Op0 = N->getOperand(0);
  SDValue Op1 = N->getOperand(1);
  SDValue combined, div, remainder;
  unsigned Opcode = N->getOpcode();
  unsigned DivRemOpc = RL78ISD::DIVWU;
  EVT VT = Op0.getValueType();
  SDLoc dl(N);

  if (VT != MVT::i32)
    return combined;

  SDVTList VTs = DCI.DAG.getVTList(MVT::i16, MVT::i16, MVT::i16, MVT::i16);
  SDValue high = DCI.DAG.getConstant(1, dl, MVT::i16);
  SDValue low = DCI.DAG.getConstant(0, dl, MVT::i16);
  SDValue op0lo = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                  N->getOperand(0), low);
  SDValue op0hi = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                  N->getOperand(0), high);
  SDValue op1lo = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                  N->getOperand(1), low);
  SDValue op1hi = DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                  N->getOperand(1), high);

  for (SDNode::use_iterator UI = Op0.getNode()->use_begin(),
                            UE = Op0.getNode()->use_end();
       UI != UE; ++UI) {
    SDNode *User = *UI;
    if (User == N || User->getOpcode() == ISD::DELETED_NODE ||
        User->use_empty())
      continue;

    unsigned UserOpc = User->getOpcode();
    if ((UserOpc == Opcode || UserOpc == otherNodeType ||
         UserOpc == DivRemOpc) &&
        User->getOperand(0) == Op0 && User->getOperand(1) == Op1) {
      if (!combined) {
        if (UserOpc == otherNodeType) {
          combined = DCI.DAG.getNode(DivRemOpc, SDLoc(N), VTs, op0lo, op0hi,
                                     op1lo, op1hi);

          div = DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32,
                                combined.getValue(0), combined.getValue(1));
          remainder =
              DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32,
                              combined.getValue(2), combined.getValue(3));

        } else if (UserOpc == DivRemOpc) {
          combined = SDValue(User, 0);
        } else {
          assert(UserOpc == Opcode);
          continue;
        }
      }
      if (UserOpc == ISD::UDIV)
        DCI.CombineTo(User, div);
      else if (UserOpc == ISD::UREM)
        DCI.CombineTo(User, remainder);
    }
  }
  if (!combined) {
    // Even if we don't need the other results, using divwu is beneficial.
    combined =
        DCI.DAG.getNode(DivRemOpc, SDLoc(N), VTs, op0lo, op0hi, op1lo, op1hi);

    div = DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32, combined.getValue(0),
                          combined.getValue(1));
    remainder = DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32,
                                combined.getValue(2), combined.getValue(3));
  }

  return Opcode == ISD::UDIV ? div : remainder;
}

SDValue RL78TargetLowering::PerformMULADDCombine(SDNode *N,
                                                 DAGCombinerInfo &DCI) const {
  SDLoc dl(N);
  unsigned op = ISD::DELETED_NODE;
  SDValue MulA, MulB, AddX;
  // Assume that the multiplication was already combined to (u/s)mul_lohi.
  if (N->getOpcode() == ISD::ADD && N->getValueType(0) == MVT::i32) {
    if (N->getOperand(0)->getOpcode() == ISD::BUILD_PAIR &&
        (N->getOperand(0)->getOperand(0)->getOpcode() == ISD::SMUL_LOHI ||
         N->getOperand(0)->getOperand(0)->getOpcode() == ISD::UMUL_LOHI)) {
      op = N->getOperand(0)->getOperand(0)->getOpcode() == ISD::SMUL_LOHI
               ? RL78ISD::MACH
               : RL78ISD::MACHU;
      MulA = N->getOperand(0)->getOperand(0)->getOperand(0);
      MulB = N->getOperand(0)->getOperand(0)->getOperand(1);
      AddX = N->getOperand(1);
    } else if (N->getOperand(1)->getOpcode() == ISD::BUILD_PAIR &&
               (N->getOperand(1)->getOperand(0)->getOpcode() ==
                    ISD::SMUL_LOHI ||
                N->getOperand(1)->getOperand(0)->getOpcode() ==
                    ISD::UMUL_LOHI)) {
      op = N->getOperand(1)->getOperand(0)->getOpcode() == ISD::SMUL_LOHI
               ? RL78ISD::MACH
               : RL78ISD::MACHU;
      MulA = N->getOperand(1)->getOperand(0)->getOperand(0);
      MulB = N->getOperand(1)->getOperand(0)->getOperand(1);
      AddX = N->getOperand(0);
    }
  }

  if (op != ISD::DELETED_NODE && AddX->getOpcode() != ISD::Constant &&
      AddX->getOpcode() != ISD::LOAD) {

    SDValue high = DCI.DAG.getConstant(1, dl, MVT::i16);
    SDValue low = DCI.DAG.getConstant(0, dl, MVT::i16);
    SDValue XLo =
        DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, AddX, low);
    SDValue XHi =
        DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, AddX, high);

    SDValue LoHi = DCI.DAG.getNode(
        op, dl, DCI.DAG.getVTList(MVT::i16, MVT::i16), XLo, XHi, MulA, MulB);
    return DCI.DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32, LoHi.getValue(0),
                           LoHi.getValue(1));
  } else {
    return SDValue();
  }
}

SDValue RL78TargetLowering::PerformTruncateCombine(SDNode *N,
                                                   DAGCombinerInfo &DCI) const {
  // Trunc (i32 >> 16) to i16 => extract high(i32).
  if (N->getOpcode() == ISD::TRUNCATE && N->getValueType(0) == MVT::i16 &&
      N->getOperand(0)->getOpcode() == ISD::SRL &&
      N->getOperand(0)->getValueType(0) == MVT::i32 &&
      N->getOperand(0)->getOperand(1)->getOpcode() == ISD::Constant &&
      N->getOperand(0)->getConstantOperandVal(1) == 16) {
    SDLoc dl(N);
    SDValue high = DCI.DAG.getConstant(1, dl, MVT::i16);
    return DCI.DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                           N->getOperand(0)->getOperand(0), high);
  }
  return SDValue();
}

SDValue RL78TargetLowering::PerformDAGCombine(SDNode *N,
                                              DAGCombinerInfo &DCI) const {
  switch (N->getOpcode()) {
  case ISD::BRCOND:
    return PerformBRCONDCombine(N, DCI);
  case ISD::MUL:
      return PerformMULCombine(N, DCI);
  case ISD::UDIV:
      return PerformUDIVREMCombine(N, DCI, ISD::UREM);
  case ISD::UREM:
      return PerformUDIVREMCombine(N, DCI, ISD::UDIV);
  case ISD::ADD:
      return PerformMULADDCombine(N, DCI);
  case ISD::TRUNCATE:
      return PerformTruncateCombine(N, DCI);
  default:
    return SDValue();
  }
}

