ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
SDValue RL78TargetLowering::LowerOperation(SDValue Op,
                                           SelectionDAG &DAG) const {
  // RL78Core coreType = Subtarget->GetCoreType();
  // Op.dump();
  switch (Op.getOpcode()) {
  default:
    llvm_unreachable("Should not custom lower this!");
  // TODO: remove.
  case RL78ISD::HI16:
  case RL78ISD::LOW16: {
    SDValue Result =
        withTargetFlags(Op.getOperand(0), RL78MCExpr::VK_RL78_LOWW, DAG);
    return DAG.getNode(RL78ISD::LOW16, SDLoc(Op), MVT::i16, Result);
  }
  // case RL78ISD::HI16: {
  //  SDValue Result = withTargetFlags(Op.getOperand(0),
  //  RL78MCExpr::VK_RL78_HI8, DAG); return DAG.getNode(RL78ISD::HI16,
  //  SDLoc(Op), MVT::i16, Result);
  //}
  case ISD::ADDRSPACECAST:
    if (Op.getValueType() != Op.getOperand(0).getValueType()) {
      llvm_unreachable("Unexpected address space cast");
    }
    return Op.getOperand(0);
  case ISD::SETCC:
    return LowerSETCC(Op, DAG);
  case ISD::LOAD:
    return LowerLOAD(Op, DAG);
  case ISD::STORE:
    return LowerSTORE(Op, DAG);
  case ISD::RETURNADDR:
    return LowerRETURNADDR(Op, DAG, *this, Subtarget);
  case ISD::FRAMEADDR:
    return LowerFRAMEADDR(Op, DAG, Subtarget);
  case ISD::ExternalSymbol:
    return LowerExternalSymbol(Op, DAG);
  case ISD::GlobalAddress:
    return LowerGlobalAddress(Op, DAG);
  case ISD::BlockAddress:
    return LowerBlockAddress(Op, DAG);
  case ISD::JumpTable:
    return LowerJumpTable(Op, DAG);
  case ISD::ConstantPool:
    return LowerConstantPool(Op, DAG);
  case ISD::BR_CC:
    return LowerBR_CC(Op, DAG);
  case ISD::SELECT_CC:
    return LowerSELECT_CC(Op, DAG);
  case ISD::VASTART:
    return LowerVASTART(Op, DAG, *this);
  case ISD::VAARG:
    return LowerVAARG(Op, DAG);

  case ISD::AND:
    return LowerAndOrXor(Op, DAG, RL78ISD::ANDMEM);
  case ISD::OR:
    return LowerAndOrXor(Op, DAG, RL78ISD::ORMEM);
  case ISD::XOR:
    return LowerAndOrXor(Op, DAG, RL78ISD::XORMEM);
  case ISD::UDIV:
    return LowerCDIV(Op, DAG, ISD::UDIV);
  case ISD::SDIV:
    return LowerCDIV(Op, DAG, ISD::SDIV);
  case ISD::MUL:
    return LowerMul(Op, DAG);
  case ISD::UMULO:
  case ISD::SMULO:
    return LowerMULO(Op, DAG);

  case ISD::SRA:
  case ISD::SRL:
  case ISD::SHL:
    return LowerShift(Op, DAG);
  case ISD::ROTL:
  case ISD::ROTR:
    return LowerRotate(Op, DAG);
  case ISD::INTRINSIC_W_CHAIN:
    return LowerIntrinsicWithChain(Op, DAG);
  case ISD::INTRINSIC_WO_CHAIN:
    return LowerIntrinsicWithoutChain(Op, DAG);
  case ISD::INTRINSIC_VOID:
    return LowerIntrinsicVoid(Op, DAG);
  }
}

MachineBasicBlock *RL78TargetLowering::LowerRotate_r_imm(MachineInstr &MI,
                                                         MachineBasicBlock *BB,
                                                         bool rotl) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // MI.dump();
  // BB->dump();
  assert(MI.getOperand(2).isImm());
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(1));
  //
  unsigned rotAmmount =
      rotl ? MI.getOperand(2).getImm() : 8 - MI.getOperand(2).getImm();
  switch (rotAmmount) {
  case 1:
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  case 2:
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  case 3:
    // Build 3 x rol a, 1.
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROL_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  case 4:
    BuildMI(*BB, MI, DL, TII->get(RL78::CLRB_r), RL78::R0);
    BuildMI(*BB, MI, DL, TII->get(RL78::SHRW_rp_i), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addImm(4);
    BuildMI(*BB, MI, DL, TII->get(RL78::OR_r_r), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
    break;
  case 5:
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  case 6:
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  case 7:
    BuildMI(*BB, MI, DL, TII->get(RL78::ROR_r_1), RL78::R1)
        .addReg(RL78::R1, RegState::Kill);
    break;
  default:
    llvm_unreachable("Invalid imm value for 8 bit rotation!");
  }
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::R1, RegState::Kill);
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerRotate16_rp_imm(
    MachineInstr &MI, MachineBasicBlock *BB, bool rotl) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // MI.dump();
  assert(MI.getOperand(2).isImm());
  //
  unsigned rotAmmount =
      rotl ? MI.getOperand(2).getImm() : 16 - MI.getOperand(2).getImm();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));

  switch (rotAmmount) {
  case 1: {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_cy_r)).addReg(RL78::R1).addImm(7);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    break;
  }
  case 2: {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_cy_r)).addReg(RL78::R1).addImm(7);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    break;
  }
  case 3: {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_cy_r)).addReg(RL78::R1).addImm(7);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    break;
  }
  case 4:
  case 5:
  case 6:
  case 10:
  case 11:
  case 12:
  case 13:
  case 14: {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOVW_rp_AX), RL78::RP2)
        .addReg(RL78::RP0, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::SHLW_rp_imm), RL78::RP2)
        .addReg(RL78::RP2, RegState::Kill)
        .addImm(rotAmmount); // 4, 5, 6, 10, 11, 12, 13, 14
    BuildMI(*BB, MI, DL, TII->get(RL78::SHRW_rp_i), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addImm(16 - rotAmmount); // 12, 11, 10, 6, 5, 4, 3, 2
    BuildMI(*BB, MI, DL, TII->get(RL78::ADDW_rp_rp), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP2, RegState::Kill);
    break;
  }
  case 7: {
    BuildMI(*BB, MI, DL, TII->get(RL78::SHRW_rp_i), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addImm(0x01);
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_r_cy), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
    break;
  }
  case 8:
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
    break;
  case 9: {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_cy_r)).addReg(RL78::R1).addImm(7);
    BuildMI(*BB, MI, DL, TII->get(RL78::ROLWC_rp_1), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
    break;
  }
  case 15: {
    // Do right shift with 1 first, this will take care of the lower 15 bits,
    // CY will contain the value which needs to go at the top.
    BuildMI(*BB, MI, DL, TII->get(RL78::SHRW_rp_i), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addImm(1);
    // Copy the value of CY into bit 7 of high part.
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV1_r_cy), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;
  }
  default:
    llvm_unreachable("Invalid imm value for 16 bit rotation!");
  }
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerAndOrXor16_rp_rp(unsigned int opcode, MachineInstr &MI,
                                          MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // MI.dump();
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));

  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(MI.getOperand(2).getReg(), 0, RL78::sub_hi);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(MI.getOperand(2).getReg(), 0, RL78::sub_lo);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);

