ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerAndOrXor16_rp_memri(
    unsigned int opcode, unsigned int opcode2, MachineInstr &MI,
    MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // MI.dump();
  // BB->dump();
  unsigned Offset = MI.getOperand(3).getImm();

  if (Offset > 255) {
    BuildMI(*BB, MI, DL, TII->get(RL78::LOAD16_rp_rbci), RL78::RP0)
        .add(MI.getOperand(2))
        .addImm(Offset);

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP4).add(MI.getOperand(1));

    BuildMI(*BB, MI, DL, TII->get(opcode2), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R5, RegState::Kill);

    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);

    BuildMI(*BB, MI, DL, TII->get(opcode2), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R4, RegState::Kill);

  } else {

    // First insert the copies into AX and HL:
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));
    MI.getOperand(1).ChangeToRegister(RL78::RP0, false);

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP6).add(MI.getOperand(2));
    MI.getOperand(2).ChangeToRegister(RL78::RP6, false);

    if (BB->getParent()->getRegInfo().isReserved(RL78::RP6)) {
      BuildMI(*BB, MI, DL, TII->get(RL78::PUSH_rp))
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::POP_rp), RL78::RP6);
    }

    BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::RP6)
        .addImm(Offset + 1);

    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);

    BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::RP6, RegState::Kill)
        .addImm(Offset);
  }

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);

  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerAndOrXor16_rp_abs16(
    unsigned int opcode, MachineInstr &MI, MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  unsigned Rs1 = MI.getOperand(1).getReg();
  const GlobalValue *global = MI.getOperand(2).getGlobal();
  unsigned offset = MI.getOperand(2).getOffset();
  unsigned Rd = MI.getOperand(0).getReg();

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .addReg(Rs1, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addGlobalAddress(global, offset + 1);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addGlobalAddress(global, offset);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rd)
      .addReg(RL78::RP0, RegState::Kill);

  MI.eraseFromParent();
  return BB;
}

static bool IsMemr(MachineInstr &MI) {
  return MI.getOpcode() == RL78::CMPW_rp_memri ||
         MI.getOpcode() == RL78::CMP_r_memri ||
         MI.getOpcode() == RL78::CMP_r_memrr;
}

MachineBasicBlock *
RL78TargetLowering::LowerSignedCMP0(bool cmpw, MachineInstr &MI,
                                    MachineBasicBlock *BB) const {
  // The sign operand is the last explicit operand.
  if (MI.getOperand(MI.getNumExplicitOperands() - 1).getImm() == 0)
    return BB;
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  if (MI.getOpcode() == RL78::CMP0_r) {
    // BB->dump();
    bool isKill = MI.getOperand(0).isKill();
    MI.getOperand(0).setIsKill(false);
    unsigned Rs0 = MI.getOperand(0).getReg();
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(Rs0, isKill ? RegState::Kill : 0)
        .addImm(7);
    // BB->dump();
    return BB;
  } else if (MI.getOpcode() == RL78::CMP0_abs16) {
    BuildMI(*BB, MI, DL, TII->get(RL78::LOAD8_r_abs16), RL78::R1)
        .add(MI.getOperand(0));
    // Change instruction: CMP0_abs16 -> CMP0_r.
    BuildMI(*BB, MI, DL, TII->get(RL78::CMP0_r)).addReg(RL78::R1);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    MI.eraseFromParent();
    // BB->dump();
    return BB;

  } else if (MI.getOpcode() == RL78::CMP0_saddr) {
    // BB->dump();
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_saddrx))
        .add(MI.getOperand(0))
        .addImm(7);
    // BB->dump();
    return BB;
  }
  return BB;
}

// Signed comparison: Insert 2 xor1 instructions to
// handle the sign bit as follows: xor1 CY, <op0> + xor1 CY, <op1> for example
// if we compare 1 and 0xFF and let's consider the condition is LT, then CY
// flag needs to be 1: CMP operation is dst - src => 1 - 0xFF => 2 and borrow
// out of bit 7 so CY is set to 1. If the comparison is unsigned (1 - 255) the
// result is correct for LT (1 < 255). If the comparison is signed (1 - (-1))
// the result is incorrect for LT (because 1 > -1), this is why we need take
// the sign bits into consideration: xor1 CY, 0 (sign bit of 1) => CY = 1 xor1
// CY, 1 (sign bit of 0xFF) => CY = 0 which is the correct result for LT (1 >
// -1) Another solution would be to insert xor <op0>, #0x80 + xor <op1>, #0x80
// before the CMP hower that solution requires writing those registers so the
// unchanged values need to be backed up if they are used later on (decreased
// reg pressure).
MachineBasicBlock *
RL78TargetLowering::LowerSignedCMP(MachineInstr &MI,
                                   MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  // If unsigned comparison nothing to do.
  // The sign operand is the last explicit operand.
  if (MI.getOperand(MI.getNumExplicitOperands() - 1).getImm() == 0) {
    if (MI.getOperand(0).isReg()) {
      BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1)
          .add(MI.getOperand(0));
      MI.getOperand(0).ChangeToRegister(RL78::R1, false);
    }
    if (MI.getOpcode() != RL78::CMP_r_r) {
      if (MI.getOperand(1).isReg()) {
        BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP6)
            .add(MI.getOperand(1));
        MI.getOperand(1).ChangeToRegister(RL78::RP6, false);
      }
      if (MI.getOperand(2).isReg()) {
        BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R2)
            .add(MI.getOperand(2));
        MI.getOperand(2).ChangeToRegister(RL78::R2, false);
      }
    }
    return BB;
  }

  switch (MI.getOpcode()) {
  default:
    llvm_unreachable("Cannot lower this instruction!");
  case RL78::CMP_saddr_imm:
    // Change instruction: CMP_saddr_imm ->
    // mov a, 0x80
    // xor a, saddr
    // cmp a, ((imm ^ 0x80)+1)
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_r_imm), RL78::R1).addImm(0x80);
    BuildMI(*BB, MI, DL, TII->get(RL78::XOR_r_saddr), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .add(MI.getOperand(0));
    BuildMI(*BB, MI, DL, TII->get(RL78::CMP_r_imm))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(((MI.getOperand(1).getImm() & 0xFF) ^ 0x80) + 1);
    MI.eraseFromParent();
    break;
  case RL78::CMP_abs16_imm:
    // Change instruction: CMP_abs16_imm -> CMP_r_imm.
    // xor1_cy_A.
    // if imm negative, NOT1_cy.
    BuildMI(*BB, MI, DL, TII->get(RL78::LOAD8_r_abs16), RL78::R1)
        .add(MI.getOperand(0));
    BuildMI(*BB, MI, DL, TII->get(RL78::CMP_r_imm))
        .addReg(RL78::R1)
        .add(MI.getOperand(1));
    BuildMI(*BB, MI, DL, TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    if (MI.getOperand(1).getImm() & 0x80)
      BuildMI(*BB, MI, DL, TII->get(RL78::NOT1_cy));
    MI.eraseFromParent();
    break;

