ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  case RL78::CMP_r_imm:
    // Change op0 to A.
    // xor1_cy_A.
    // if imm negative, NOT1_cy.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    if (MI.getOperand(1).getImm() & 0x80)
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::NOT1_cy));
    break;

  case RL78::CMP_r_r:
    // Change op0 to A.
    // Next: xor1_cy_a.
    // Next: mov_A_op1.
    // Next: xor1_cy_a.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::MOV_A_r), RL78::R1)
        .add(MI.getOperand(1));
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;

  case RL78::CMP_r_abs16:
    // Change op0 to A.
    // Next: xor1_cy_A.
    // Next: mov_A_op1.
    // Next: xor1_cy_A.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::LOAD8_r_abs16), RL78::R1)
        .add(MI.getOperand(1));
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;

  case RL78::CMP_r_saddr:
    // Change op0 to A.
    // Next: xor1_cy_A.
    // Next: xor1_cy_op1.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_saddrx))
        .add(MI.getOperand(1))
        .addImm(7);
    break;

  case RL78::CMP_r_memri:
    // Change op0 to A.
    // Next: xor1_cy_A.
    // Next: mov_A_op1.
    // Next: xor1_cy_A.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP6).add(MI.getOperand(1));
    MI.getOperand(1).ChangeToRegister(RL78::RP6, false);

    if (BB->getParent()->getRegInfo().isReserved(RL78::RP6)) {
      BuildMI(*BB, MI, DL, TII->get(RL78::PUSH_rp))
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::POP_rp), RL78::RP6);
    }

    if (MI.getOperand(2).getImm() == 0) {
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::XOR1_cy_memr))
          .add(MI.getOperand(1))
          .addImm(7);
    } else {
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::XOR1_cy_r))
          .addReg(RL78::R1, RegState::Kill)
          .addImm(7);
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::LOAD8_r_memHLi), RL78::R1)
          .add(MI.getOperand(1))
          .add(MI.getOperand(2));
    }
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;

  case RL78::CMP_r_memrr:
    // Change op0 to A.
    // Next: xor1_cy_A.
    // Next: MOV_A_op1.
    // Next: xor1_cy_A.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::R1, false);

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP6).add(MI.getOperand(1));
    MI.getOperand(1).ChangeToRegister(RL78::RP6, false);

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R2).add(MI.getOperand(2));
    MI.getOperand(2).ChangeToRegister(RL78::R2, false);

    if (BB->getParent()->getRegInfo().isReserved(RL78::RP6)) {
      BuildMI(*BB, MI, DL, TII->get(RL78::PUSH_rp))
          .addReg(RL78::RP6, RegState::Kill);
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::POP_rp), RL78::RP6);
    }

    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::LOAD8_r_memrr), RL78::R1)
        .add(MI.getOperand(1))
        .add(MI.getOperand(2));

    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;
  }

  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerSignedCMPW(MachineInstr &MI,
                                    MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // TODO: think about volatile if we can use xor1 with saddr 8 bit load.
  // If unsigned comparison nothing to do.
  // The sign operand is the last explicit operand.
  if (MI.getOperand(MI.getNumExplicitOperands() - 1).getImm() == 0) {
    if (MI.getOperand(0).isReg()) {
      BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
          .add(MI.getOperand(0));
      MI.getOperand(0).ChangeToRegister(RL78::RP0, false);
    }
    return BB;
  }

  switch (MI.getOpcode()) {
  default:
    llvm_unreachable("Cannot lower this instruction!");

  case RL78::CMPW_rp_imm:
    // Change op0 to AX.
    // xor1_cy_A.
    // if imm negative, NOT1_cy.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::RP0, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    if (MI.getOperand(1).getImm() & 0x8000)
      BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
              TII->get(RL78::NOT1_cy));
    break;

