ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  case RL78::CMPW_rp_rp:
    // Change op0 to AX.
    // Next: xor1_cy_AX.hi.
    // Next: MOV_A_op1.hi.
    // Next: xor1_cy_a.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::RP0, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::COPY))
        .addReg(RL78::R1, RegState::Define)
        .addReg(MI.getOperand(1).getReg(), 0, RL78::sub_hi);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;

  case RL78::CMPW_rp_abs16:
    // Change op0 to AX.
    // Next: xor1_cy_A.
    // Next: load ax, abs16.
    // Next: xor1_cy_A.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::RP0, false);

    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::LOAD16_rp_abs16), RL78::RP0)
        .add(MI.getOperand(1));
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;

  case RL78::CMPW_rp_saddr:
    // Change op0 to AX.
    // Next: xor1_cy_A.
    // Next: load AX, saddr.
    // Next: xor1_cy_A.
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::RP0, false);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::LOAD16_rp_saddrp), RL78::RP0)
        .add(MI.getOperand(1));
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::XOR1_cy_r))
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;
  }

  return BB;
}

static unsigned int tryGetRP6(MachineBasicBlock *BB) {
  return BB->getParent()->getRegInfo().isReserved(RL78::RP6) ? RL78::RP4
                                                             : RL78::RP6;
}

MachineBasicBlock *
RL78TargetLowering::LowerSignedCMPWMem(MachineInstr &MI,
                                       MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // BB->dump();
  // First insert the copies into AX and HL:
  // AX = COPY %0.
  // HL = COPY %1.
  // CMPW AX, [HL+byte].

  bool fpUsed = BB->getParent()->getRegInfo().isReserved(RL78::RP6);
  if (fpUsed) {
    BuildMI(*BB, MI, DL, TII->get(RL78::PUSH_rp))
        .addReg(RL78::RP6, RegState::Kill);
    // TODO: CFA.
  }

  BB = Lower16bitAXSrc(MI, Lower16bitAXSrc(MI, BB, 1, RL78::RP6));
  // If unsigned comparison nothing else to do.
  assert(MI.getOperand(3).isImm() && "Invalid CMPW instruction operand(3)!");
  if (MI.getOperand(3).getImm() == 0)
    return BB;
  // Second we insert XOR1 instrucitons (see LowerSignedCMP for a detailed
  // explanation) The final sequence will look like this: AX = COPY %0 HL = COPY
  // %1 CMPW AX, [HL+byte] XOR1 Cy, A.7 MOV A, [HL+byte+1] XOR1 Cy, A.7.
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::XOR1_cy_r))
      .addReg(RL78::R1, RegState::Kill)
      .addImm(7);
  //
  assert(MI.getOperand(2).isImm() && (MI.getOperand(2).getImm() % 2 == 0) &&
         "Invalid CMPW instruction operand(2)!");
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::LOAD16_rp_memHLi), RL78::RP0)
      .addReg(RL78::RP6, RegState::Kill)
      .addImm(MI.getOperand(2).getImm());
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::XOR1_cy_r))
      .addReg(RL78::R1, RegState::Kill)
      .addImm(7);

  if (fpUsed) {
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI), 2), DL,
            TII->get(RL78::POP_rp), RL78::RP6);
    // TODO: CFA.
  }
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerAndOrXor16_rp_imm(
    unsigned int opcode, MachineInstr &MI, MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  // BB->dump();
  unsigned ImmLo = (unsigned)MI.getOperand(2).getImm() & 0xFF;
  unsigned ImmHi = ((unsigned)MI.getOperand(2).getImm() >> 8) & 0xFF;

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));
  // Part Low -> rs = R0    Part High -> rs = R1
  // ImmLo == 0x00 -> AND  -> clrb rs.
  // ImmLo == 0x00 -> OR   -> no instruction needs to be generated.
  // ImmLo == 0x00 -> XOR  -> no instruction needs to be generated.
  // ImmLo == 0xFF -> AND  -> no instruction needs to be generated.
  // ImmLo == 0xFF -> OR   -> mov rs, 0xff
  // ImmLo == 0xFF -> XOR  -> xch r1, r0 && xor r1, ImmLo
  // ImmLo != 0x00 && ImmLo != 0xff  -> xch r1, r0 && opcode r1, ImmLo
  // Part Low
  if (ImmLo == 0x00 && opcode == RL78::AND_r_imm) {
    BuildMI(*BB, MI, DL, TII->get(RL78::CLRB_r), RL78::R0);
  } else if ((ImmLo != 0xff && opcode == RL78::AND_r_imm) ||
             (ImmLo != 0x00 &&
              (opcode == RL78::OR_r_imm || opcode == RL78::XOR_r_imm))) {
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);

    BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addImm(ImmLo);

    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R0, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R0, RegState::Kill);
  } else if (opcode == RL78::OR_r_imm && ImmLo == 0xff) {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_r_imm), RL78::R0).addImm(ImmLo);
  }
  // Part High
  if (ImmHi == 0x00 && opcode == RL78::AND_r_imm) {
    BuildMI(*BB, MI, DL, TII->get(RL78::CLRB_r), RL78::R1);
  } else if ((ImmHi != 0xff && opcode == RL78::AND_r_imm) ||
             (ImmHi != 0x00 &&
              (opcode == RL78::OR_r_imm || opcode == RL78::XOR_r_imm))) {

    BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addImm(ImmHi);
  } else if (ImmHi == 0xff && opcode == RL78::OR_r_imm) {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_r_imm), RL78::R1).addImm(ImmHi);
  }

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);

