ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

static bool isCCRegDead(MachineInstr &MI) {
  //
  for (unsigned i = MI.getNumExplicitOperands(), e = MI.getNumOperands();
       i != e; ++i) {
    if (MI.getOperand(i).isReg() &&
        (MI.getOperand(i).getReg() == RL78::CCreg) && MI.getOperand(i).isDef())
      return MI.getOperand(i).isDead();
  }
  //
  return false;
}

static bool IsCarryDead(MachineInstr &MI) {
  for (int i = 0; i < MI.getNumOperands(); i++)
    if (MI.getOperand(i).isReg() && MI.getOperand(i).getReg() == RL78::CCreg &&
        MI.getOperand(i).isDead())
      return true;
  return false;
}

MachineBasicBlock *
RL78TargetLowering::LowerADDE_SUBE_rp_rp(unsigned int opcode, MachineInstr &MI,
                                         MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  unsigned Rs1 = MI.getOperand(1).getReg();
  unsigned Rs2 = MI.getOperand(2).getReg();
  unsigned Rd = MI.getOperand(0).getReg();

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .addReg(Rs1, RegState::Kill);

  if (IsCarryDead(MI) && getTargetMachine().getOptLevel() == CodeGenOpt::Aggressive) {
    // After changing Op0 and Op1 to RP0, delegate it to expandPostRAPseudo.
    // Since expandPostRAPseudo is using bundle and we disable outlining of bundles,
    // we do this only when optimizing for speed.
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::COPY), Rd)
        .addReg(RL78::RP0);
    MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
    MI.getOperand(1).ChangeToRegister(RL78::RP0, false);
    return BB;

  } else {
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(Rs2, 0, RL78::sub_lo);
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(Rs2, 0, RL78::sub_hi);
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rd)
      .addReg(RL78::RP0, RegState::Kill);

  MI.eraseFromParent();
  return BB;
  }
}

MachineBasicBlock *
RL78TargetLowering::LowerADDE_SUBE_rp_imm(unsigned int opcode, MachineInstr &MI,
                                          MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  unsigned Rs1 = MI.getOperand(1).getReg();
  unsigned Imm = MI.getOperand(2).getImm() & 0xFFFF;
  unsigned ImmLo = MI.getOperand(2).getImm() & 0xFF;
  unsigned ImmHi = ((unsigned)MI.getOperand(2).getImm() >> 8) & 0xFF;
  unsigned Rd = MI.getOperand(0).getReg();

  if (Imm == 0 || Imm == 0xFFFF) {
    // If the constant is 0 we need to consider only the carry.

    if (IsCarryDead(MI)) {
      // If the carry is dead, we can use skip + ADDW/INCW instead of ADDC's.
      MachineFunction::iterator It = std::next(MachineFunction::iterator(BB));
      const BasicBlock *LLVM_BB = BB->getBasicBlock();
      MachineBasicBlock *CarryAddMBB = MF->CreateMachineBasicBlock(LLVM_BB);
      MachineBasicBlock *sinkMBB = MF->CreateMachineBasicBlock(LLVM_BB);
      MF->insert(It, CarryAddMBB);
      MF->insert(It, sinkMBB);
      sinkMBB->splice(sinkMBB->begin(), BB,
                      std::next(MachineBasicBlock::iterator(MI)), BB->end());
      sinkMBB->transferSuccessorsAndUpdatePHIs(BB);
      BB->addSuccessor(CarryAddMBB);
      BB->addSuccessor(sinkMBB);
      CarryAddMBB->addSuccessor(sinkMBB);

      BuildMI(*BB, MI, DL, TII->get(RL78::BRCC))
          .addMBB(sinkMBB)
          .addImm(Imm == 0xFFFF ? RL78CC::RL78CC_C : RL78CC::RL78CC_NC);

      unsigned carryOpcode;      
      if (Imm == 0 && RL78::SUBC_A_imm == opcode ||
          Imm == 0xFFFF && RL78::ADDC_A_imm == opcode)
        carryOpcode = RL78::DECW_rp;
      else if (Imm == 0 && RL78::ADDC_A_imm == opcode ||
               Imm == 0xFFFF && RL78::SUBC_A_imm == opcode)
        carryOpcode = RL78::INCW_rp;
      else
        llvm_unreachable("Unexpected opcode in LowerADDE_Sube");

      unsigned RPTemp = BB->getParent()->getRegInfo().createVirtualRegister(
          &RL78::RL78RPRegsRegClass);
      BuildMI(*CarryAddMBB, CarryAddMBB->end(), DL, TII->get(carryOpcode),
              RPTemp)
          .addReg(Rs1);

      BuildMI(*sinkMBB, sinkMBB->begin(), DL, TII->get(RL78::PHI), Rd)
          .addReg(RPTemp)
          .addMBB(CarryAddMBB)
          .addReg(Rs1)
          .addMBB(BB);

      MI.eraseFromParent();
      return sinkMBB;
    }
  }

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .addReg(Rs1, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addImm(ImmLo);
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addImm(ImmHi);
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rd)
      .addReg(RL78::RP0, RegState::Kill);

  MI.eraseFromParent();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerADDE_SUBE_rp_memri(
    unsigned int opcode, MachineInstr &MI, MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  unsigned Rs1 = MI.getOperand(1).getReg();
  unsigned MemReg = MI.getOperand(2).getReg();
  unsigned Offset = MI.getOperand(3).getImm();
  unsigned Rd = MI.getOperand(0).getReg();

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .addReg(Rs1, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(MemReg)
      .addImm(Offset);
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(MemReg, RegState::Kill)
      .addImm(Offset + 1);

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rd)
      .addReg(RL78::RP0, RegState::Kill);

  MI.eraseFromParent();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerADDE_SUBE_rp_abs16(
    unsigned int opcode, MachineInstr &MI, MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  unsigned Rs1 = MI.getOperand(1).getReg();
  const GlobalValue *global = MI.getOperand(2).getGlobal();
  unsigned offset = MI.getOperand(2).getOffset();
  unsigned Rd = MI.getOperand(0).getReg();

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .addReg(Rs1, RegState::Kill);

  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addGlobalAddress(global, offset);
  BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
      .addReg(RL78::R0, RegState::Define)
      .addReg(RL78::R1, RegState::Kill)
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, MI, DL, TII->get(opcode), RL78::R1)
      .addReg(RL78::R1, RegState::Kill)
      .addGlobalAddress(global, offset + 1);

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rd)
      .addReg(RL78::RP0, RegState::Kill);

  MI.eraseFromParent();
  return BB;
}

