ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
// Lower SIGN_EXTEND/ZERO_EXTEND
MachineBasicBlock *
RL78TargetLowering::LowerEXTEND(bool sext, MachineInstr &MI,
                                MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
  //
  // MI.dump();
  unsigned Rs1 = MRI.createVirtualRegister(&RL78::RL78OddRegRegClass);
  unsigned RPd = MRI.createVirtualRegister(&RL78::RL78RPRegsRegClass);
  unsigned RPd1 = MRI.createVirtualRegister(&RL78::RL78RPRegsRegClass);

  BuildMI(*BB, MI, DL, TII->get(RL78::IMPLICIT_DEF), RPd);
  BuildMI(*BB, MI, DL, TII->get(RL78::INSERT_SUBREG), RPd1)
      .addReg(RPd, RegState::Kill)
      .add(MI.getOperand(1))
      .addImm(sext ? RL78::sub_hi : RL78::sub_lo);

  if (sext) {
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
        .addReg(RPd1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::SARW_rp_i), RL78::RP0)
        .addReg(RL78::RP0, RegState::Kill)
        .addImm(8);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::COPY))
        .add(MI.getOperand(0))
        .addReg(RL78::RP0, RegState::Kill);
  } else {
    BuildMI(*BB, MI, DL, TII->get(RL78::CLRB_r), RL78::R1);
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Rs1)
        .addReg(RL78::R1, RegState::Kill);
    BuildMI(*BB, MI, DL, TII->get(RL78::INSERT_SUBREG))
        .add(MI.getOperand(0))
        .addReg(RPd1, RegState::Kill)
        .addReg(Rs1, RegState::Kill)
        .addImm(RL78::sub_hi);
  }
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerSELECTCC(bool isI8, MachineInstr &MI,
                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
  //
  // MI.dump();
  unsigned Rd = MI.getOperand(0).getReg();
  unsigned RPd = MRI.createVirtualRegister(isI8 ? &RL78::RL78RegRegClass
                                                : &RL78::RL78RPRegsRegClass);
  unsigned RPd2 = MRI.createVirtualRegister(isI8 ? &RL78::RL78RegRegClass
                                                 : &RL78::RL78RPRegsRegClass);
  // thisMBB:
  //  ...
  //  %val = Tval
  //  b** sinkBB
  //  fallthrough --> copy0MBB
  MachineBasicBlock *thisMBB = BB;
  const BasicBlock *LLVM_BB = BB->getBasicBlock();
  MachineFunction::iterator It = ++BB->getIterator();
  MachineFunction *F = BB->getParent();
  MachineBasicBlock *copy0MBB = F->CreateMachineBasicBlock(LLVM_BB);
  MachineBasicBlock *sinkMBB = F->CreateMachineBasicBlock(LLVM_BB);
  F->insert(It, copy0MBB);
  F->insert(It, sinkMBB);
  // Transfer the remainder of BB and its successor edges to sinkMBB.
  sinkMBB->splice(sinkMBB->begin(), BB,
                  std::next(MachineBasicBlock::iterator(MI)), BB->end());
  sinkMBB->transferSuccessorsAndUpdatePHIs(BB);
  // Add the true and fallthrough blocks as its successors.
  BB->addSuccessor(copy0MBB);
  BB->addSuccessor(sinkMBB);
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RPd).add(MI.getOperand(1));
  // Although it's only 1 COPY instruction it can be expanded to several
  // mov/movw or xch/xchw, the branch expand pass will insert a skip instruciton
  // if possible.
  // BuildMI(*BB, MI, DL,
  // TII->get(RL78::SK_cc)).addMBB(sinkMBB).add(MI.getOperand(3));
  BuildMI(*BB, MI, DL, TII->get(RL78::BRCC))
      .addMBB(sinkMBB)
      .add(MI.getOperand(3));
  // copy0MBB:
  //  %val2 = COPY Fval
  //  fallthrough --> sinkMBB
  BuildMI(*copy0MBB, copy0MBB->begin(), DL, TII->get(RL78::COPY), RPd2)
      .add(MI.getOperand(2));
  // Update machine-CFG edges
  copy0MBB->addSuccessor(sinkMBB);

  // sinkMBB:
  //  %Result = phi [ %val2, copy0MBB ], [ %val, thisMBB ]
  //  ...
  BuildMI(*sinkMBB, sinkMBB->begin(), DL, TII->get(RL78::PHI), Rd)
      .addReg(RPd2)
      .addMBB(copy0MBB)
      .addReg(RPd)
      .addMBB(thisMBB);
  // The pseudo instruction is gone now.
  MI.eraseFromParent();
  //
  // F->dump();
  return sinkMBB;
}

// In order to implement the very stric register class constraints for the
// various instructions we first started by writing in tablegen the real
// constraints (i.e. RL78AReg for ADD dest). This made it impossible for the
// both register allocators (greedy, pbpqp) to find any soluition even in simple
// cases we ended up with errors like (even when disabling the register
// coalescer):
//
// Assertion failed : MO->isDead() && "Cannot fold physreg def",
// Assertion failed : !MIS.empty() && "Unexpected empty span of instructions!",
// fatal error : error in backend : ran out of registers during register
// allocation
//
// Next step was to relax the constratints and added
// RL78InsertExchangeInstructionsPass. A further optimization was to use the
// physical reg directly in cases were we have a single choice (which also means
// less work for the register allocator):
//
// let Defs = [R1, CCreg], Uses = [R1] in{
// def ADD_r_r : InstRL78_8bit<0x00,
// (outs), (ins RL78RExceptA : $rsrc2),
// "add a, $rsrc2",
// [(set R1, (add R1, i8:$rsrc2))]>;
// }
//
// This worked for a few instructions but later we ended up with the following
// error (beside tablegen crashing): "Trying to add an operand to a machine
// instr that is already done!" The solution implemented below is basically the
// same as above just implemented differently so we don't get the above error.
MachineBasicBlock *RL78TargetLowering::LowerMUL8(MachineInstr &MI,
                                                 MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R0).add(MI.getOperand(2));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(1));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::R0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::R0, true);
  MI.getOperand(1).ChangeToRegister(RL78::R1, false);
  MI.getOperand(2).ChangeToRegister(RL78::R0, false);
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerMUL16(MachineInstr &MI,
                                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();

  if (Subtarget->isUseMDA()) {

