ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    // After changing Op0 and Op1 to RP0, delegate it to expandPostRAPseudo.
    // If we get here we should not be optimizing for size, so bundles should be
    // ok.
    unsigned Rs1 = MI.getOperand(1).getReg();
    unsigned Rs2 = MI.getOperand(2).getReg();
    unsigned Rd = MI.getOperand(0).getReg();
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).addReg(Rs1);
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::COPY), Rd)
        .addReg(RL78::RP0);
    MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
    MI.getOperand(1).ChangeToRegister(RL78::RP0, false);
    return BB;

  } else {

    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP2).add(MI.getOperand(2));
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));

    //  xch  a, c
    //  movw  de, ax
    //  xch  a, b
    //  mulu  x
    //  xchw  ax, bc
    //  mulu  x
    //  xchw  ax, de
    //  mulu  x
    //  add  a, e
    //  add  a, c

    // The A register contents and C register contents are exchanged.
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R2, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R2, RegState::Kill);

    // AX register contents is transferred to the DE register.
    BuildMI(*BB, MI, DL, TII->get(RL78::MOVW_rp_AX), RL78::RP4)
        .addReg(RL78::RP0, RegState::Kill);

    // The A register contents and B register contents are exchanged.
    BuildMI(*BB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
        .addReg(RL78::R3, RegState::Define)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R3, RegState::Kill);

    // The A register contents and the X register contents are multiplied and
    // the result is stored in the AX register.
    BuildMI(*BB, MI, DL, TII->get(RL78::MULU_r), RL78::R0);

    // The memory contents of the AX register are exchanged with those of the BC
    // register.
    BuildMI(*BB, MI, DL, TII->get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP2, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP2, RegState::Kill);

    // The A register contents and the X register contents are multiplied and
    // the result is stored in the AX register.
    BuildMI(*BB, MI, DL, TII->get(RL78::MULU_r), RL78::R0);

    // The memory contents of the AX register are exchanged with those of the DE
    // register.
    BuildMI(*BB, MI, DL, TII->get(RL78::XCHW_AX_rp), RL78::RP0)
        .addReg(RL78::RP4, RegState::Define)
        .addReg(RL78::RP0, RegState::Kill)
        .addReg(RL78::RP4, RegState::Kill);

    // The A register contents and the X register contents are multiplied and
    // the result is stored in the AX register.
    BuildMI(*BB, MI, DL, TII->get(RL78::MULU_r), RL78::R0);

    // The A register contents is added to the E register contents and the
    // result is stored in the CY flag and in the A register.
    BuildMI(*BB, MI, DL, TII->get(RL78::ADD_r_r), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R4, RegState::Kill);

    // The A register contents is added to the C register contents and the
    // result is stored in the CY flag and in the A register.
    BuildMI(*BB, MI, DL, TII->get(RL78::ADD_r_r), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addReg(RL78::R2, RegState::Kill);
  }
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.eraseFromParent();
  // BB->dump();
  return BB;
}



MachineBasicBlock *
RL78TargetLowering::LowerShiftOrRotateForSpeed(MachineInstr &MI,
                                               MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
  unsigned Rd = MI.getOperand(0).getReg();
  unsigned Rs1 = MI.getOperand(1).getReg();
  unsigned Rs2 = MI.getOperand(2).getReg();

  Register NewRd =
      MRI.getRegClass(MI.getOperand(0).getReg()) == &RL78::RL78RPRegsRegClass
          ? RL78::RP0
          : RL78::R1;

  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R3).addReg(Rs2);
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), NewRd).addReg(Rs1);
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY), Rd)
      .addReg(NewRd);

  MI.getOperand(0).ChangeToRegister(NewRd, true);
  MI.getOperand(1).ChangeToRegister(NewRd, false);
  MI.getOperand(2).ChangeToRegister(RL78::R3, false);

  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerShift_Or_LowerRotate_rp_rp(
    MachineInstr &MI, MachineBasicBlock *BB, unsigned int opcode,
    bool isI8) const {

  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();

  unsigned Rd = MI.getOperand(0).getReg();
  unsigned Rd1 = MI.getOperand(1).getReg();
  unsigned Rd2 = MI.getOperand(2).getReg();
  const TargetRegisterClass *RC =
      isI8 ? &RL78::RL78RegRegClass : &RL78::RL78RPRegsRegClass;
  const TargetRegisterClass *RC2 = &RL78::RL78RegRegClass;
  Register RV1 = MRI.createVirtualRegister(RC);
  Register RV2 = MRI.createVirtualRegister(RC2);
  Register RV4 = MRI.createVirtualRegister(RC2);
  Register RV5 = MRI.createVirtualRegister(RC);
  Register RV6 = MRI.createVirtualRegister(RC2);
  Register RV7 = MRI.createVirtualRegister(RC);
  Register RV8 = MRI.createVirtualRegister(RC);
  Register RP0 = isI8 ? RL78::R1 : RL78::RP0;
  Register RP2 = RL78::R2;
  //
  const BasicBlock *LLVM_BB = BB->getBasicBlock();
  MachineFunction::iterator It = std::next(MachineFunction::iterator(BB));
  MachineBasicBlock *sinkMBB2 = MF->CreateMachineBasicBlock(LLVM_BB);
  MachineBasicBlock *sinkMBB3 = MF->CreateMachineBasicBlock(LLVM_BB);
  MachineBasicBlock *sinkMBB = MF->CreateMachineBasicBlock(LLVM_BB);
  //
  // Insert the blocks.
  MF->insert(It, sinkMBB2);
  MF->insert(It, sinkMBB3);
  MF->insert(It, sinkMBB);

  // Transfer the remainder of BB and its successor edges to sinkMBB.
  sinkMBB->splice(sinkMBB->begin(), BB,
                  std::next(MachineBasicBlock::iterator(MI)), BB->end());
  sinkMBB->transferSuccessorsAndUpdatePHIs(BB);

  // BB add the true successor.
  BB->addSuccessor(sinkMBB2);

  // sinkMBB2 add the true and fallthrough blocks as its successors.
  sinkMBB2->addSuccessor(sinkMBB);
  sinkMBB2->addSuccessor(sinkMBB3);

