ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
  // sinkMBB3 add the true and fallthrough blocks as its successors.
  sinkMBB3->addSuccessor(sinkMBB3);
  sinkMBB3->addSuccessor(sinkMBB);

  // sinkMBB2:
  // RV8 = COPY Rd1.
  BuildMI(*sinkMBB2, sinkMBB2->begin(), DL, TII->get(RL78::COPY), RV8)
      .addReg(Rd1, RegState::Kill);

  // RV4 = COPY Rd2.
  BuildMI(*sinkMBB2, sinkMBB2->end(), DL, TII->get(RL78::COPY), RV4)
      .addReg(Rd2);

  // RP2 = COPY Rd2.
  BuildMI(*sinkMBB2, sinkMBB2->end(), DL, TII->get(RL78::COPY), RP2)
      .addReg(Rd2, RegState::Kill);

  // CMP0 R2 == 0 => Z flag = 1.
  BuildMI(*sinkMBB2, sinkMBB2->end(), DL, TII->get(RL78::CMP0_r))
      .addReg(RL78::R2)
      .addImm(0);

  // if Z flag == 1 => go to sinkMBB.
  BuildMI(*sinkMBB2, sinkMBB2->end(), DL, TII->get(RL78::BRCC))
      .addMBB(sinkMBB)
      .addImm(2);

  // sinkMBB3:
  //  RV1 = phi [ RV8, sinkMBB2 ], [ RV5, sinkMBB3 ].
  BuildMI(*sinkMBB3, sinkMBB3->begin(), DL, TII->get(RL78::PHI), RV1)
      .addReg(RV8)
      .addMBB(sinkMBB2)
      .addReg(RV5)
      .addMBB(sinkMBB3);

  //  RV2 = phi [ RV4, sinkMBB2 ], [ RV6, sinkMBB3 ].
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::PHI), RV2)
      .addReg(RV4)
      .addMBB(sinkMBB2)
      .addReg(RV6)
      .addMBB(sinkMBB3);

  // RP0 = COPY RV1.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::COPY), RP0)
      .addReg(RV1, RegState::Kill);

  switch (opcode) {
  case RL78::SHLW_rp_imm:
  case RL78::SHRW_rp_i:
  case RL78::SARW_rp_i:
  case RL78::SHL_r_imm:
  case RL78::SHR_r_i:
  case RL78::SAR_r_i:
    // RP0 = Op RP0, 1.
    BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(opcode), RP0)
        .addReg(RP0, RegState::Kill)
        .addImm(1);
    break;
  case RL78::ROL_r_1:
  case RL78::ROR_r_1:
      BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(opcode), RP0)
        .addReg(RP0, RegState::Kill);
    break;
  case RL78::ROTL16_rp_rp:
    // MOV1 CY, a.7.
    BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::MOV1_cy_r))
        .addReg(RL78::R1)
        .addImm(7);
    // RP0 = ROLWC RP0, 1.
    BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::ROLWC_rp_1), RP0)
        .addReg(RP0, RegState::Kill);
    break;

  case RL78::ROTR16_rp_rp:
    // RP0 = SHRW RP0, 1.
    BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::SHRW_rp_i), RP0)
        .addReg(RP0, RegState::Kill)
        .addImm(1);
    // MOV1 a.7, CY.
    BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::MOV1_r_cy), RL78::R1)
        .addReg(RL78::R1, RegState::Kill)
        .addImm(7);
    break;
  }

  // RV5 = COPY RP0.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::COPY), RV5)
      .addReg(RP0, RegState::Kill);

  // RP2 = COPY RV2.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::COPY), RP2)
      .addReg(RV2, RegState::Kill);

  // R2 = DEC_r R2.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::DEC_r), RL78::R2)
      .addReg(RL78::R2, RegState::Kill);

  // RV6 = COPY RP2.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::COPY), RV6)
      .addReg(RP2, RegState::Kill);

  // go to sinkMBB3.
  BuildMI(*sinkMBB3, sinkMBB3->end(), DL, TII->get(RL78::B_BNZ))
      .addMBB(sinkMBB3)
      .addImm(3);

  // sinkMBB:
  //  Rd = RV7.
  BuildMI(*sinkMBB, sinkMBB->begin(), DL, TII->get(RL78::COPY), Rd)
      .addReg(RV7, RegState::Kill);

  //  RV7 = phi [ RV8, sinkMBB2 ], [ RV5, sinkMBB3 ].
  BuildMI(*sinkMBB, sinkMBB->begin(), DL, TII->get(RL78::PHI), RV7)
      .addReg(RV8)
      .addMBB(sinkMBB2)
      .addReg(RV5)
      .addMBB(sinkMBB3);
  //
  MI.eraseFromParent();
  return sinkMBB;
}

MachineBasicBlock *
RL78TargetLowering::LowerMUL8Zext16(MachineInstr &MI,
                                    MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R0).add(MI.getOperand(2));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(1));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  MI.getOperand(1).ChangeToRegister(RL78::R1, false);
  MI.getOperand(2).ChangeToRegister(RL78::R0, false);
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerUMUL_LOHI16(MachineInstr &MI,
                                     MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R0).add(MI.getOperand(3));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(2));
  // First operand is the low part so it needs to go into R0.
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::R0, RegState::Kill);
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(1))
      .addReg(RL78::R1, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::R0, true);
  MI.getOperand(1).ChangeToRegister(RL78::R1, true);
  MI.getOperand(2).ChangeToRegister(RL78::R1, false);
  MI.getOperand(3).ChangeToRegister(RL78::R0, false);
  //
  // BB->dump();
  return BB;
}

// Lower all 8 bit operations of the form: A <- A op <...>.
MachineBasicBlock *
RL78TargetLowering::Lower8BitOpAA(MachineInstr &MI,
                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1).add(MI.getOperand(1));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::R1, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::R1, true);
  MI.getOperand(1).ChangeToRegister(RL78::R1, false);
  //
  // BB->dump();
  return BB;
}

// Lower all 16 bit operations of the form: AX <- AX op <...>.
MachineBasicBlock *
RL78TargetLowering::Lower16BitOpAXAX(MachineInstr &MI,
                                     MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(1));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  MI.getOperand(1).ChangeToRegister(RL78::RP0, false);
  //
  // BB->dump();
  return BB;
}

// Lower all 8 bit operations of the form: A <- op <...>.
MachineBasicBlock *
RL78TargetLowering::Lower8bitADst(MachineInstr &MI,
                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::R1, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::R1, true);
  //
  // BB->dump();
  return BB;
}

