ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
// Lower all 16 bit operations of the form: AX <- op <...>.
MachineBasicBlock *
RL78TargetLowering::Lower16bitAXDst(MachineInstr &MI,
                                    MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  //
  // BB->dump();
  return BB;
}

// Lower all 8 bit operations of the form: <...> <- A op <...>.
MachineBasicBlock *RL78TargetLowering::Lower8bitASrc(MachineInstr &MI,
                                                     MachineBasicBlock *BB,
                                                     unsigned OpNum,
                                                     unsigned Reg) const {

  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Reg).add(MI.getOperand(OpNum));
  //
  MI.getOperand(OpNum).ChangeToRegister(Reg, false);
  MI.getOperand(OpNum).setIsKill();
  //
  // BB->dump();
  return BB;
}

// Lower all 16 bit operations of the form: <...> <- AX op <...>.
MachineBasicBlock *RL78TargetLowering::Lower16bitAXSrc(MachineInstr &MI,
                                                       MachineBasicBlock *BB,
                                                       unsigned OpNum,
                                                       unsigned Reg) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Reg).add(MI.getOperand(OpNum));
  //
  MI.getOperand(OpNum).ChangeToRegister(Reg, false);
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerESSrc(MachineInstr &MI,
                                                  MachineBasicBlock *BB,
                                                  unsigned OpNum) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  if (MI.getOperand(OpNum).isReg()) {
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::R1)
        .addReg(MI.getOperand(OpNum).getReg(),
                MI.getOperand(OpNum).isKill() ? RegState::Kill : 0,
                RL78::sub_lo);
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_es_A), RL78::ES)
        .addReg(RL78::R1, RegState::Kill);
  } else
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_es_imm), RL78::ES)
        .add(MI.getOperand(OpNum));
  //
  MI.getOperand(OpNum).ChangeToRegister(RL78::ES, false);
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerCallCSRP(MachineInstr &MI,
                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  if (MI.getOperand(1).isReg()) {
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::CS)
        .addReg(MI.getOperand(1).getReg(),
                MI.getOperand(1).isKill() ? RegState::Kill : 0, RL78::sub_lo);
  } else {
    BuildMI(*BB, MI, DL, TII->get(RL78::MOV_cs_imm), RL78::CS)
        .add(MI.getOperand(1));
  }
  MI.getOperand(1).ChangeToRegister(RL78::CS, false);
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerMULDIV16(MachineInstr &MI,
                                                     MachineBasicBlock *BB,
                                                     unsigned srcIndex) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  unsigned Reg2 =
      (MI.getOpcode() == RL78::UDIVREM16_r_r) ? RL78::RP4 : RL78::RP2;
  //
  // BB->dump();
  // Copy from generic reg class to AX/BC reg classes respectively.
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0)
      .add(MI.getOperand(srcIndex));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), Reg2)
      .add(MI.getOperand(srcIndex + 1));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  MI.getOperand(srcIndex).ChangeToRegister(RL78::RP0, false);
  MI.getOperand(srcIndex + 1).ChangeToRegister(Reg2, false);

  if (MI.getOpcode() == RL78::MUL16_rp_rp)
    MI.addRegisterDead(RL78::RP2,
                       MF->getSubtarget<RL78Subtarget>().getRegisterInfo());

  if (srcIndex == 2) {
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
            TII->get(RL78::COPY))
        .add(MI.getOperand(1))
        .addReg(Reg2, RegState::Kill);
    MI.getOperand(1).ChangeToRegister(Reg2, true);
  }
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *RL78TargetLowering::LowerDIVWU(MachineInstr &MI,
                                                  MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  // BB->dump();

  bool fpUsed = BB->getParent()->getRegInfo().isReserved(RL78::RP6);
  if (fpUsed) {
    BuildMI(*BB, MI, DL, TII->get(RL78::PUSH_rp))
        .addReg(RL78::RP6, RegState::Kill);
    // TODO: CFA.
  }
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(4));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP2).add(MI.getOperand(5));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP4).add(MI.getOperand(6));
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP6).add(MI.getOperand(7));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(3))
      .addReg(RL78::RP6, RegState::Kill);
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(2))
      .addReg(RL78::RP4, RegState::Kill);
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(1))
      .addReg(RL78::RP2, RegState::Kill);
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  MI.getOperand(1).ChangeToRegister(RL78::RP2, true);
  MI.getOperand(2).ChangeToRegister(RL78::RP4, true);
  MI.getOperand(3).ChangeToRegister(RL78::RP6, true);
  MI.getOperand(4).ChangeToRegister(RL78::RP0, false);
  MI.getOperand(5).ChangeToRegister(RL78::RP2, false);
  MI.getOperand(6).ChangeToRegister(RL78::RP4, false);
  MI.getOperand(7).ChangeToRegister(RL78::RP6, false);
  if (fpUsed) {
    BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI), 2), DL,
            TII->get(RL78::POP_rp), RL78::RP6);
    // TODO: CFA.
  }
  //
  // BB->dump();
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::LowerBSWAP32(MachineInstr &MI,
                                 MachineBasicBlock *BB) const {
  DebugLoc DL = MI.getDebugLoc();
  MachineFunction *MF = BB->getParent();
  const TargetInstrInfo *TII = MF->getSubtarget<RL78Subtarget>().getInstrInfo();
  //
  BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(2));
  //
  BuildMI(*BB, std::next(MachineBasicBlock::iterator(MI)), DL,
          TII->get(RL78::COPY))
      .add(MI.getOperand(0))
      .addReg(RL78::RP0, RegState::Kill);
  //
  MI.getOperand(0).ChangeToRegister(RL78::RP0, true);
  MI.getOperand(2).ChangeToRegister(RL78::RP0, false);
  //
  return BB;
}

MachineBasicBlock *
RL78TargetLowering::EmitInstrWithCustomInserter(MachineInstr &MI,
                                                MachineBasicBlock *BB) const {
  // MI.dump();
  bool OptForSpeed =  getTargetMachine().getOptLevel() == CodeGenOpt::Aggressive;
  switch (MI.getOpcode()) {
  default:
    llvm_unreachable("Unknown instruction!");
  case RL78::MOVW_rp_stack_slot:
    // FIXME : we can use BC, DE, HL as well.
    return Lower16bitAXDst(MI, BB);
  case RL78::BSWAP32_rp:
    return LowerBSWAP32(MI, BB);
  case RL78::AEXT_8_16:
  case RL78::ZEXT_8_16:
    return LowerEXTEND(false, MI, BB);
  case RL78::SEXT_8_16:
    return LowerEXTEND(true, MI, BB);
  case RL78::ADDE_rp_imm:
    return LowerADDE_SUBE_rp_imm(RL78::ADDC_A_imm, MI, BB);
  case RL78::SUBE_rp_imm:
    return LowerADDE_SUBE_rp_imm(RL78::SUBC_A_imm, MI, BB);
  case RL78::ADDE_rp_memri:
    return LowerADDE_SUBE_rp_memri(RL78::ADDC_r_memri, MI, BB);
  case RL78::SUBE_rp_memri:
    return LowerADDE_SUBE_rp_memri(RL78::SUBC_r_memri, MI, BB);
  case RL78::ADDE_rp_abs16:
    return LowerADDE_SUBE_rp_abs16(RL78::ADDC_r_abs16, MI, BB);
  case RL78::SUBE_rp_abs16:
    return LowerADDE_SUBE_rp_abs16(RL78::SUBC_r_abs16, MI, BB);
  case RL78::ADDE_rp_rp:
    return LowerADDE_SUBE_rp_rp(RL78::ADDC_r_r, MI, BB);
  case RL78::SUBE_rp_rp:
    return LowerADDE_SUBE_rp_rp(RL78::SUBC_r_r, MI, BB);
  case RL78::AND16_rp_imm:
    return LowerAndOrXor16_rp_imm(RL78::AND_r_imm, MI, BB);
  case RL78::OR16_rp_imm:
    return LowerAndOrXor16_rp_imm(RL78::OR_r_imm, MI, BB);
  case RL78::XOR16_rp_imm:
    return LowerAndOrXor16_rp_imm(RL78::XOR_r_imm, MI, BB);
  case RL78::AND2_16_rp_rp:
  case RL78::AND16_rp_rp:
    return LowerAndOrXor16_rp_rp(RL78::AND_r_r, MI, BB);
  case RL78::OR2_16_rp_rp:
  case RL78::OR16_rp_rp:
    return LowerAndOrXor16_rp_rp(RL78::OR_r_r, MI, BB);
  case RL78::XOR2_16_rp_rp:
  case RL78::XOR16_rp_rp:
    return LowerAndOrXor16_rp_rp(RL78::XOR_r_r, MI, BB);
  case RL78::AND16_rp_memri:
    return LowerAndOrXor16_rp_memri(
        RL78::AND_r_memri, RL78::AND_r_r, MI,
        Lower16bitAXSrc(MI, BB, 2,
                        (MI.getOperand(3).getImm() > 255) ? RL78::RP2
                                                          : tryGetRP6(BB)));
  case RL78::AND16_rp_abs16:
    return LowerAndOrXor16_rp_abs16(RL78::AND_r_abs16, MI, BB);
  case RL78::OR16_rp_memri:
    return LowerAndOrXor16_rp_memri(
        RL78::OR_r_memri, RL78::OR_r_r, MI,
        Lower16bitAXSrc(MI, BB, 2,
                        (MI.getOperand(3).getImm() > 255) ? RL78::RP2
                                                          : tryGetRP6(BB)));
  case RL78::OR16_rp_abs16:
    return LowerAndOrXor16_rp_abs16(RL78::OR_r_abs16, MI, BB);
  case RL78::XOR16_rp_memri:
    return LowerAndOrXor16_rp_memri(
        RL78::XOR_r_memri, RL78::XOR_r_r, MI,
        Lower16bitAXSrc(MI, BB, 2,
                        (MI.getOperand(3).getImm() > 255) ? RL78::RP2
                                                          : tryGetRP6(BB)));
  case RL78::XOR16_rp_abs16:
    return LowerAndOrXor16_rp_abs16(RL78::XOR_r_abs16, MI, BB);
  case RL78::CMPW_rp_imm:
  case RL78::CMPW_rp_rp:
  case RL78::CMPW_rp_abs16:
  case RL78::CMPW_rp_saddr:
    return LowerSignedCMPW(MI, BB);
  case RL78::CMPW_rp_memri:
    return LowerSignedCMPWMem(MI, BB);
  case RL78::CMP_abs16_imm:
  case RL78::CMP_r_memri:
  case RL78::CMP_r_memrr:
  case RL78::CMP_r_imm:
  case RL78::CMP_r_abs16:
  case RL78::CMP_r_r:
  case RL78::CMP_r_saddr:
  case RL78::CMP_saddr_imm:
    return LowerSignedCMP(MI, BB);
  case RL78::CMP0_r:
    return LowerSignedCMP0(false, MI, Lower8bitASrc(MI, BB));
  case RL78::CMP0_abs16:
  case RL78::CMP0_saddr:
    return LowerSignedCMP0(false, MI, BB);
  case RL78::SHR_r_i:
    return Lower8BitOpAA(MI, BB);
  case RL78::SHLW_rp_imm:
  case RL78::SHRW_rp_i:
    return Lower16BitOpAXAX(MI, BB);
  case RL78::SAR_r_i:
  case RL78::ROL_r_1:
  case RL78::ROR_r_1:
    return Lower8BitOpAA(MI, BB);
  case RL78::SARW_rp_i:
    return Lower16BitOpAXAX(MI, BB);
  case RL78::ROTL_r_imm:
    return LowerRotate_r_imm(MI, BB, true);
  case RL78::ROTR_r_imm:
    return LowerRotate_r_imm(MI, BB, false);
  case RL78::ROTL16_r_imm:
    return LowerRotate16_rp_imm(MI, BB, true);
  case RL78::ROTR16_r_imm:
    return LowerRotate16_rp_imm(MI, BB, false);
  case RL78::SELECTCC8:
    return LowerSELECTCC(true, MI, BB);
  case RL78::SELECTCC16:
    return LowerSELECTCC(false, MI, BB);
  case RL78::MUL16_rp_rp:
    return LowerMULDIV16(MI, BB, 1);
  case RL78::MUL32_zext_r_r:
    return LowerMULDIV16(MI, BB, 2);
  case RL78::MUL32_sext_r_r:
    return LowerMULDIV16(MI, BB, 2);
  case RL78::UDIVREM16_r_r:
    return LowerMULDIV16(MI, BB, 2);
  case RL78::UDIVREM32_r_r:
    return LowerDIVWU(MI, BB);
  case RL78::MUL8_r_r:
    return LowerMUL8(MI, BB);
  case RL78::MULU_zext_16_r_r:
    return LowerMUL8Zext16(MI, BB);
  case RL78::MUL16_rp_rp_S1_S2:
    return LowerMUL16(MI, BB);
  case RL78::SHLW_rp_rp:
    return OptForSpeed ? LowerShiftOrRotateForSpeed(MI, BB)
                       : LowerShift_Or_LowerRotate_rp_rp(
                             MI, BB, RL78::SHLW_rp_imm, false);
  case RL78::SHRW_rp_rp:
    return OptForSpeed ? LowerShiftOrRotateForSpeed(MI, BB)
                       : LowerShift_Or_LowerRotate_rp_rp(
                             MI, BB, RL78::SHRW_rp_i, false);
  case RL78::SARW_rp_rp:
    return OptForSpeed ? LowerShiftOrRotateForSpeed(MI, BB)
                       : LowerShift_Or_LowerRotate_rp_rp(
                             MI, BB, RL78::SARW_rp_i, false);
  case RL78::SHL_r_r:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::SHL_r_imm, true);
  case RL78::SHR_r_r:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::SHR_r_i, true);
  case RL78::SAR_r_r:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::SAR_r_i, true);
  case RL78::ROTL_rp_rp:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::ROL_r_1, true);
  case RL78::ROTR_rp_rp:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::ROR_r_1, true);
  case RL78::ROTL16_rp_rp:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::ROTL16_rp_rp, false);
  case RL78::ROTR16_rp_rp:
    return OptForSpeed
               ? LowerShiftOrRotateForSpeed(MI, BB)
               : LowerShift_Or_LowerRotate_rp_rp(MI, BB, RL78::ROTR16_rp_rp, false);
  case RL78::UMUL_LOHI_16_r_r:
    return LowerUMUL_LOHI16(MI, BB);
  case RL78::ADD_r_imm:
    return Lower8BitOpAA(MI, BB);
  case RL78::ADD_r_memrr:
  case RL78::SUB_r_memrr:
  case RL78::AND_r_memrr:
  case RL78::OR_r_memrr:
  case RL78::XOR_r_memrr:
    return Lower8BitOpAA(MI,
                         Lower16bitAXSrc(MI, Lower8bitASrc(MI, BB, 3, RL78::R2),
                                         2, tryGetRP6(BB)));
  case RL78::ADD_r_memri:
  case RL78::SUB_r_memri:
  case RL78::AND_r_memri:
  case RL78::OR_r_memri:
  case RL78::XOR_r_memri:
    return Lower8BitOpAA(MI, Lower16bitAXSrc(MI, BB, 2, tryGetRP6(BB)));
  case RL78::AND_r_imm:
  case RL78::OR_r_imm:
  case RL78::XOR_r_imm:
  case RL78::ADD_r_abs16:
  case RL78::ADD_r_r:
  case RL78::ADD_r_saddr:
  case RL78::SUB_r_imm:
  case RL78::SUB_r_abs16:
  case RL78::SUB_r_r:
  case RL78::SUB_r_saddr:
  case RL78::AND_r_abs16:
  case RL78::AND_r_r:
  case RL78::AND_r_saddr:
  case RL78::OR_r_abs16:
  case RL78::OR_r_r:
  case RL78::OR_r_saddr:
  case RL78::XOR_r_abs16:
  case RL78::XOR_r_r:
  case RL78::XOR_r_saddr:
  case RL78::SHL_r_imm:
    return Lower8BitOpAA(MI, BB);
  case RL78::STORE8_saddr_A:
    return Lower8bitASrc(MI, BB, 1);
  case RL78::LOAD8_r_stack_slot:
  case RL78::LOAD8_r_sfr:
    return Lower8bitADst(MI, BB);
  case RL78::STORE8_ri_imm:
    // STORE [HL+byte] or STORE word[BC].
    return Lower16bitAXSrc(MI, BB, 0,
                           (MI.getOperand(1).getImm() > 255) ? RL78::RP2
                                                             : tryGetRP6(BB));
  case RL78::LOAD8_r_ri:
    // A = LOAD [HL+byte] or A = LOAD word[BC].
    return Lower8bitADst(MI, Lower16bitAXSrc(MI, BB, 1,
                                             (MI.getOperand(2).getImm() > 255)
                                                 ? RL78::RP2
                                                 : tryGetRP6(BB)));
  case RL78::LOAD8_r_memrr:
    return Lower8bitADst(MI,
                         Lower16bitAXSrc(MI, Lower8bitASrc(MI, BB, 2, RL78::R3),
                                         1, tryGetRP6(BB)));
  case RL78::STORE8_ri_r:
    // STORE [HL+byte] or STORE word[BC].
    return Lower8bitASrc(MI,
                         Lower16bitAXSrc(MI, BB, 0,
                                         (MI.getOperand(1).getImm() > 255)
                                             ? RL78::RP2
                                             : tryGetRP6(BB)),
                         2);
  case RL78::STORE8_memrr_r:
    return Lower8bitASrc(MI,
                         Lower16bitAXSrc(MI, Lower8bitASrc(MI, BB, 1, RL78::R3),
                                         0, tryGetRP6(BB)),
                         2);
  case RL78::LOAD16_rp_rpi:
    // AX = LOAD [HL+byte] or AX = LOAD word[BC].
    return Lower16bitAXDst(MI, Lower16bitAXSrc(MI, BB, 1,
                                               (MI.getOperand(2).getImm() > 255)
                                                   ? RL78::RP2
                                                   : tryGetRP6(BB)));
  case RL78::LOAD16_rp_stack_slot:
  case RL78::LOAD16_rp_sfrp:
    return Lower16bitAXDst(MI, BB);
  case RL78::ADDW_rp_imm:
    return Lower16BitOpAXAX(MI, BB);
  case RL78::ADDW_rp_memri:
  case RL78::SUBW_rp_memri:
    return Lower16BitOpAXAX(MI, Lower16bitAXSrc(MI, BB, 2, tryGetRP6(BB)));
  case RL78::ADDW_rp_rp:
    if (MI.getOperand(1).getReg() == MI.getOperand(2).getReg())
      MI.getOperand(2).ChangeToRegister(RL78::RP0, false);
    return Lower16BitOpAXAX(MI, BB);
  case RL78::ADDW_rp_abs16:
  case RL78::SUBW_rp_imm:
  case RL78::SUBW_rp_rp:
  case RL78::SUBW_rp_abs16:
  case RL78::BSWAP_rp:
  case RL78::ADDW_rp_saddr:
  case RL78::SUBW_rp_saddr:
    return Lower16BitOpAXAX(MI, BB);
  case RL78::STORE16_rpi_rp:
    // STORE [HL+byte] or STORE word[BC].
    return Lower16bitAXSrc(MI,
                           Lower16bitAXSrc(MI, BB, 0,
                                           (MI.getOperand(1).getImm() > 255)
                                               ? RL78::RP2
                                               : tryGetRP6(BB)),
                           2);
  case RL78::STORE16_stack_slot_rp:
    return Lower16bitAXSrc(MI, BB, 2);
  case RL78::STORE16_abs16_rp:
  case RL78::STORE16_saddrp_rp:
  case RL78::STORE16_sfrp_rp:
    return Lower16bitAXSrc(MI, BB, 1);
  case RL78::STORE8_abs16_r:
  case RL78::STORE8_sfr_r:
    return Lower8bitASrc(MI, BB, 1);
  case RL78::INC_memri:
  case RL78::DEC_memri:
  case RL78::INCW_memri:
  case RL78::DECW_memri:
    return Lower16bitAXSrc(MI, BB, 0, tryGetRP6(BB));
  case RL78::STORE8_stack_slot_r:
    return Lower8bitASrc(MI, BB, 2);
  case RL78::SET1_esmemr:
  case RL78::CLR1_esmemr:
    return LowerESSrc(MI, Lower16bitAXSrc(MI, BB, 1, tryGetRP6(BB)), 0);
  case RL78::SET1_esaddr16:
  case RL78::CLR1_esaddr16:
    return LowerESSrc(MI, BB, 0);
  case RL78::LOAD16_rp_esrpi:
    return Lower16bitAXDst(
        MI, LowerESSrc(MI,
                       Lower16bitAXSrc(MI, BB, 2,
                                       (MI.getOperand(3).getImm() > 255)
                                           ? RL78::RP2
                                           : tryGetRP6(BB)),
                       1));
  case RL78::LOAD8_r_esrpi:
    return Lower8bitADst(
        MI, LowerESSrc(MI,
                       Lower16bitAXSrc(MI, BB, 2,
                                       (MI.getOperand(3).getImm() > 255)
                                           ? RL78::RP2
                                           : tryGetRP6(BB)),
                       1));
  case RL78::STORE16_esaddr16_rp:
    return Lower16bitAXSrc(MI, LowerESSrc(MI, BB, 0), 2);
  case RL78::STORE16_esrpi_rp:
    return Lower16bitAXSrc(
        MI,
        LowerESSrc(MI,
                   Lower16bitAXSrc(MI, BB, 1,
                                   (MI.getOperand(2).getImm() > 255)
                                       ? RL78::RP2
                                       : tryGetRP6(BB)),
                   0),
        3);
  case RL78::STORE8_esrpi_r:
    return Lower8bitASrc(
        MI,
        LowerESSrc(MI,
                   Lower16bitAXSrc(MI, BB, 1,
                                   (MI.getOperand(2).getImm() > 255)
                                       ? RL78::RP2
                                       : tryGetRP6(BB)),
                   0),
        3);
  case RL78::BTCLR_memr:
  case RL78::BTBF_memr:
  case RL78::BTBF_mem:
    return Lower16bitAXSrc(MI, BB, 2, tryGetRP6(BB));
  case RL78::BTBF:
    return Lower8bitASrc(MI, BB, 2);
  case RL78::CLR1_memr:
  case RL78::SET1_memr:
  case RL78::MOV1_cy_memr:
  case RL78::MOV1_memr_cy:
  case RL78::AND1_cy_memr:
  case RL78::OR1_cy_memr:
  case RL78::XOR1_cy_memr:
    return Lower16bitAXSrc(MI, BB, 0, tryGetRP6(BB));
  case RL78::ONEB_r:
  case RL78::CLRB_r:
    return Lower8bitADst(MI, BB);
  case RL78::MOV1_r_cy:
    return Lower8BitOpAA(MI, BB);
  case RL78::MOV1_cy_r:
    return Lower8bitASrc(MI, BB);
  case RL78::CALL_cs_rp:
    return LowerCallCSRP(MI, BB);
  case RL78::LowCMPW_rp_rp: {
      if(MI.getOperand(0).getReg() == MI.getOperand(1).getReg()) {
          MI.removeFromParent();
          return BB;
      }
      // fallthrough
  }
  case RL78::LowCMPW_rp_imm: 
  case RL78::LowCMPW_rp_saddr:
  case RL78::LowCMPW_rp_abs16:
  case RL78::LowCMPW_rp_memri:{

