ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    MachineFunction *MF = BB->getParent();
    DebugLoc DL = MI.getDebugLoc();
    const TargetInstrInfo *TII =
        MF->getSubtarget<RL78Subtarget>().getInstrInfo();
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(0));
    MI.getOperand(0).ChangeToRegister(RL78::RP0, false);
    return BB;
  }
  case RL78::MACH_CG:
  case RL78::MACHU_CG: {
    MachineFunction *MF = BB->getParent();
    DebugLoc DL = MI.getDebugLoc();
    const TargetInstrInfo *TII =
        MF->getSubtarget<RL78Subtarget>().getInstrInfo();
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP0).add(MI.getOperand(4));
    BuildMI(*BB, MI, DL, TII->get(RL78::COPY), RL78::RP2).add(MI.getOperand(5));
    MI.getOperand(4).ChangeToRegister(RL78::RP0, false);
    MI.getOperand(5).ChangeToRegister(RL78::RP2, false);
    return BB;
  }

  }
}

//===----------------------------------------------------------------------===//
//                         RL78 Inline Assembly Support
//===----------------------------------------------------------------------===//

/// getConstraintType - Given a constraint letter, return the type of
/// constraint it is for this target.
RL78TargetLowering::ConstraintType
RL78TargetLowering::getConstraintType(StringRef Constraint) const {
  if (Constraint.size() == 1) {
    switch (Constraint[0]) {
    case 'r':
    case 'R':
      return C_RegisterClass;
    }
  }

  return TargetLowering::getConstraintType(Constraint);
}

TargetLowering::ConstraintWeight
RL78TargetLowering::getSingleConstraintMatchWeight(
    AsmOperandInfo &info, const char *constraint) const {
  ConstraintWeight weight = CW_Invalid;
  Value *CallOperandVal = info.CallOperandVal;
  // If we don't have a value, we can't do a match,
  // but allow it at the lowest weight.
  if (!CallOperandVal)
    return CW_Default;

  // Look at the constraint type.
  switch (*constraint) {
  default:
    weight = TargetLowering::getSingleConstraintMatchWeight(info, constraint);
    break;
  case 'r':
  case 'R':
    weight = CW_Register;
    break;
  }
  return weight;
}

std::pair<unsigned, const TargetRegisterClass *>
RL78TargetLowering::getRegForInlineAsmConstraint(const TargetRegisterInfo *TRI,
                                                 StringRef Constraint,
                                                 MVT VT) const {
  if (Constraint.size() == 1) {
    switch (Constraint[0]) {
    case 'r':
      return std::pair<unsigned, const TargetRegisterClass *>(
          0U, &RL78::RL78RPRegsRegClass);
    case 'R':
      return std::pair<unsigned, const TargetRegisterClass *>(
          0U, &RL78::RL78RegRegClass);
    }
  }
  return TargetLowering::getRegForInlineAsmConstraint(TRI, Constraint, VT);
}

static SDValue createBSWAPNodes(SDValue node, EVT VT, SelectionDAG &DAG,
                                SDLoc &dl) {

  if (VT.getSimpleVT() == MVT::i16) {
    return DAG.getNode(ISD::BSWAP, dl, MVT::i16, node);
  } else {
    EVT halfVT = VT.getHalfSizedIntegerVT(*DAG.getContext());

    SDValue loHalf = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, halfVT, node,
                                 DAG.getConstant(0, dl, halfVT));
    SDValue swappedLoHalf = createBSWAPNodes(loHalf, halfVT, DAG, dl);

    SDValue hiHalf = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, halfVT, node,
                                 DAG.getConstant(1, dl, halfVT));
    SDValue swappedHiHalf = createBSWAPNodes(hiHalf, halfVT, DAG, dl);

    return DAG.getNode(ISD::BUILD_PAIR, dl, VT, swappedHiHalf, swappedLoHalf);
  }
}

/// This callback is invoked when a node result type is illegal for the
/// target, and the operation was registered to use 'custom' lowering for that
/// result type.  The target places new result values for the node in Results
/// (their number and types must exactly match those of the original return
/// values of the node), or leaves Results empty, which indicates that the
/// node is not to be custom lowered after all.
///
/// If the target has no operations that require custom lowering, it need not
/// implement this.  The default implementation aborts.
void RL78TargetLowering::ReplaceNodeResults(SDNode *N,
                                            SmallVectorImpl<SDValue> &Results,
                                            SelectionDAG &DAG) const {

  SDLoc dl(N);

  // N->dump();
  switch (N->getOpcode()) {
  default:
    llvm_unreachable("Do not know how to custom type legalize this operation!");
    return;
  case ISD::TargetGlobalAddress: {
    GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(N);
    const GlobalValue *GV = G->getGlobal();
    int64_t Offset = G->getOffset();
    SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(N), MVT::i16, Offset);
    SDValue Low16 =
        DAG.getNode(RL78ISD::LOW16, SDLoc(Result), MVT::i16, Result);
    Results.push_back(
        DAG.getNode(RL78ISD::HI16, SDLoc(Result), MVT::i16, Result, Low16));
    return;
  }
  case ISD::ExternalSymbol: {
    ExternalSymbolSDNode *E = dyn_cast<ExternalSymbolSDNode>(N);
    SDValue Result = DAG.getTargetExternalSymbol(E->getSymbol(), MVT::i16);
    SDValue Low16 =
        DAG.getNode(RL78ISD::LOW16, SDLoc(Result), MVT::i16, Result);
    Results.push_back(
        DAG.getNode(RL78ISD::HI16, SDLoc(Result), MVT::i16, Result, Low16));
    return;
  }
  case ISD::ADDRSPACECAST: {
    assert((N->getValueType(0) == MVT::i32) &&
           "Invalid value type for GlobalAddress!");
    AddrSpaceCastSDNode *CastNode = dyn_cast<AddrSpaceCastSDNode>(N);
    SDValue NullConstant = DAG.getConstant(0x00, dl, MVT::i16);
    SDValue LowValue;
    bool IsSrcAddress = CastNode->isFunctionToPointerDecay();
    if (GlobalAddressSDNode *G =
            dyn_cast<GlobalAddressSDNode>(N->getOperand(0))) {
      const GlobalValue *GV = G->getGlobal();
      int64_t Offset = cast<GlobalAddressSDNode>(N->getOperand(0))->getOffset();
      SDValue LowAddress =
          DAG.getTargetGlobalAddress(GV, SDLoc(N->getOperand(0)), MVT::i16,
                                     Offset, RL78MCExpr::VK_RL78_LOWW);
      LowValue =
          DAG.getNode(RL78ISD::LOW16, SDLoc(LowAddress), MVT::i16, LowAddress);
      IsSrcAddress |= GV->getValueType()->isFunctionTy();
    } else {
      LowValue = N->getOperand(0);
    }

    Results.push_back(LowValue);
    if (IsSrcAddress) {
      Results.push_back(NullConstant);
    } else {
      SDValue NonNullPrefix = DAG.getConstant(0x0f, dl, MVT::i16);
      SDValue Prefix = DAG.getSelect(
          dl, MVT::i16,
          DAG.getSetCC(dl, MVT::i16, LowValue, NullConstant, ISD::SETEQ),
          NullConstant, NonNullPrefix);
      Results.push_back(Prefix);
    }
    return;
  }
  case ISD::LOAD:
  case ISD::STORE:
    // We made 32 bit load/store custom for LowerOperationWrapper.
    return;
  case ISD::INTRINSIC_WO_CHAIN: {
    unsigned IntNo = cast<ConstantSDNode>(N->getOperand(0))->getZExtValue();
    switch (IntNo) {
    case Intrinsic::rl78_mului: {
      if (Subtarget->isRL78S3CoreType()) {
        SDValue umulohi =
            DAG.getNode(ISD::UMUL_LOHI, dl, DAG.getVTList(MVT::i16, MVT::i16),
                        N->getOperand(1), N->getOperand(2));
        Results.push_back(SDValue(umulohi.getNode(), 0));
        Results.push_back(SDValue(umulohi.getNode(), 1));
        return;
      }
      // S1/S2 cores.
      Results.push_back(LowerLibCall(SDValue(N, 0), DAG, "_COM_mului", false,
                                     {N->getOperand(1), N->getOperand(2)}));
      return;
    }
    case Intrinsic::rl78_mulsi: {
      if (Subtarget->isRL78S3CoreType()) {
        SDValue umulohi =
            DAG.getNode(ISD::SMUL_LOHI, dl, DAG.getVTList(MVT::i16, MVT::i16),
                        N->getOperand(1), N->getOperand(2));
        Results.push_back(SDValue(umulohi.getNode(), 0));
        Results.push_back(SDValue(umulohi.getNode(), 1));
        return;
      }
      // S1/S2 cores.
      Results.push_back(LowerLibCall(SDValue(N, 0), DAG, "_COM_mulsi", true,
                                     {N->getOperand(1), N->getOperand(2)}));
      return;
    }
    case Intrinsic::rl78_mulul: {
      Results.push_back(LowerLibCall(SDValue(N, 0), DAG, "_COM_mulul", false,
                                     {N->getOperand(1), N->getOperand(2)}));
      return;
    }
    case Intrinsic::rl78_mulsl: {
      Results.push_back(LowerLibCall(SDValue(N, 0), DAG, "_COM_mulsl", false,
                                     {N->getOperand(1), N->getOperand(2)}));
      return;
    }

    case Intrinsic::rl78_divul: {
      if (isConstantZero(N->getOperand(2))) {
        // CC-RL: When divisor y is 0, 0xFFFFFFFF is returned.
        Results.push_back(DAG.getConstant(0xFFFF'FFFF, dl, MVT::i32));
        return;
      }
      SDValue ZExt =
          DAG.getNode(ISD::ZERO_EXTEND, dl, MVT::i32, N->getOperand(2));
      // TODO: CCRL may have a dedicated function (without the
      // extension).
      if (Subtarget->isRL78S3CoreType())
        Results.push_back(
            DAG.getNode(ISD::UDIV, dl, MVT::i32, N->getOperand(1), ZExt));
      else
        Results.push_back(LowerLibCall(SDValue(N, 0), DAG,
                                       getLibcallName(RTLIB::UDIV_I32), false,
                                       {N->getOperand(1), ZExt}));
      return;
    }

