ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78ISelLowering.cpp
    case Intrinsic::rl78_macsi: {
      Results.push_back(
          LowerLibCall(SDValue(N, 0), DAG, "_COM_macsi", true,
                       {N->getOperand(1), N->getOperand(2), N->getOperand(3)}));
      return;
    }

    case Intrinsic::rl78_macui: {
      Results.push_back(
          LowerLibCall(SDValue(N, 0), DAG, "_COM_macui", false,
                       {N->getOperand(1), N->getOperand(2), N->getOperand(3)}));
      return;
    }
    default:
      llvm_unreachable("Invalid intrinsic ID");
    }
    return;
  }
  // case ISD::TargetFrameIndex:
  // case ISD::FrameIndex: {
  //  Results.push_back(DAG.getTargetFrameIndex(cast<FrameIndexSDNode>(N)->getIndex(),
  //  MVT::i16)); return;
  //}
  // case ISD::Constant: {
  //  assert((N->getValueType(0) != MVT::i32) && "Invalid value type for
  //  Constant!"); return;
  //}
  // case ISD::UNDEF: {
  //  assert((N->getValueType(0) != MVT::i32) && "Invalid value type for
  //  UNDEF!");
  //  // UNDEF by itsels should be of the right type.
  //  // In case like when it's second operand of an LOAD for example it is the
  //  wrong size.
  //  // We hanlde those case in LowerOperationWrapper.
  //  return;
  //}
  case ISD::BUILD_PAIR: {
    Results.push_back(N->getOperand(0));
    Results.push_back(N->getOperand(1));
    return;
  }
  case ISD::GlobalAddress: {
    assert((N->getValueType(0) == MVT::i32) &&
           "Invalid value type for GlobalAddress!");
    const GlobalValue *GV =
        cast<GlobalAddressSDNode>(SDValue(N, 0))->getGlobal();
    int64_t Offset = cast<GlobalAddressSDNode>(SDValue(N, 0))->getOffset();
    SDValue LowAddress = DAG.getTargetGlobalAddress(
        GV, SDLoc(SDValue(N, 0)), MVT::i16, Offset, RL78MCExpr::VK_RL78_LOWW);
    SDValue HiAddress = DAG.getTargetGlobalAddress(
        GV, SDLoc(SDValue(N, 0)), MVT::i16, Offset, RL78MCExpr::VK_RL78_HIGHW);
    SDValue low =
        DAG.getNode(RL78ISD::LOW16, SDLoc(LowAddress), MVT::i16, LowAddress);
    Results.push_back(low);
    Results.push_back(
        DAG.getNode(RL78ISD::HI16, SDLoc(HiAddress), MVT::i16, HiAddress, low));
    return;
  }
  case ISD::SELECT: {
    // TODO: others? ABS?
    // If the select is the only use of the setcc we can safely convert it.
    // SDValue N0 = N->getOperand(0);
    // if (N0->hasOneUse() &&
    //    //(N0->getOperand(1).getValueType() ==
    //    N->getOperand(1).getValueType())
    //    ////&&
    //    (N0->getOperand(0) == N->getOperand(1)) &&
    //    (N0->getOperand(1) == N->getOperand(2))) {
    //  ISD::CondCode CC = cast<CondCodeSDNode>(N0->getOperand(2))->get();
    //  bool isSigned;
    //  // OBS. We don't have a RTLIB Libcall for integer (u)min/(u)max.
    //  const char *libCallName = nullptr;
    //  switch (CC) {
    //  case ISD::SETUGE:
    //  case ISD::SETUGT:
    //    libCallName = "__umax";
    //    isSigned = false;
    //    break;
    //  case ISD::SETGE:
    //  case ISD::SETGT:
    //    libCallName = "__smax";
    //    isSigned = true;
    //    break;
    //  case ISD::SETULE:
    //  case ISD::SETULT:
    //    libCallName = "__umin";
    //    isSigned = false;
    //    break;
    //  case ISD::SETLE:
    //  case ISD::SETLT:
    //    libCallName = "__smin";
    //    isSigned = true;
    //    break;
    //  default:
    //    break;
    //  }
    //  // TODO: we should only do this for code size.
    //  if (libCallName) {
    //    Results.push_back(
    //        LowerLibCall(SDValue(N, 0), DAG, libCallName, isSigned, 1));
    //  }
    //}
    return;
  }
  case ISD::BSWAP: {
    if (N->getSimpleValueType(0) == MVT::i64) {
      Results.push_back(
          createBSWAPNodes(N->getOperand(0), EVT(MVT::i64), DAG, dl));
      return;
    } else {
      // 32-bit BSWAP.
      EVT HalfVT = N->getValueType(0).getHalfSizedIntegerVT(*DAG.getContext());
      SDValue one = DAG.getConstant(1, dl, HalfVT);
      SDValue zero = DAG.getConstant(0, dl, HalfVT);
      SDValue op0lo =
          DAG.getNode(ISD::EXTRACT_ELEMENT, dl, HalfVT, N->getOperand(0), zero);
      SDValue op0hi =
          DAG.getNode(ISD::EXTRACT_ELEMENT, dl, HalfVT, N->getOperand(0), one);
      SDValue xchw = DAG.getNode(RL78ISD::XCHW, dl,
                                 DAG.getVTList(HalfVT, HalfVT), op0lo, op0hi);
      Results.push_back(SDValue(xchw.getNode(), 0));
      Results.push_back(SDValue(xchw.getNode(), 1));
      return;
    }
  }
  case ISD::MUL:
    assert(N->getValueType(0) == MVT::i32 &&
           "Invalid value type for multiplication!");
    if (Subtarget->isRL78S3CoreType() &&
        (((N->getOperand(0)->getOpcode() == ISD::ZERO_EXTEND) &&
          (N->getOperand(1)->getOpcode() == ISD::ZERO_EXTEND)) ||
         ((N->getOperand(0)->getOpcode() == ISD::SIGN_EXTEND) &&
          (N->getOperand(1)->getOpcode() == ISD::SIGN_EXTEND)))) {
      return;
    }
    Results.push_back(
        LowerLibCall(SDValue(N, 0), DAG, getLibcallName(RTLIB::MUL_I32),
                     N->getOperand(0)->getOpcode() == ISD::SIGN_EXTEND));
    return;
  case ISD::LRINT:
  case ISD::LROUND: {
    if (N->getOperand(0).getValueType() == MVT::f64) {
      Results.push_back(LowerLibCall(
          SDValue(N, 0), DAG, getLibcallName(RTLIB::FPTOSINT_F64_I32), true));
    } else {
      Results.push_back(LowerLibCall(
          SDValue(N, 0), DAG, getLibcallName(RTLIB::FPTOSINT_F32_I32), true));
    }
    return;
  }
  }
}

/// Replace any address related nodes which don't have the right type with the
/// right one. GlobalAddress etc. will be handled by ReplaceNodeResults because
/// we will always need to replace them however in case of a Contant for example
/// it's OK for it to be in 32 bit wide in case of an 32 bit addtion but not in
/// case of a 32 bit address from a load.
static void ReplaceOperand(const SDValue &N, SmallVectorImpl<SDValue> &Results,
                           SelectionDAG &DAG) {
  SDLoc dl(N);
  // N.dump();
  switch (N.getOpcode()) {
  case ISD::ADD: {
    if ((N->getValueType(0) == MVT::i32) &&
        (N.getOperand(1).getOpcode() == ISD::Constant &&
         cast<ConstantSDNode>(N.getOperand(1))->getZExtValue() <= UINT16_MAX)) {
      SDValue LoIndex = DAG.getConstant(0, dl, MVT::i16);
      SDValue HiIndex = DAG.getConstant(1, dl, MVT::i16);
      SDValue LoHalf = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                   N.getOperand(0), LoIndex);
      SDValue HiHalf = DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16,
                                   N.getOperand(0), HiIndex);
      Results.push_back(DAG.getNode(
          RL78ISD::HI16, dl, MVT::i16, HiHalf, LoHalf,
          DAG.getConstant(
              cast<ConstantSDNode>(N.getOperand(1))->getZExtValue(),
              dl, MVT::i16)));
      return;
    }
    // Fall-through.
  }
  default:
    // Default implementation: extract low/high 16-bit part and pair them back
    // togheter.
    if (N->getValueType(0) == MVT::i32) {
      SDValue LoIndex = DAG.getConstant(0, dl, MVT::i16);
      SDValue HiIndex = DAG.getConstant(1, dl, MVT::i16);
      SDValue LoHalf =
          DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, N, LoIndex);
      SDValue HiHalf =
          DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, N, HiIndex);
      Results.push_back(
          DAG.getNode(RL78ISD::HI16, dl, MVT::i16, HiHalf, LoHalf));
    }
    return;
  case ISD::BUILD_PAIR: {
    // if(N->getValueType(0) == MVT::i32)
    // Results.push_back(N->getOperand(0));
    // Results.push_back(N->getOperand(1));
    SDValue Hi8 = DAG.getNode(RL78ISD::HI16, dl, MVT::i16, N->getOperand(1),
                              N->getOperand(0));
    Results.push_back(Hi8);
    return;
  }
  case ISD::UNDEF:
    if (N->getValueType(0) == MVT::i32)
      Results.push_back(DAG.getNode(ISD::UNDEF, dl, MVT::i16));
    // else Results.push_back(N);
    return;
  case ISD::GlobalAddress: {
    if (N->getValueType(0) == MVT::i32) {
      const GlobalValue *GV = cast<GlobalAddressSDNode>(N)->getGlobal();
      int64_t Offset = cast<GlobalAddressSDNode>(N)->getOffset();
      SDValue LowAddress = DAG.getTargetGlobalAddress(
          GV, dl, MVT::i16, Offset, RL78MCExpr::VK_RL78_LOWW);
      SDValue HiAddress = DAG.getTargetGlobalAddress(GV, dl, MVT::i16, Offset,
                                                     RL78MCExpr::VK_RL78_HIGHW);
      SDValue Low16 = DAG.getNode(RL78ISD::LOW16, dl, MVT::i16, LowAddress);
      SDValue Hi8 = DAG.getNode(RL78ISD::HI16, dl, MVT::i16, HiAddress, Low16);
      Results.push_back(Hi8);
    }
    return;
  }
  }
}

// This callback is invoked by the type legalizer to legalize nodes with an
// illegal operand type but legal result types.  It replaces the
// LowerOperation callback in the type Legalizer.
// For RL78 we need this in case of __far data.
void RL78TargetLowering::LowerOperationWrapper(
    SDNode *N, SmallVectorImpl<SDValue> &Results, SelectionDAG &DAG) const {
  SDLoc dl(N);
  switch (N->getOpcode()) {
  default:
    llvm_unreachable("Do not know how to custom type legalize this operation!");
    return;
  case ISD::INTRINSIC_WO_CHAIN: {
    switch (N->getConstantOperandVal(0)) {
    case Intrinsic::rl78_remul:
      Results.push_back(LowerIntrinsicWithoutChain(SDValue(N, 0), DAG));
      return;
    default:
      llvm_unreachable("Unexpected intrinsic with chain!");
      break;
    }
    return;
  }
  case ISD::ADDRSPACECAST: {
    assert(N->getValueType(0) == MVT::i16);
    AddrSpaceCastSDNode *CastNode = dyn_cast<AddrSpaceCastSDNode>(N);
    if (CastNode->getDestAddressSpace() != RL78AS::Far) {
      if (N->getOperand(0).getOpcode() == ISD::GlobalAddress) {
        if (N->getOperand(0)->getValueType(0) == MVT::i32) {
          const GlobalValue *GV =
              cast<GlobalAddressSDNode>(N->getOperand(0))->getGlobal();
          int64_t Offset =
              cast<GlobalAddressSDNode>(N->getOperand(0))->getOffset();
          SDValue TGA = DAG.getTargetGlobalAddress(GV, dl, MVT::i16, Offset);
          SDValue Low16 = DAG.getNode(RL78ISD::LOW16, dl, MVT::i16, TGA);
          Results.push_back(Low16);
        }
      } else {
        SDValue trunc =
            DAG.getNode(ISD::TRUNCATE, dl, MVT::i16, N->getOperand(0));
        Results.push_back(trunc);
      }
    } else {
      llvm_unreachable(
          "Do not know how to custom type legalize this operation!");
    }
    return;
  }
  case ISD::LOAD: {
    SmallVector<SDValue, 8> OpResults;
    ReplaceOperand(N->getOperand(1), OpResults, DAG);
    ReplaceOperand(N->getOperand(2), OpResults, DAG);
    if (OpResults.size() > 0) {
      LoadSDNode *LD = cast<LoadSDNode>(N);
      SDValue load = DAG.getExtLoad(
          LD->getExtensionType(), dl, N->getValueType(0), N->getOperand(0),
          OpResults[0], LD->getPointerInfo(), LD->getMemoryVT(),
          LD->getAlignment(), LD->getMemOperand()->getFlags(), LD->getAAInfo());
      Results.push_back(load.getValue(0));
      Results.push_back(load.getValue(1));
    }
    return;
  }
  case ISD::STORE: {
    SmallVector<SDValue, 8> OpResults;
    ReplaceOperand(N->getOperand(2), OpResults, DAG);
    ReplaceOperand(N->getOperand(3), OpResults, DAG);
    if (OpResults.size() > 0) {
      StoreSDNode *ST = cast<StoreSDNode>(N);
      Results.push_back(
          DAG.getStore(N->getOperand(0), dl, N->getOperand(1), OpResults[0],
                       ST->getPointerInfo(), ST->getAlignment(),
                       ST->getMemOperand()->getFlags(), ST->getAAInfo()));
      // Results[0].dump();
    }
    return;
  }
  case ISD::EXTRACT_ELEMENT: {
    SmallVector<SDValue, 8> OpResults;
    ReplaceOperand(N->getOperand(1), OpResults, DAG);
    if (!OpResults.empty()) {
      // N->getOperand(0)->dump();
      Results.push_back(DAG.getNode(ISD::EXTRACT_ELEMENT, dl,
                                    N->getValueType(0), N->getOperand(0),
                                    OpResults[0]));
    }
    return;
  }
  case RL78ISD::CALL: {
    if (N->getOperand(1).getValueType() == MVT::i32) {
      SmallVector<SDValue, 8> OpResults;
      ReplaceOperand(N->getOperand(1), OpResults, DAG);
      SDVTList NodeTys = DAG.getVTList(MVT::Other, MVT::Glue);
      SmallVector<SDValue, 8> Ops;
      Ops.push_back(N->getOperand(0)); // Chain
      Ops.push_back(OpResults[0]);     // Callee
      for (unsigned int i = 2; i < N->getNumOperands(); i++)
        Ops.push_back(N->getOperand(i));
      SDValue callNode = DAG.getNode(RL78ISD::CALL, dl, NodeTys, Ops);
      Results.push_back(callNode.getValue(0));
      Results.push_back(callNode.getValue(1));
    } else {
      llvm_unreachable(
          "Do not know how to custom type legalize this operation!");
    }
  }
  }
}
